[{"chunk_id": "543010c8", "title": "Minutes of the meeting from MetaKGP's first meetup for 2017-2018", "text": "Time and venue: 2100 hrs at Veggies\nDuration: 2 hours\nAttendees:\n• Naresh Ramesh\n• Siddharth Kannan\n• Arun Patro\n• Ayush Goyal\n• Nishant Nikhil\n• Athitya Kumar\n• Kaustubh Hiware\n• Hemant Kumar\nMinutes/TLDR:\n• Decide potential contestants for the upcoming elections\n• Ask Hemant Kumar (sophomore) about what he feels are the drawbacks/issues with MetaKGP\n• Discuss possible improvements to the Wiki, with detailed discussions on a review system for all subjects.\n• Discuss the state of the Dashboard and its individual components (especially Cab Centrale and Cab booking portal).\n• Discuss dates and moonshots for the upcoming HackDay\n• Pitch new projects to be taken up this semester\n• Discuss administrative issues including the need for a professor mentor, funding and a permanent room for MetaKGP.\n• Create an agenda for the month", "page": "2017-07-27"}, {"chunk_id": "bdd36f5d", "title": "Create a list of potential contestants", "text": "A list of current active members was created whom the current Election Coordinator (EC) Arun Patro will be contacting.", "page": "2017-07-27"}, {"chunk_id": "66c315a0", "title": "A sophomore's views on the current drawbacks / issues with MetaKGP", "text": "• There is not enough motivation to contribute to the Wiki. Initial contributors get worn out soon.\n• There are not enough contributors to the Wiki.\n• The Wiki should contain 'funda' from graduating seniors to preserve their learnings from their 4 years in the campus that can be beneficial to the newer batches.\n• The Wiki doesn't always have original content and has a lot of material copied over directly from other sites.\n• A huge number of courses (majorly electives/breadth subjects) are not yet listed on the Wiki.", "page": "2017-07-27"}, {"chunk_id": "689e59ea", "title": "The state of MFQP", "text": "The current system in place to collect question papers feels complicated and acts as a major barrier to new contributors. Moreover, there are no 'instructions' on the current site describing how to add new question papers. Hemant Kumar will be working to fix this. He has proposed to solve it using a simpler upload portal, which he will be discussing on our Slack channels before starting work.", "page": "2017-07-27"}, {"chunk_id": "4aec3e0b", "title": "The state of the Wiki", "text": "A major suggestion from Arun Patro and Ayush Goyal was that the Wiki should have a review system in place for all courses. A long discussion ensued on the same, and the following was decided:\n• A course review system should be in place where students can leave their reviews and ratings for each course. To start with, Arun Patro will be creating a google form through which volunteers from the group can each fill reviews for at least 5 courses from their department. This reviews will eventually be channelled back to the Wiki manually. This could prove as a starting point for future contributors to leave reviews.\n• Ayush Goyal will be working on a portal through which students can upload notes for a course (which will be uploaded to archive.org). These notes will be linked on the course page. A future addition to this could be a way to leave a rating on these notes so as to sort them by rating later on.", "page": "2017-07-27"}, {"chunk_id": "04e87b0e", "title": "The state of 'The dashboard'", "text": "A dashboard was created by 4 members from MetaKGP during Inter-IIT Tech Meet at IIT Kanpur. This dashboard is to be released to the general public (i.e. KGPians) sometime this year. Some of the individual components of the dashboard were discussed in further detail:", "page": "2017-07-27"}, {"chunk_id": "df35151e", "title": "ERP Authentication", "text": "Naresh Ramesh will be working with Siddharth Kannan to encrypt the user's ERP credentials (used for components like MFQP) on the dashboard before sending it through the network.", "page": "2017-07-27"}, {"chunk_id": "9f433632", "title": "KGP Cab Centrale", "text": "Aimed at replacing the current Facebook group by the same moniker used by KGPians, KGP Cab Centrale should ease the process of finding partners for Cab pooling. This component of the dashboard was implemented completely during the Tech Meet and will be made public by the end of the week to the KGP public. Key functionalities included creating postings and searching using from/to location, time, time flexibility and the number of available seats as parameters.", "page": "2017-07-27"}, {"chunk_id": "a22d6a35", "title": "Cab booking portal", "text": "A cab booking portal was also created during the Tech Meet, that worked on the principle of giving the Cab Drivers in KGP an app to indicate their current availability. A page would be available on the dashboard that shows the list of registered drivers and their mobile numbers, alongside their current status. This idea will now be pivoted to indicate the live status of restaurants instead, which is more feasible. This idea is currently in low-priority and will be worked upon next semester.", "page": "2017-07-27"}, {"chunk_id": "bceebb41", "title": "Buy/Sell portal", "text": "To be worked on by Ayush Goyal, Rameshwar Bhaskaran, Athitya Kumar and Naresh Ramesh", "page": "2017-07-27"}, {"chunk_id": "6d4b4610", "title": "Hackday", "text": "The first Hackday for the year will be held in the 3rd / 4th week of August (To-be announced). Some of the moonshot ideas for the HackDay that were suggested during the meeting were:\n• Use MetaKGP's Wiki data to train a Word2Vec for KGP\n• \"Google Maps for KGP\" that can be created using the Google Maps API and links Wiki articles to locations on the map\n• /r/place for KGP\n• Foundation for NUSMods for KGP", "page": "2017-07-27"}, {"chunk_id": "6480df1a", "title": "YouTube caching within KGP", "text": "The idea is to create a caching system within KGP that aims to bring down the total bandwidth usage within campus by using cached data when available for YouTube videos. Nishant Nikhil and Naresh Ramesh have started work on this, and will soon make the work public.", "page": "2017-07-27"}, {"chunk_id": "54b0c763", "title": "Migrate 'Listen To This KGP' under MetaKGP", "text": "Listen To This KGP is a popular Facebook group where KGPians share their favourite music through YouTube links. Naresh Ramesh is working on a standalone site that will exist alongside the Facebook group that fetches the content posted on the group and creates playlists and smart filters through filters like user, artist, genre, etc.", "page": "2017-07-27"}, {"chunk_id": "6e9d1b8f", "title": "Elections", "text": "There was a discussion on whether the current system of having elections every 4 months was too frequent, and should be done every 6 months instead. The discussion ended with choosing to continue with the current system.", "page": "2017-07-27"}, {"chunk_id": "53d64a54", "title": "Professor involvement", "text": "Getting a professor as a mentor for MetaKGP was considered and will be discussed further on the Slack channel. The initial response to the idea was positive for the decision.", "page": "2017-07-27"}, {"chunk_id": "2b1648d7", "title": "Transition into a Gymkhana society", "text": "The pros and cons of moving to a Gymkhana society were discussed. The issue stemmed from the issue of insufficient funds for MetaKGP right now, and the realisation that depending on funding from seniors will not work out in the long term. Discussion to be continued on the Slack channels.", "page": "2017-07-27"}, {"chunk_id": "2d12af6b", "title": "The need for a permanent room for MetaKGP", "text": "This is possible only if the previous point is satisfied. The motive would be to increase overall developer productivity when working together on projects. Not high priority.", "page": "2017-07-27"}, {"chunk_id": "337e4a88", "title": "Agenda for the month", "text": "• Redirect metakgp.org to metakgp.github.io, which will be improved upon by Kaustubh Hiware to better describe MetaKGP and its projects\n• Arun Patro to circulate the Google form for course reviews\n• Naresh Ramesh to deploy the dashboard as is, and to release Cab Centrale.", "page": "2017-07-27"}]