[{"chunk_id": "dadfd50b", "title": "2017 Suicides Ordeal", "text": "Please note that this page may feel unpleasant and isn't recommended for everyone. If you know someone in crisis or you're looking for someone to talk to someone yourself, please contact Aasra's 24x7 Helpline at 91-22-27546669 or schedule an appointment with KGP's counselling centre at (+91) 3222 283576.\nIn the year 2017, IIT Kharagpur saw 5 student suicides . This is the highest number of suicides IIT Kharagpur witnessed in a single calendar year.\nFile:Keep them alive.jpg Poster circulated within IIT Kharagpur following the numerous unfortunate suicides within the campus in 2017.", "page": "2017 Suicides Ordeal"}, {"chunk_id": "0d9a08a4", "title": "Open House with the Director in Oct 2017", "text": "Open House Video\nThis was the email sent by VP Mayank Srivastava right after the open house: http://archive.today/wV4Ol [ 1 ]", "page": "2017 Suicides Ordeal"}, {"chunk_id": "b0923c75", "title": "Coverage in Indian Media", "text": "The coverage of these suicides was limited to local and state-wide media organizations. There were no debates or editorial pieces written at any of the major publications in India about this unfortunate series of happenings. Several local edition articles reported the news on a timely manner though. [ 2 ] [ 3 ] [ 4 ]", "page": "2017 Suicides Ordeal"}, {"chunk_id": "e5382476", "title": "See Also", "text": "• List of suicides\n• Reach Out Week\n• Touch Left and Touch Right\n• Counselling Centre", "page": "2017 Suicides Ordeal"}, {"chunk_id": "9d82bb89", "title": "References", "text": "↑ \"Awaaz, IIT Kharagpur - Posts\" . 2018-04-03. Archived from the original on 2018-04-03. ↑ \"IIT’s breaking point - Business Line\" . 2018-04-03. Archived from the original on 2018-04-03. ↑ \"IIT student commits suicide: IIT-Kharagpur student found hanging in h…\" . 2018-04-03. Archived from the original on 2018-04-03. ↑ \"Is IIT Kharagpur Ignoring Student Suicide Cases?\" . 2018-04-03.", "page": "2017 Suicides Ordeal"}]