[{"chunk_id": "61eecb19", "title": "2018-05-15 Altercation between protesting students and security staff", "text": "Around 11 pm on May 14th, 2018, Security staff at IIT Kharagpur clamped down on a group of students who were trying to organize a protest. By all accounts, the protest was a peaceful one and was being organized to show solidarity with the students of Aligarh Muslim University, who were on a hunger strike against a laathi charge conducted by the police against them. [ 1 ] [ 2 ] [ 3 ] [ 4 ]\nThe protest was being organized by a student group called the Ambedkar Bhagat Singh Study Circle, IIT Kharagpur. This group is not registered with the gymkhana as a recognized society. They organized the event leveraging social media and a mailing list. The event was called Solidarity Gathering for AMU and it's main aim was to show people around the country that students from all pockets opposed the laathi charge on the students of AMU.\nThe then-President of TSG, Prof. William K Mohanty, sent an institute-wide email with the subject \"Unauthorized Political Event\" saying We expect that students of IIT Kharagpur will not participate in any such event. TSG does not support any such activity. Despite this email, the protest continued when 40 students turned up at the venue at the arranged time and tried to conduct a peaceful protest. Several SIS security officers (number unconfirmed) were deployed near the Gymkhana right before the arranged time for the protest. Photos and one video in which the security officer for IIT Kharagpur is seen screaming at a student who refuses to tell him his hall of residence was later published on the Facebook page of the Ambedkar Bhagat Singh Study Circle, IIT Kharagpur. [ 5 ] [ 6 ]", "page": "2018-05-15 Altercation between protesting students and security staff"}, {"chunk_id": "84bde0b5", "title": "Timeline", "text": "Time | Event | People involved\n14 May 1816 | TSG President sends out an email to all students | President, TSG (Prof. W K Mohanty)\n15 May 0030 | ABSSC posts photos and videos from the protest on their Facebook page | ABSSC\n16 May 0922 | ABSSC sends out an email on their public mailing list | ABSSC\n17 May 1622 | VP, TSG sends out an email to all the students | VP, TSG (Vishal Singh)\n??? | Somesh Kumar comments on the Facebook event for the gathering | Prof. Somesh Kumar (then-Dean of Student Affairs)", "page": "2018-05-15 Altercation between protesting students and security staff"}, {"chunk_id": "c085887b", "title": "Dean of Student Affairs, Prof. Somesh Kumar's comment on Facebook", "text": "Prof. Somesh Kumar replied to a comment by Abhilash Gollapalle that said: [ 7 ]\nIs this organized by the GymK or any other administration within IIT? Because I doubt if an individual or a group of individuals can speak for the entire campus or the official administration when they say that \"IIT Kharagpur stands with AMU\"\nHis reply was:\nNo this is organized by some anti-national elements. They want to spoil the image of IIT Kharagpur", "page": "2018-05-15 Altercation between protesting students and security staff"}, {"chunk_id": "74b6cea1", "title": "Email from President of Technology Students Gymkhana, Prof. William K Mohanty", "text": "Time: Monday 14 May 2018 06:16 PM\nSubject: Unauthorized political Event\nDear Friends, It is being observed that some groups without any permission are organizing some political events in IIT Kharagpur but tagging the name of IIT Kharagpur. This is to inform you that such events are completely illegal and have no sanction of institute authority. IIT Kharagpur is an institution of national importance and we do not encourage any activity which escalates tensions in the society in the name of political affiliation, religion, caste and region. Our sole aim is to promote development of science and technology and nationalistic fervour among students. We expect that students of IIT Kharagpur will not participate in any such event. TSG does not support any such activity. Best wishes William K. Mohanty President, TSG IIT Kharagpur", "page": "2018-05-15 Altercation between protesting students and security staff"}, {"chunk_id": "b6f6f7a8", "title": "Email on a mailing list sent by ABSSC, IIT Kharagpur", "text": "Time: Wednesday 16 May 2018 09:22 AM\nSubject: [spark] Attack on free speech at IIT Kharagpur\nDear All, The Hizli jail housed in the IIT Kharagpur campus had hosted numerous revolutionaries who have laid down their lives in order to establish freedom and democracy for their motherland. The same campus witnessed a mockery of democracy when a peaceful gathering of IIT students was attacked by the security personnel of IIT Kharagpur. It all started with a circular issued on the 14th of May, 2018 asking students to obtain permission from relevant authorities before exercising their right to freedom of speech and assembly. Later, on the same day hundreds of security guards were posted at the gymkhana to prevent a group of students from expressing solidarity with the students of Aligarh Muslim University (AMU) sitting in hunger strike against the brutal lathicharge carried out on them on the 2nd of May that left 20 students injured. The circular issued by the competent authorities on the 14th of May goes against the student's fundamental right to freedom of assembly and speech. The purpose of any protest is to voice ones resentment against the authorities in power and the act of asking permission for the same while facing threats and with all possibilities of a denial defeats the objective of such an exercise in the first place. It needs mentioning that in the protest march organized for Asifa in IIT Kharagpur, a gathering of 400 individuals were restricted from raising their voices against the barbaric perpetrators of the crime. At a time when the entire country was standing for a cause, the students of an “Institute of National Importance”- IIT Kharagpur were asked to remain silent. However, the students without paying heed to the intimidating tactics of the administration completed a rally and raised their voices for justice. Be it the institutional murder of Rohith Vemula in HCU, the brutal repression of students in JU during Hok Kolorob or the recent harassment of female students in BHU (and in numerous other instances), Ambedkar Bhagat Singh Study Circle along with other progressive student voices have always protested against the silencing of democratic voices and the autocratic high handling by institute authorities across different institutions in the country. In the present instance, 40 students braved the threats from the Dean of Students Affairs to stand for justice for their friends sitting in hunger strike against brutal police oppression at the Aligarh Muslim University. The assistant security officer, Mr. Sushil Kumar Choubey literally went to the extent of heckling a student by force while he was trying to enter the JC Bose Hall of residence. Such an act speaks volumes regarding the undemocratic and intolerant attitude of the administration and the free hand given to security personnel to deal with dissent in the campus. Earlier during the day, the Dean of Student Affairs, Prof. Somesh Kumar labelled the organizers of the protest as “anti-national” elements and accused them of bringing disrepute to the institute. Unfortunately, such is the times that any act not conforming with the diktats of the ruling dispensation is termed as “anti-national”. The remark is not only derogatory but also exposes the extent to which the authorities in power can stoop down to harass students fighting for justice and equality. We strongly feel that even few years back “anti-national” was not a word that was used so casually as has been done in recent times. While Mohammad Hamid Ansari, the former vice-president of the country have stood by the protesting students of AMU, students from IIT Kharagpur in solidarity with them were branded “anti-national”. Is standing in solidarity with the students in hunger strike opposing against the entry of armed right winged goons in an academic campus “anti-national”? Will the act of ignoring the brutal reality of our times really make us better individuals? The mail circulated by the Dean of Student Affairs, Prof. Somesh Kumar accused the organizers of being politically motivated and therein he has raised his concerns regarding the affiliation of IIT Kharagpur being used for such protests. It is to be noted that in spite of the institute despising all things political, there are significant right wing activities going on in the campus and there are facebook groups using the IIT affiliation for the same. Next, while discussing the point of “activities that escalate tensions in the society in the name of political affiliation, religion, caste and region” it should be kept in mind that the different institute talks and lectures graced by different Hindu monks, promotes a particular religious belief and in turn vitiates the secular atmosphere of the campus. We are sure that there are good aspects of other religion too if AT ALL religious activities needs to be carried out in the institute premises. This kind of majoritarianism definitely adds in (if not escalate) tensions in the society. Next, when Darwinism is under attack, we definitely look forward to the institute authorities for the upliftment of scientific temper and critical thinking as opposed to the promotion of some organizations and individuals engaged in business models of spiritual corporations (read Art of Living, ISKON). Lastly, while discussing instilling of “nationalistic fervor” among students, we should always keep in mind that dissent is the cornerstone of a healthy and functioning democracy. An academic campus that doesn't promote free speech and progressive thinking is definitely not dedicated to the service of the nation. Keeping the present situation in mind, we challenge Prof. Somesh Kumar to present us with evidence that proves that we have done anything that defies the Constitution of the country. Hereafter, we demand that - 1) Prof. Somesh Kumar must withdraw his “anti-national” statement and refrain from making such comments in the future. 2) Mr. Sushil Kumar Choubey should publicly apologize for arrogant behavior and manhandling of students. 3) And finally, we urge the administration to re-establish the fundamental rights granted to all citizens of the country by the Constitution in the campus premises. Some images related to the incident can be found in the following link. https://drive.google.com/open?id=1zizNqebDMUeL_46Joqs8dHQI7-s4nxxi Regards, Team ABSC.", "page": "2018-05-15 Altercation between protesting students and security staff"}, {"chunk_id": "d9ccce89", "title": "References", "text": "↑ \"AMU row: Tear down Jinnah's portrait, says Muslim Mahasangh chief; up…\" . 2018-05-17. Archived from the original on 2018-05-17. ↑ \"Jinnah portrait row: Probe ordered in AMU controversy, internet suspe…\" . 2018-05-17. Archived from the original on 2018-05-17. ↑ \"Police resort to lathi-charge to disperse protesting AMU students A…\" . 2018-05-17. Archived from the original on 2018-05-17. ↑ \"IIT bar on protests irks students - Telegraph India\" . 2018-05-17. Archived from the original on 2018-05-17. ↑ \"Condumn the attack by authorities on PEACEFUL GATHERING ... (Video)\" . 2018-05-14. ↑ \"CONDEMN THE ATTACK BY AUTHORITIES ON PEACEFUL GATHERING ... (Photos)\" . 2018-05-15. ↑ \"IIT Kharagpur Dean of Student Affairs comment on Facebook\" . 2018-05-15.", "page": "2018-05-15 Altercation between protesting students and security staff"}]