[{"chunk_id": "info_f01360", "title": " Indira Gandhi Hall of Residence - Quick Facts", "text": "Sarojini Naidu / Indira Gandhi Hall of Residence\nHome away from home.\nFounded | -\nMotto | Sanskrita Striya Shakti\nOffice\nWarden | Prof. Ratna Dutta\nAsst. Warden(s) | Niharika Sahoo Bhattacharya Prof. Parama Banerjee\nHall President | Kavita Kakar\nSSM\nOffice No. | +91-3222-281126\nWebsite | http://www1.iitkgp.ac.in/halls/home.php?hallcode=SN\nInfrastructure\nCapacity | 350\nAccomodation for | Female\nRoom Types | Single, Double, Triple\nDetails\nEateries | Fruit stall, Night canteen, Nescafe\nShops | Store", "page": " Indira Gandhi Hall of Residence"}, {"chunk_id": "cc8099cb", "title": " Indira Gandhi Hall of Residence", "text": "Sarojini Naidu / Indira Gandhi Hall, or the SN/IG Hall as it is commonly and more widely known as, proudly bears the names of two legendary women achievers in Indian history. The Hall firmly believes in its motto: Sanskrita Striya Parashakti.", "page": " Indira Gandhi Hall of Residence"}, {"chunk_id": "3d251bde", "title": "History", "text": "SN/IG hall of residence is one of the oldest hall in the Institute. For decades, the Hall has been the home away from home for both undergraduate and postgraduate women students. Despite the fewer number of its residents, the SN/IG Hall has carved its own niche in both academics and in various socio-cultural and sports events and competitions organized by the students’ Gymkhana. The Hall is also actively involved in all major students’ events such as the Spring Fest, Kshitij etc. In addition to representing IIT Kharagpur in various teams in Inter-IIT competitions, its residents have also consistently held offices at Technology Students’ Gymkhana.", "page": " Indira Gandhi Hall of Residence"}, {"chunk_id": "b8864658", "title": "Infrastructure", "text": "The hall is divided into A, B, C, E, F, G, H, N, NR, W, S blocks. in four different buildings.", "page": " Indira Gandhi Hall of Residence"}, {"chunk_id": "e92bb9d8", "title": "Sports facilities", "text": "The has its own basket ball court, well equipped gym, table tennis facilites.", "page": " Indira Gandhi Hall of Residence"}, {"chunk_id": "ea3c2d1c", "title": "Music room", "text": "The hall has a well furnished music room for singing and dance practices.", "page": " Indira Gandhi Hall of Residence"}, {"chunk_id": "b6bbcfc7", "title": "Hall Library", "text": "The hall has its own library managed by the student body that issues books to the hall borders for a complete semester.", "page": " Indira Gandhi Hall of Residence"}, {"chunk_id": "3dd45f36", "title": "Food and eateries", "text": "There is night canteen, Store, fruit stall and Nescafe in the hall.", "page": " Indira Gandhi Hall of Residence"}, {"chunk_id": "7f36b60d", "title": "Common rooms", "text": "There are two common rooms in the hall- Old and the new one. The new common room is well furnished air conditioned and has TV connection, projector screen.", "page": " Indira Gandhi Hall of Residence"}, {"chunk_id": "f5ef9af1", "title": "Study room", "text": "There is one study room with the AC and capacity of 24 students attached with library.", "page": " Indira Gandhi Hall of Residence"}, {"chunk_id": "008a402d", "title": "Spacious lawns", "text": "Gym Room\nWe have a fully functioning air conditioned GYM open 24/7", "page": " Indira Gandhi Hall of Residence"}, {"chunk_id": "ac3d0329", "title": "Alumni", "text": "The bond that grows by living together in the same Hall has knitted many generations of SN/IG residents together. Its alumni are spread over the globe holding prestigious positions in academics, in corporate organizations, and other fields. To name just a few, Dr Parvati Dev (B.S.1968) Director, Stanford University School of Medicine, and President, IIT Foundation, late Dr Nina Saxena (B Tech 1992), Dr Chaitali Sengupta (B.Tech 1992), systems architect in Texas Instruments and one among the 100 Top Young Innovators of 2004 (MIT Technology Review), Dr. Sanghamitra Bandopadhyay, Indian Statistical Institute, Dr Serene Bannerjee (B.Tech 1999) of INTEL, Lachmi Khemlani (B Arch,.1990), author, instructor at UC Berkeley, researcher, and consultant in CAD. etc.\nThe Hall allows its residents a taste of both freedom and responsibility as the affairs of the hall are managed by the students themselves. SN/IG Hall shall continue to churn out well-educated, empowered and aware citizens, dedicated to strive for excellence in their fields, thus reflecting the changing face of the new generation of Indian women.", "page": " Indira Gandhi Hall of Residence"}, {"chunk_id": "e21bb66d", "title": "Hall Council 2023-2024", "text": "Hall President - Sakshi Agarwal\nSecond Senate Member - Rhea Vigil\nGsec Technology - Akula Tejaswini\nGsec Social Cultural - Deepanajana Chakravarty\nGsec Maintenance - Anindita Malviya & Astha Kumari\nGsec Alumni Affairs - Ananya Singh\nGsec Mess - Pornima Gaikwad\nGsec Library - Lakhavath Niharika\nGsec Students Welfare - Gayathri Amulya\nGsec Sports & Games - Pravalika Das", "page": " Indira Gandhi Hall of Residence"}, {"chunk_id": "f89d3482", "title": "Events", "text": "• Illumination - The biggest Gymkhana event... It is the event that everyone participates in (willingly or otherwise) for a whole month. All for a matka of sweets! The ILU part really takes a lot more time (cleaning diyas, wiring them, drawing chatais, etc...) a shortage of man-power on the actual event date greatly restricts plans. However, SN has been doing very well in Rangoli off-late. A picture of the '96 rangoli (3rd position) is given above.\n• Hall-day - The one time of the year when you can bring guests to your room (without having to be critically ill!). The hall is decorated with lights and all, everybody buys a lot of food, and the E-TMS very obligingly puts up a performance. Authorities are usually worried about 'uninvited-guests'... so residents have to set up an extensive 'security' system to check for invitations.\n• Fresher's welcome- Just as the name suggests, it marks the end of the OP. Restrictions have now made it very hard to have an OP of any sort but the fresher's welcome still is the greatest source of entertainment.\n• Sophomore Party - Just as the name suggests, it marks the welcome of sophomores in the hall. Nowadays freshers are allocated IGH and onboarding of second years happens in snig not freshers anymore so we have this party and its there first party in the hall and it is the greatest source of entertainment and it marks the beginning of hall bonding\n• Final year Farewell - The final year farewell is markedly sober... ending in massive senti sessions with the final years handing out perps awards. It involves an extensively planned programme, a catwalk, a 'Miss SN' competition and some 'best senior in such and such awards'. This is accompanied by special dinner (where the mess ammas actually put up a good show) and ends in a lot of tempo shouts and dancing.", "page": " Indira Gandhi Hall of Residence"}]