[{"chunk_id": "379e6ece", "title": "Additional Course", "text": "From the THIRD semester onwards the curriculum offers scope for a student to opt for Additional subjects apart from the regular curriculum.", "page": "Additional Course"}, {"chunk_id": "6aecdcf1", "title": "Additional Credits", "text": "Following conditions are to be met for Additional Credits:\n• If a student has a Cumulative Grade Point Average (CGPA) equal to or greater than 7.50 without any backlog, he/she would be allowed to take additional subjects within and/or outside his/her own discipline to earn additional credits of up to 33% of his/her requirement for major. A student would be allowed to register in an additional subject only if he/she satisfies the pre-requisite, there is no clash in the timetable and the class size permits.\n• Once a student has registered in an additional subject, the grade obtained (including F-grade) in that subject would invariably be recorded in his/her grade card. The credit contribution of these additional subjects to the computation of CGPA, however, would be considered as nil.\n• The GPA of the additional subjects is separately calculated and indicated in the grade card.\n• A student can drop an additional subject following the proper procedure within 3(three) weeks from the commencement of the semester; otherwise, the subject will remain registered and the subject will be mandatorily reflected on the Grade Card even with F grade.\n• There is no scope for a supplementary examination in an additional subject.\n• Student can get Minor from other departments by completing required number of credits and full filling the requirements.", "page": "Additional Course"}, {"chunk_id": "33262913", "title": "Micro Credits", "text": "Micro-Credit courses are one credit courses having duration of 3‐14 days offered during the semester or during evening or free slots available during weekdays or even weekends that are not declared holidays in some special cases when students are available.\n• The subject will be counted for total credit requirement for completion of degree in special cases subject to recommendation of the Head and approval of Dean (UGS) with due reasons recorded.\n• The subject and grade will be mentioned in transcript / grade card and will be used to compute CGPA for additional subjects and will be shown as ACGPA. Failures will be marked by F grade. There will be no supplementary examination for such subjects. The F grade will be changed only if the subject is offered again and the student is allowed to register and clear the subject. However, in case the micro-credit is accepted as a subject contributing to the curricular requirement, it will be accounted for in the CGPA calculations.\n• A student is normally not expected to take more than 2 such courses in a semester. The subject may also be a part of minor and micro‐specialization.", "page": "Additional Course"}, {"chunk_id": "d6cf625a", "title": "References", "text": "UG Regulation Document", "page": "Additional Course"}]