[{"chunk_id": "info_6affe1", "title": "AE21001: Introduction To Aerodynamics - Quick Facts", "text": "AE21001\nCourse name | Introduction To Aerodynamics\nOffered by | Aerospace Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n6 6 7 13 8 13 1 EX A B C D P F | 6 | 6 | 6 | 6 | 7 | 7 | 13 | 13 | 8 | 8 | 13 | 13 | 1 | 1 | EX | A | B | C | D | P | F\n6 | 6 | 6 | 6 | 7 | 7 | 13 | 13 | 8 | 8 | 13 | 13 | 1 | 1\n6\n6\n7\n13\n8\n13\n1\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "AE21001: Introduction To Aerodynamics"}, {"chunk_id": "57f1ff7b", "title": "Syllabus mentioned in ERP", "text": "Concept of fluid and fluid motion, Fluid kinematics, Equations of continuity and motion, Steady and unsteady unidirectional flows, Circulation and vorticity, Stokes , Kelvin s and Helmholtz s theorems, Inviscid irrotational flow and velocity potential, Conformal transformation, The Zhukovsky transformation and Zhukovsky airfoils, The boundary layer concept, Laminar boundary layer equation, Momentum Integral Equation and its solution. Books:G K Batchelor, An Introduction to Fluid Dynamics, Cambridge University PressF M White, Viscous Fluid Flow, McGraw-Hill InternationalE L Houghton and A E Brock, Aerodynamics for Engineering Students, Edward ArnoldE L Houghton and N B Carruthers, Aerodynamics for Engineering Students, Edward ArnoldJ D Anderson, Jr., Fundamentals of Aerodynamics, McGraw-Hill International", "page": "AE21001: Introduction To Aerodynamics"}, {"chunk_id": "2b8a784d", "title": "Concepts taught in class", "text": "Mathematical Introduction to Tensors of 1st order and 2nd order calculations, Basics of Fluid mechanics\nTerminology of flight, fluid dynamics equation, Potential flows, Vorticity", "page": "AE21001: Introduction To Aerodynamics"}, {"chunk_id": "a8fb572c", "title": "Student Opinion", "text": "Many will loose interest after the \"Wing Geometry\" part. There are two options to cope up with the course: 1. if you miss classes, go for video lectures on NPTEL (very boring) and give at least 3 days to this course before exams. 2. if you go to classes and understand the course as explained by the prof, no need to check video lectures. Class notes are perfect if you understood in class.\nIt provides a foundation to further aerodynamics concepts, though mathematical, is important to understand\nThis course is very interesting and has a lot of scope to explore. This lays down the basic foundation of many future courses.", "page": "AE21001: Introduction To Aerodynamics"}, {"chunk_id": "7a864ffc", "title": "Classroom resources", "text": "Practice the notes given in class as questions are all dependent on them\nBe regular to the class as most of the questions come from the class notes. Maintain a proper class notes. Most of the questions come from the previous year question paper itself, so prepare accordingly.", "page": "AE21001: Introduction To Aerodynamics"}, {"chunk_id": "270b6c77", "title": "Additional Resources", "text": "Textbooks by J. D. Anderson for Aerodynamics, G.K Batchelor's Fluid Dynamics", "page": "AE21001: Introduction To Aerodynamics"}, {"chunk_id": "768b2ba6", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | NC231\nThursday | NC231\nFriday | NC231 | NC231", "page": "AE21001: Introduction To Aerodynamics"}]