[{"chunk_id": "info_c4af41", "title": "AE31001: Thermodynamics And Aerospace Prop.System - Quick Facts", "text": "AE31001\nCourse name | Thermodynamics And Aerospace Prop.System\nOffered by | Aerospace Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n7 11 17 7 4 6 3 EX A B C D P F | 7 | 7 | 11 | 11 | 17 | 17 | 7 | 7 | 4 | 4 | 6 | 6 | 3 | 3 | EX | A | B | C | D | P | F\n7 | 7 | 11 | 11 | 17 | 17 | 7 | 7 | 4 | 4 | 6 | 6 | 3 | 3\n7\n11\n17\n7\n4\n6\n3\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "AE31001: Thermodynamics And Aerospace Prop.System"}, {"chunk_id": "1fbdfe19", "title": "Syllabus mentioned in ERP", "text": "Basic concepts of thermodynamics, first and second laws of thermodynamics and their corollaries, Engine cycles; Basic Principles of Propulsion, Classification and Characteristics of Aerospace Propulsive Devices, Thermodynamic and Real Cycle Analysis, Aviation Fuels, Theory of Propellers; Centrifugal Compressor and its performance; Nozzles, Subsonic and Supersonic Intakes, Combustion Chambers; Rocket propulsion.Books:J D Mattingly, Elements of Gas Turbine Propulsion, McGraw-HillJ D Mattingly, W H Heiser, D H Daley, Aircraft Engine Design, AIAAE L Houghton and A E Brock, Aerodynamics for Engineering Students, Edward ArnoldS L Dixon, Fluid Mechanics, Thermodynamics of Turbomachinery, Pergamon PressH Cohen, G F C Rogers, and H Saravanamutto, Gas Turbine Theory, Longman", "page": "AE31001: Thermodynamics And Aerospace Prop.System"}, {"chunk_id": "9ff084d1", "title": "Concepts taught in class", "text": "Till Mid Sem:\nRevisit to the Thermodynamics learned during JEE, (quite essential since many of the term and properties taught are used throughout the course so it's good to be familiar with the concepts again). Some topics are new whereas topics such as Internal Energy, Entropy and Laws of thermodynamics are taught from a new perspective which helps to understand the topic that come after end sem.\nAfter End Sem:\nVarious kinds of engines used in Aerospace Industry are taught which is called Parametric Analysis. Topics covered before mid sem will be helpful here. Ramjet,Turbofan, Turbojet and Propeller based engines are the ones whose parametric study is done.On surface its just bunch of equations but beneath those equations its mostly conceptual design of ideal engines.", "page": "AE31001: Thermodynamics And Aerospace Prop.System"}, {"chunk_id": "5b619013", "title": "Student Opinion", "text": "This course is the first of the two courses on Propulsion Systems in Aerospace Engineering. Second being Theory of Jet Propulsion which comes in 6th Semester. So if you want minimise your efforts in the 6th semester it's better to preserve your notes and understanding of the Aircraft engine.I will not say the course is very interesting to make it sound interesting but this course and its follow up course are quite relevant in industry. Companies like Eaton, Pratt and Whitney( one of their book which you might follow during the course), IHI, GE and Rolls Royce do ask question during interview(Source: Seniors who gave off campus rounds(and placed) and Alumni who came during the Meet)", "page": "AE31001: Thermodynamics And Aerospace Prop.System"}, {"chunk_id": "bb4ee0dc", "title": "How to Crack the Paper", "text": "4 Rules 1. Attend your classes. 2. Go through the previous year paper. 3. Read the books (only the part which is taught in the class) because often times prof won't tell certain things clearly 4. See RULE #1", "page": "AE31001: Thermodynamics And Aerospace Prop.System"}, {"chunk_id": "198b25cd", "title": "Classroom resources", "text": "Most of the Material will be shared by the Prof. Otherwise till mid sem its Thermodynamics by PK Nag. And after End Sem Jack Mattingly Elements of Propulsion. And there is nptel lecture series of Jet Aircraft Propulsion by Bhaskar Roy of IIT Bombay good for the AE31008 as well and end sem of this course", "page": "AE31001: Thermodynamics And Aerospace Prop.System"}, {"chunk_id": "b274c670", "title": "Additional Resources", "text": "https://web.mit.edu/16.unified/www/FALL/thermodynamics/notes/\ntake it as your handbook of formulas for AE31008 and AE31001", "page": "AE31001: Thermodynamics And Aerospace Prop.System"}, {"chunk_id": "e3766485", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | NC334\nThursday | NC334\nFriday | NC334 | NC334", "page": "AE31001: Thermodynamics And Aerospace Prop.System"}]