[{"chunk_id": "info_373e05", "title": "AE31002: Aerospace Structural Dynamics - Quick Facts", "text": "AE31002\nCourse name | Aerospace Structural Dynamics\nOffered by | Aerospace Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n7 8 17 7 6 6 1 EX A B C D P F | 7 | 7 | 8 | 8 | 17 | 17 | 7 | 7 | 6 | 6 | 6 | 6 | 1 | 1 | EX | A | B | C | D | P | F\n7 | 7 | 8 | 8 | 17 | 17 | 7 | 7 | 6 | 6 | 6 | 6 | 1 | 1\n7\n8\n17\n7\n6\n6\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "AE31002: Aerospace Structural Dynamics"}, {"chunk_id": "40a00086", "title": "Syllabus mentioned in ERP", "text": "Prerequisites: AE21004 3 - 1 - 0: 4 CreditsIntroduction, discrete systems, matrix formulation, generalized equations of motion, generalized forces, response of undamped systems, special kinds of damping, gyroscopic systems, continuous systems, variational approach, classical eigenvalue problem, beam, membranes and plates, energy method, finite element method. Books:A C Fung, Introduction to Aeroelasticity, R L Bisplinghoff, H Ashley, Principle of Aeroelasticity, WileyE H Dowell and H C Curtiss, A Modern Course on Aeroelasticity, Kluwer Academic PublishersL Meirovitch, Analytical Methods in Vibration, MacMillanW T Thompson, Theory of Vibration with Applications, George Allen", "page": "AE31002: Aerospace Structural Dynamics"}, {"chunk_id": "c32d1eb8", "title": "Concepts taught in class", "text": "Mathematical concepts of the structures which undergo vibrations. Concepts covered in this course is extension to Beam theory taught in First Year Mechanics(that's one part) just this time around structures are modelled as spring which are vibrating. And other is part is actually mostly mathematical modelling of vibrating structures.", "page": "AE31002: Aerospace Structural Dynamics"}, {"chunk_id": "bd10decc", "title": "Student Opinion", "text": "The course is tough if you are not regular with your classes. But if you are which includes going through Tutorials and regularly asking doubts in the classes especially for those parts where mathematical concepts related to Matrix algebra, orthogonality, etc. come. Do participate in the class and ask Sir to give examples wherever you think mathematical concepts are going over your head. Most topics will be Abstract i.e you have to memorize but in time you will understand what they mean when you will solve tutorial. Coming to its relevance the understanding that you gain in this course helps you to understand some of the software that is currently used in industry extensively such NASTRAN and PATRAN. Most of the software development that happens related to Aerospace Structures is based on the mathematical concept taught in this course. Not just vibration but the way mathematical concepts are applied here.", "page": "AE31002: Aerospace Structural Dynamics"}, {"chunk_id": "3ba348b7", "title": "How to Crack the Paper", "text": "1. Solve the tutorial and the Class assignments (Because at Prof. said he doesn't have time to make new problems). Both for mid sem and end sem 2. For Mid sem especially do follow Book by S Rao 3. Attend classes To have a glossary for solving definition based questions", "page": "AE31002: Aerospace Structural Dynamics"}, {"chunk_id": "c19adbf1", "title": "Classroom resources", "text": "https://nptel.ac.in/syllabus/101105022/", "page": "AE31002: Aerospace Structural Dynamics"}, {"chunk_id": "ca231acf", "title": "Additional Resources", "text": "Mechanical Vibration by S. Rao good enough till Mid Sem problems", "page": "AE31002: Aerospace Structural Dynamics"}]