[{"chunk_id": "info_e8076a", "title": "AE39001: Aerodynamics Lab - Quick Facts", "text": "AE39001\nCourse name | AERODYNAMICS LAB\nOffered by | Aerospace Engineering\nCredits | 2\nL-T-P | 0-0-3\nPrevious Year Grade Distribution\n14 18 10 2 2 4 EX A B C D P F | 14 | 14 | 18 | 18 | 10 | 10 | 2 | 2 | 2 | 2 | 4 | 4 | EX | A | B | C | D | P | F\n14 | 14 | 18 | 18 | 10 | 10 | 2 | 2 | 2 | 2 | 4 | 4\n14\n18\n10\n2\n2\n4\nEX | A | B | C | D | P | F\nSemester | {{{semester}}}", "page": "AE39001: Aerodynamics Lab"}, {"chunk_id": "3085da1b", "title": "Syllabus mentioned in ERP", "text": "Prerequisites: AE21002 0 - 0 - 3: 2 CreditsLaboratory experiments related to pressure and force measurement on various models using different measuring techniques; Supersonic wind tunnel experiments and flow visualization.", "page": "AE39001: Aerodynamics Lab"}, {"chunk_id": "4527e558", "title": "Concepts taught in class", "text": "Flow visualisation experiments, PIV, Measuring forces and moments over a delta wing, Measuring pressure over an airfoil, Hele-Shaw cell, Supersonic flow over a wedge", "page": "AE39001: Aerodynamics Lab"}, {"chunk_id": "159dba99", "title": "Student Opinion", "text": "This is one of the best courses in the department. It is split into 2 halves - Experiments and Term project. The design project has 50 % weightage and the experiments last only up to midsems, after which the lab hours are spent on review meetings. The project topics are chosen by the students and the final presentation is given usually just after the endsems. The students have to make something as part of the project, a mechanism, a new design or something similar and perform an experiment. As far as the experiments are concerned, this lab is much more hands-on and thus more enjoyable.", "page": "AE39001: Aerodynamics Lab"}, {"chunk_id": "2d91bf74", "title": "How to Crack the Paper", "text": "The lab examination would have the group perform an experiment from scratch, which means you would have to set up the experiment, which is something we usually don't do as the experiments are usually set up for the students. So pay attention to the set up, the mounting mechanism, sensors calibration, tunnel when the experiment is done for the first time. The reports are checked strictly and plagiarism is not tolerated, so put in some effort for the same. The report format and detailed instructions will be circulated regarding the same. Well researched reports with original thoughts would help in scoring. For full marks, be prepared to read research papers and quote from them. Feedback is given and is quite helpful. To score well in the design project, work from day 1 consistently and keep communicating with the professor and the TAs. Try to finish the manufacturing and experiments early, as these often lead to delays. Choose a good team, where people are willing to work. This is extremely important. Before choosing a topic, talk to the seniors who have worked on it before, else you might end up repeating their work.", "page": "AE39001: Aerodynamics Lab"}, {"chunk_id": "1b1ee67d", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | In Dept | In Dept | In Dept | In Dept\nThursday\nFriday", "page": "AE39001: Aerodynamics Lab"}]