[{"chunk_id": "info_1da727", "title": "AE40030: Advanced Gas Turbine Theory - Quick Facts", "text": "AE40030\nCourse name | Advanced Gas Turbine Theory\nOffered by | Aerospace Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n1 3 4 2 3 EX A B C D P F | 1 | 1 | 3 | 3 | 4 | 4 | 2 | 2 | 3 | 3 | EX | A | B | C | D | P | F\n1 | 1 | 3 | 3 | 4 | 4 | 2 | 2 | 3 | 3\n1\n3\n4\n2\n3\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "AE40030: Advanced Gas Turbine Theory"}, {"chunk_id": "c5faf817", "title": "Syllabus mentioned in ERP", "text": "Prerequisites: AE31001, AE31008 3 - 0 - 0: 3 Credits General propulsion systems, Theory of intakes and exhaust systems, thrust reversal, jet engine noise and methods of noise reduction, Cycle analysis of one and two spool engines, Equilibrium running of gas turbine engines, Component matching, Transient behavior, Design consideration of axial flow multistage machines, stream line curvature method, radial equilibrium equation, Design and off-design performance.", "page": "AE40030: Advanced Gas Turbine Theory"}, {"chunk_id": "d3bef665", "title": "Course Content:", "text": "1. Introduction to aircraft propulsion system.\n2. Different types of gas turbine engine based on their application.\n3. Evaluation and history of aircraft propulsion.\n4. Thrust equation and contribution of major components of the gas turbine engine to the thrust generation.\n5. Engine efficiencies and their formulation\n6. Altitude and Ram effect on engine performance.\n7. Brayton cycle (Ideal and actual) and parametric analysis for turbojet, turbofan (single, two and three spool), mixed and un-mixed flow turbofan, forward and aft fan configuration, with and\nwithout afterburner, turbofan engine with intercooling and regeneration.\n8. Engine installation and placement.\n9. Theory of subsonic and supersonic intake.\n10. Design procedure of subsonic intake.\n11. Axial flow compressor: Construction of axial compressor, Euler’s equation and velocity triangles, Parameters like Diffusion factor, Degree of reaction, De Haller’s factor, Vortex theory and radial equilibrium, Compressor flow path, Compressor performance characteristics, Multi staging of compressor, Stall, Choking, Instability in axial compressors (Surge).\n12. Axial flow turbine: Construction and types of axial turbines, Euler turbine equation and velocity triangles, Vortex theory and radial equilibrium, Turbine blade loading, Turbine performance\ncharacteristics.\n13. Nozzle: Requirements of nozzles, Nozzle performance parameters, Types of nozzles, Working of Convergent and CD Nozzle, Operations under Variable flow conditions, Variable geometry\nnozzles application to aircraft, Nozzle performance in relate to overall Engine\n14. Thrust reverser: Requirements of thrust reverser, Types of thrust reverser.\n15. Thrust vectoring: Needs of Thrust vectoring, Types of thrust vectoring, Working of thrust vectoring.", "page": "AE40030: Advanced Gas Turbine Theory"}, {"chunk_id": "7970cac1", "title": "Student Opinion:", "text": "The course is offered as an elective from the department of Aerospace engineering. This course is comprehensively designed for detail understanding of gas turbine engine.\nThe course has term projects which includes parametric analysis using GasTurb software and design of subsonic intake using theoretical calculation and CFD study.", "page": "AE40030: Advanced Gas Turbine Theory"}, {"chunk_id": "e974d3ab", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | 3rd Year Class room\nThursday | 3rd Year Class room\nFriday | 3rd Year Class room", "page": "AE40030: Advanced Gas Turbine Theory"}]