[{"chunk_id": "0beaca7a", "title": "AE61002: SATELLITE AND INERTIAL NAVIGATION SYSTEMS", "text": "{ course_code = AE61002 }", "page": "AE61002: SATELLITE AND INERTIAL NAVIGATION SYSTEMS"}, {"chunk_id": "54c68f79", "title": "Syllabus mentioned in ERP", "text": "Introduction to different navigation systems, navigation coordinate frames, geometry of Earth, attitude and its parameterizations, standard navigation filters (least squares estimation and Kalman filter), overview of Global Navigation Satellite System (GNSS) architecture, signal structure of the Global Positioning System (GPS) and Indian Regional Navigation Satellite System (IRNSS), GNSS receiver operating principles, pseudorange, pseudorange rate and carrier phase measurements, error models, user position, velocity and time (PVT) estimation, dilution of precision, carrier phase differential GNSS, overview of inertial navigation system (INS), INS error characteristics, INS mechanization, GNSS-INS integration architectures.", "page": "AE61002: SATELLITE AND INERTIAL NAVIGATION SYSTEMS"}, {"chunk_id": "1739b400", "title": "Concepts taught in class", "text": "Working of GNSS (GPS), operating principles of transmitter and receiver, GNSS signal structure, basics of probability theory and estimation theory with application to position estimation, Inertial Navigation Systems", "page": "AE61002: SATELLITE AND INERTIAL NAVIGATION SYSTEMS"}, {"chunk_id": "dd0a634e", "title": "Student Opinion", "text": "This course will help one understand how global positioning systems like google maps work. This course also includes a project which involves collection and analysis of GNSS satellite data using cell phone. The material is entirely practical and would be very helpful for someone working in the field of satellite communication . The course also includes tutorial classes. Unlike the stressful ET tutorial classes of 1st year, the professor helps you solve any HW questions she gave which you were unable to solve, in the tutorial", "page": "AE61002: SATELLITE AND INERTIAL NAVIGATION SYSTEMS"}, {"chunk_id": "269ae271", "title": "How to Crack the Paper", "text": "Easiest way to score high is to attend all classes. The classes are pretty fast paced and the notes provided are quite thorough. Questions in the paper require you to have clear understanding and thorough recollection of all things taught in class ( some questions would be straightforward coming from class notes and some questions would be similar to the tutorial questions given as HW)", "page": "AE61002: SATELLITE AND INERTIAL NAVIGATION SYSTEMS"}, {"chunk_id": "1b3cedfc", "title": "Classroom resources", "text": "The professor's classroom notes are pretty thorough. Additionally, the Professor provides a list of books which can be referred for additional understanding.", "page": "AE61002: SATELLITE AND INERTIAL NAVIGATION SYSTEMS"}, {"chunk_id": "b3145d7a", "title": "Additional Resources", "text": "Doing the project required us to use the GNSSlogger app and GNSS analysis app, both provided online for free by google. We also used an opensource MATLAB code, provided by google, for GPS signal processing.", "page": "AE61002: SATELLITE AND INERTIAL NAVIGATION SYSTEMS"}]