[{"chunk_id": "info_d85c33", "title": "AG20101: Crop Production Technology - Quick Facts", "text": "AG20101\nCourse name | Crop Production Technology\nOffered by | Agricultural & Food Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n3 13 18 14 5 7 1 EX A B C D P F | 3 | 3 | 13 | 13 | 18 | 18 | 14 | 14 | 5 | 5 | 7 | 7 | 1 | 1 | EX | A | B | C | D | P | F\n3 | 3 | 13 | 13 | 18 | 18 | 14 | 14 | 5 | 5 | 7 | 7 | 1 | 1\n3\n13\n18\n14\n5\n7\n1\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "AG20101: Crop Production Technology"}, {"chunk_id": "74894ac4", "title": "Syllabus mentioned in ERP", "text": "Crop Production: Concepts of agronomy; Classification of crops; Techniques of raising field crops, horticultural crops, medicinal and aromatic plants; Cropping system for major agro-ecological regions; seed and seeding, planting density management, organic and inorganic nutrition of crops, water management for higher productivity, management of insects and pests, diseases and weeds; Farm planning and management; Crop growth assessment; Judging crop maturity and harvesting techniques; Organic farming and sustainable agriculture; Greenhouse crop production; Management of dryland agriculture. Crop Simulation: Models for crop yield assessment; Crop management simulation and yield forecasting; Crop response to climate change; Uncertainty and risk evaluation.", "page": "AG20101: Crop Production Technology"}, {"chunk_id": "b1282191", "title": "How to Crack the Paper", "text": "The most important key to succeed in Crop Prodcution Technology is to follow the lectures carefully and make running notes if possible. Generally professors prepare good study material and give you which would be enough to crack the paper. If you want deeper insight in the course content, the library is always open for you. Apart from that, focus on the numericals part more because that is the most frequently tested part which include finding seed rate, Nutrient Application using Balance Sheet Method, Grain Yield calculation, Fertilizer inputs and climatic factors which influence crop growth like Leaf Area Index, Radiation Interception value, Radiation use efficiency, Harvest Index and other attributes.\nOther important concepts from which MCQs type might come from include, Crop Classification, Growth Laws, Water management (Net irrigation requirement concepts). Happy Learning", "page": "AG20101: Crop Production Technology"}, {"chunk_id": "b228407b", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | In Dept\nTuesday | In Dept | In Dept\nWednesday\nThursday\nFriday", "page": "AG20101: Crop Production Technology"}]