[{"chunk_id": "info_aa937c", "title": "AG29004: Agricultural Biotechnology Lab. - Quick Facts", "text": "AG29004\nCourse name | Agricultural Biotechnology Lab.\nOffered by | Agricultural & Food Engineering\nCredits | 3\nL-T-P | 1-0-3\nPrevious Year Grade Distribution\n9 29 19 6 1 EX A B C D P F | 9 | 9 | 29 | 29 | 19 | 19 | 6 | 6 | 1 | 1 | EX | A | B | C | D | P | F\n9 | 9 | 29 | 29 | 19 | 19 | 6 | 6 | 1 | 1\n9\n29\n19\n6\n1\nEX | A | B | C | D | P | F\nSemester | {{{semester}}}", "page": "AG29004: Agricultural Biotechnology Lab."}, {"chunk_id": "8ade8407", "title": "Syllabus mentioned in ERP", "text": "Theory component Introduction: Cell structure and physiological processes, organellar ultrastructure, respiration, photosynthesis, growth regulators and nitrogen metabolism. Genetic Engineering for Crop Improvement: Plant cell and tissue culture, gene transfer techniques into plant cells, application in agriculture. Microbes in Agriculture and Food: Applied Microbiology in the future of mankind, moving frontiers of applied microbiology, microbial enzymes and their applications in food processing and agro-chemical industries, agro-waste utilization, biodegradable polymers and their applications, microbial polysaccharides; Production and utilization of essential amino-acids, chemicals from micro-algae. Micorrhiza: Applications in agriculture and forestry. Food and Beverage Products: Traditional fermented food, single cell protein, production of glutamic acid, lactic acid, gluconic and Itaconic acid. Laboratory component 1.Tissue culture technique: media preparation 2.Explant sterilization, inoculation and inductin of callus 3.Micropropagation and acclimatization of regenerated plants 4.Establishment of suspension cultures and plating suspension 5.Isolation of microbes from soil, water and environment and their identification 6.Pure culture preparation 7.Gram staining 8.Bacterial counting and growth kinetics 9. Extraction of microbial products and their quantification 10. Immobilization of enzymes/whole cell", "page": "AG29004: Agricultural Biotechnology Lab."}]