[{"chunk_id": "info_87e48d", "title": "AG31003: Land And Water Resources Engineering - Quick Facts", "text": "AG31003\nCourse name | Land And Water Resources Engineering\nOffered by | Agricultural & Food Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n5 10 9 12 8 14 EX A B C D P F | 5 | 5 | 10 | 10 | 9 | 9 | 12 | 12 | 8 | 8 | 14 | 14 | EX | A | B | C | D | P | F\n5 | 5 | 10 | 10 | 9 | 9 | 12 | 12 | 8 | 8 | 14 | 14\n5\n10\n9\n12\n8\n14\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "AG31003: Land And Water Resources Engineering"}, {"chunk_id": "ac0877cb", "title": "Syllabus mentioned in ERP", "text": "Hydrologic cycle: Precipitation: Types, measurement and analysis, missing data, aerial precipitation, consistency of rainfall records and frequency analysis. Runoff: Factors affecting runoff, measurement, methods for estimation of runoff volume and peak runoff, rating curve, and rainfall-runoff relations. Hydrograph Analysis: Components, factors affecting hydrographs, and base flow separation. Unit Hydrograph: Theory and assumptions, unit hydrographs of different durations, dimensionless hydrograph, synthetic unit hydrograph, and instantaneous unit hydrograph. Flood routing: Classification, reservoir and channel routing. Soil Erosion: Process, types, factors affecting soil erosion, land-use capability classification. Soil Loss Estimation: USLE, MUSLE, and RUSLE. Wind Erosion: Process, control, movement and transport mechanism. Water Erosion: Process, types, and transport mechanism. Erosion Control Measures: Biological and mechanical. Gully Control Measures: Vegetative, temporary and permanent gully control structures.", "page": "AG31003: Land And Water Resources Engineering"}, {"chunk_id": "8b4b9f6f", "title": "Additional Resources", "text": "Reference Books\n• Applied Hydrology (McGraw Hill)\n• Elementary Hydrology (Prentice - Hall)\n• Engineering Hydrology - K Subramanya (Tata McGraw Hill)\nOut of the three, the most recommended book by Prof. Chandranath Chatterjee is the 3rd one, i.e. Engineering Hydrology by K Subramanya. There are other adaptations of the book by other authors (Manish Kumar Goyal) which is more user-friendly and has additonal problems to pracitise too.", "page": "AG31003: Land And Water Resources Engineering"}, {"chunk_id": "57a30b29", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NR414\nTuesday\nWednesday | NR414 | NR414\nThursday | NR414\nFriday", "page": "AG31003: Land And Water Resources Engineering"}]