[{"chunk_id": "info_bf7868", "title": "AG40015: Thermal Operations In Food Processing - Quick Facts", "text": "AG40015\nCourse name | Thermal Operations In Food Processing\nOffered by | Agricultural & Food Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | Autumn", "page": "AG40015: Thermal Operations In Food Processing"}, {"chunk_id": "a9519790", "title": "Syllabus mentioned in ERP", "text": "Overview of thermal operations carried out in dairy and food processing. Pasteurization and Sterilization: microbial destruction in batch and continuous sterilization; kinetics of loss of nutrients in sterilization; UHT processing; action of chemicals on death kinetics of microbes; aseptic packaging; irradiation and microwave processing of foods; Effects of heat, acid and short wave electromagnetic radiation on kinetics of enzyme inactivation. Crystallization and Freezing: Planks law and estimation of freezing time of foods; equipment used for freezing water in food for production of crystalline foods, e.g. sucrose and lactose; freeze concentration of liquid food. Concentration and Evaporation: Concentration of liquid foods in batch and continuous type evaporators; heat and energy balance in multiple effect evaporators; design of calendria in the evaporators, falling and rising film evaporators; mechanical and thermal vapour recompression systems. Water Relation to Foods: roles of water and activity in foods; control of water activity by addition of solute and moisture removal; measurement of water activity; different models of sorption isotherms, their limitations and applicability, prediction and moderation of water activity of foods. Drying of Foods: various mechanisms of moisture removal in solid and liquid foods during drying; properties of air-water vapour mixture; drying operations based on conduction, convection and radiation heat transfer; spray, freeze, roller, tray and through-flow drying operations.", "page": "AG40015: Thermal Operations In Food Processing"}]