[{"chunk_id": "info_8b84e3", "title": "AG40006: Dairy Process Engineering - Quick Facts", "text": "AG40006\nCourse name | Dairy Process Engineering\nOffered by | Agricultural & Food Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n1 2 2 1 2 EX A B C D P F | 1 | 1 | 2 | 2 | 2 | 2 | 1 | 1 | 2 | 2 | EX | A | B | C | D | P | F\n1 | 1 | 2 | 2 | 2 | 2 | 1 | 1 | 2 | 2\n1\n2\n2\n1\n2\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "AG40006: Dairy Process Engineering"}, {"chunk_id": "5dddfef0", "title": "Syllabus mentioned in ERP", "text": "Fundamentals of Dairy Chemistry: Roles of lipids, proteins, carbohydrates, minerals, vitamins and enzymes. Dairy Microbiology: Importance of psychrophilic, mesophilic and thermophilic spoilage organisms in storage, pasteurization and sterilization. Cream Separation: Principles of separation, equipment, effectiveness, cut-off diameter and energy requirement. Homogenization: Principle of operation, design calculation for laminar and turbulent regimes. Concentration and Evaporation: Water and solid balance: Boiling point elevation- pressure/temperature relationship; Falling and rising film evaporators, thermocompressors, steam economy. Pasteurization and Sterilization: Decimal reduction time, Z value, activation energy, sterilizing value, nutrient destruction; Equipment for pasteurization, direct and indirect sterilization; Ultra - High - Temperature (UHT) sterilization. Spray Drying: Efficiency and energy consumption in spray drying: Cyclone separation principle; Instantization - fluidized bed drying. Dairy Products Manufacturing: Buttermaking; Ice-cream manufacture; Cheese making; Malted milk drinks; Indigenous dairy products manufacturing. Chlorination of Water: Chlorination principle for microbiological safety. Plant Sanitation: Sanitation chemistry, CIP cleaning, equipment. Effluent Treatment: Pollution control in dairy plant: BOD, COD, enzyme kinetics, continuous stirred tank reactor, activated sludge system, trickle filter.", "page": "AG40006: Dairy Process Engineering"}]