[{"chunk_id": "info_1a01d1", "title": "AG40011: Tubewells And Pumps - Quick Facts", "text": "AG40011\nCourse name | Tubewells And Pumps\nOffered by | Agricultural & Food Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n5 8 8 2 12 6 3 EX A B C D P F | 5 | 5 | 8 | 8 | 8 | 8 | 2 | 2 | 12 | 12 | 6 | 6 | 3 | 3 | EX | A | B | C | D | P | F\n5 | 5 | 8 | 8 | 8 | 8 | 2 | 2 | 12 | 12 | 6 | 6 | 3 | 3\n5\n8\n8\n2\n12\n6\n3\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "AG40011: Tubewells And Pumps"}, {"chunk_id": "7d3b7532", "title": "Syllabus mentioned in ERP", "text": "Introduction to Groundwater: Definition of groundwater, occurrence of groundwater, physical properties, porosity and permeability, capillarity and capillary fringe, Darcys law, Dupuit-Forchheimer assumptions, aquifers and aquitards, groundwater development and potential in India, status of groundwater resources in India, case histories. Well Hydraulics: Basic assumptions, steady and transient flows, confined, unconfined and leaky aquifers, partially penetrating wells, well interference, well losses, specific capacity. Pumping Tests: Need of pumping tests, types, design and test procedures, merits and demerits of pumping test, salient steady and transient methods for determining aquifer parameters, recovery test, determination of well-loss coefficients and well efficiency. Construction of Wells: Types of wells, test drilling and well logs, well design, methods for constructing shallow wells, drilling techniques for deep wells, cavity wells, bamboo tubewells, well casings and screens, perforations and gravel packs, well cementing, well development, stimulation and sterilization of wells, testing wells for yield, protection of wells. Maintenance and Rehabilitation of Wells: Incrustation, corrosion, evaluation of well performance, abandoned wells. Pumps: Classification of water-lifting devices, principles and operation of important indigenous water-lifting devices, positive displacement pumps, centrifugal pumps, vertical turbine pumps, submersible pumps, propeller and mixed flow pumps, affinity laws, jet pumps, air-lift pumps, pump selection, troubles of pumps and remedial measures, evaluation of pump performance, power requirements, efficiency and economics of pumping plants.", "page": "AG40011: Tubewells And Pumps"}, {"chunk_id": "fdef1fbe", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | In Dept\nThursday | In Dept\nFriday | In Dept", "page": "AG40011: Tubewells And Pumps"}]