[{"chunk_id": "info_f6a337", "title": "AG60170: Modelling And Simulation For Agricultural Water Management - Quick Facts", "text": "AG60170\nCourse name | Modelling And Simulation For Agricultural Water Management\nOffered by | Agricultural & Food Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n1 EX A B C D P F | 1 | 1 | EX | A | B | C | D | P | F\n1 | 1\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "AG60170: Modelling And Simulation For Agricultural Water Management"}, {"chunk_id": "743e1420", "title": "Syllabus mentioned in ERP", "text": "Modeling and Simulation: Definition and purpose of modeling, modeling terminology, modeling versus simulation, types of models, modeling protocol, continuum approach to modeling porous media. Application of Modeling Techniques to Agricultural Water Management: Finite-difference method (FDM), and finiteelement method (FEM), numerical errors, validity of numerical solutions. Modeling Unsaturated Flow: Soil water potential, capillarity, soil moisture characteristics and hydraulic conductivity curves, soil-water flow, effective permeability, motion and mass balance equations, initial and boundary conditions, complete mathematical model of unsaturated flow, on-farm water balance modeling. Water Uptake by Plant Roots: Mathematical description of water uptake by potential transpiration. Numerical Approximation of Flow in Soil-Root Systems: Initial and boundary conditions, finite difference approximation, model development, calibration and verification, case studies. Modeling of Crop Production: Mathematical description of crop growth, water versus actual production, calculation of potential production, case studies. Modeling Saturated Flow: Aquifer storativity, effective stress, fundamental mass balance equation, initial and boundary conditions, complete mathematical models of flow in confined, phreatic and leaky aquifers, model execution and calibration process, case studies. Modeling and Simulation of Irrigation Canal Systems: Commonly used modeling techniques, overview of popular software packages for canal flow simulation. Water Quality Prediction and Simulation: Fundamentals of water quality modeling, types of water quality models, model development, calibration and verification, NPS models, case studies. Modeling Subsurface Contamination: Classification of contaminants, hydrodynamic dispersion in saturated and unsaturated domains, advective, dispersive and diffusive fluxes, balance equation for a contaminant, initial and boundary conditions, source and sink terms, complete statement of contaminant model, scale effects and macrodispersion, salient case studies. Rational Use of Models: Reliability and rational use of models for planning and management of water resources systems, salient software packages for agricultural water management.", "page": "AG60170: Modelling And Simulation For Agricultural Water Management"}]