[{"chunk_id": "info_d8edfd", "title": "AG60022: Dairy And Food Products Technology - Quick Facts", "text": "AG60022\nCourse name | Dairy And Food Products Technology\nOffered by | Agricultural & Food Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | Spring", "page": "AG60022: Dairy And Food Products Technology"}, {"chunk_id": "10595813", "title": "Syllabus mentioned in ERP", "text": "Basic principles and methods of food processing and perservation. Emerging technologies in food processing. Food additives and preservatives. Food laws and standards. Effect of processing on acceptability and nutritive value of food. Physico-chemical properties and structure of milk and milk constituents. Chemical and microbial spoilage of milk and milk products; Fluid milk processing, packaging and distribution. Common dairy processes - cream separation ( standardization), pasteurization, sterilization and homogenisation. Process technology for manufacture of evaporated milk, codensed milk, dried milk, malted milk, infant and baby foods, icecream, cheese, butter, formented milk and indigenous dairy products. Methods and procedures for sampling and testing of milk and milk products. Laws and standards for milk and milk products. Technological processes for industrially manufactured foods of commercial importance, from plant and animal origin. Cereals, vegetables, fruits, meats, poultry and egg products; Bakery, pasta and confectionary products, ready to eat foods, fermented foods, alcoholic and non- alcoholic beverages, tea, coffee and coccoa, fabricated foods. packaging materials; characteristics, properties and their design. Packaging requirement for different processed and unprocessed foods. Working Principles of various type of fillers : form-fill- seal machine. Gas packaging and modified atmosphere package design. Shelf life prediction of foods in packages. Quality control in food packaging. Product safty and packaging regulations.", "page": "AG60022: Dairy And Food Products Technology"}]