[{"chunk_id": "info_3dc918", "title": "AG60100: Mass Transfer Operations In Food Engineering - Quick Facts", "text": "AG60100\nCourse name | Mass Transfer Operations In Food Engineering\nOffered by | Agricultural & Food Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n1 4 1 4 4 EX A B C D P F | 1 | 1 | 4 | 4 | 1 | 1 | 4 | 4 | 4 | 4 | EX | A | B | C | D | P | F\n1 | 1 | 4 | 4 | 1 | 1 | 4 | 4 | 4 | 4\n1\n4\n1\n4\n4\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "AG60100: Mass Transfer Operations In Food Engineering"}, {"chunk_id": "49f624e8", "title": "Syllabus mentioned in ERP", "text": "Diffusion and Mass Transfer in Food Materials: Molecular diffusion in solids and fluids: FickÃÂ¢ÃÂÃÂs 1st law for molecular diffusion, diffusion through varying cross sectional area, molecular diffusion in liquids, molecular diffusion in biological solutions and gels, molecular diffusion in solids, diffusion coefficients in gas, liquid and solid, numerical solution of steady state diffusion, FickÃÂ¢ÃÂÃÂs 2nd law and unsteady state operation, mass transfer coefficients, interphase mass transfer, diffusion of gases in porous solids and capillaries. Gas - liquid Operations: Absorption: equilibria, single and multiple stages, mass transfer using film mass transfer coefficients, overall mass transfer coefficient, equipment; distillation: phase rule, ideal solutions and RoultÃÂ¢ÃÂÃÂs law, constant pressure and temperature equilibria, relative volatility, deviations from ideality (azeotropes), distillation methods, McCabe - Thiele method, stage efficiencies, enthalpy concentration method. Liquid - liquid Operations: Liquid equilibria, equipment, liquid liquid extraction. Solid - fluid Operations: Leaching (viz. Edible oil extraction): equilibria, percolation tank (Shanks system), equipment for steady and unsteady state operations; crystallization: equilibria, types of crystals, rate of growth, size distribution, equipment: adsorption and ion exchange: types, adsorbents, equilibria, stage operations, equipment.", "page": "AG60100: Mass Transfer Operations In Food Engineering"}]