[{"chunk_id": "info_f3caf9", "title": "AG60301: Advanced Mechanical Operations In Food Processing - Quick Facts", "text": "AG60301\nCourse name | Advanced Mechanical Operations In Food Processing\nOffered by | Agricultural & Food Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n3 3 2 1 1 EX A B C D P F | 3 | 3 | 3 | 3 | 2 | 2 | 1 | 1 | 1 | 1 | EX | A | B | C | D | P | F\n3 | 3 | 3 | 3 | 2 | 2 | 1 | 1 | 1 | 1\n3\n3\n2\n1\n1\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "AG60301: Advanced Mechanical Operations In Food Processing"}, {"chunk_id": "67924136", "title": "Syllabus mentioned in ERP", "text": "Particulate food solids: size distribution and characterization, size reduction and energy requirement in comminution, devices (roller, hammer, plate, ball and attrition mills) used for milling of cereals and spice; movement of particulate solid in fluid - Stokes law, pneumatic conveying of granular foods, fluidization - Ergun equations for pressure drop in packed bed, minimum fluidization velocity; aeration system in grain storage. Separation processes: screens – effectiveness; Filtration - filter medium and cake resistances in pressure, vacuum and centrifugal filtration, filtration equipments (e.g., clarifier for vegetable oil); centrifugal separation – estimation of cut off diameter and design of cyclone (separating dust from grains), hydrocyclone (e.g., primary clarification of milk) and disc type separators (separating fat globules from milk). Mixing and agitation: mixing time and mixing index relationship for solid-solid mixing (blending of ingredients in RTE foods); power number and Reynolds number relationship in agitators for solid-liquid (preparation of ice cream mix), liquid-liquid (blending of vegetable oils) mixing, equipments used for mixing and agitation of liquids, powders and pastes. Homogenization: high pressure, rotor-stator and ultrasonic homogenizers, size reduction of dispersed phases in milk and fruit juices Extrusion process: drag and pressure flow in single screw extruder; volume flow rate in single and twin screw extruder (for RTE foods); design of screw profile for single and twin screw extruders; performance of screw press (vegetable oil expellers).", "page": "AG60301: Advanced Mechanical Operations In Food Processing"}, {"chunk_id": "6ba91eb9", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | In Dept\nTuesday\nWednesday | In Dept | In Dept\nThursday | In Dept\nFriday", "page": "AG60301: Advanced Mechanical Operations In Food Processing"}]