[{"chunk_id": "info_0a4196", "title": "AG60104: On-Farm Water Management - Quick Facts", "text": "AG60104\nCourse name | On-Farm Water Management\nOffered by | Agricultural & Food Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | Spring", "page": "AG60104: On-Farm Water Management"}, {"chunk_id": "c897f531", "title": "Syllabus mentioned in ERP", "text": "Irrigation Systems and Water Management in India: Annual utilizable water resources of India, annual water demand for irrigation and other purposes, water balance, significance of irrigation in India, classification of irrigation systems, irrigation potential and expansion, prevalent water allocation and distribution practices, irrigation management organizations, overview of water management in India, national water policy, concept of sustainable development and its criteria, sustainable water use. Canal Irrigation Management: Layout of irrigation systems, need for canal irrigation management, causes of poor performance of irrigation systems, strategies for improving canal irrigation management, modern concepts of irrigation management, irrigation efficiencies, canal outlets and their suitability, criteria for analyzing the behavior of outlets, canal regulation, performance evaluation of irrigation systems. Farm Water Delivery System and Control: Design of field channels and underground pipelines, water regulating and diversion structures. Irrigation Requirements and Scheduling: Evapotranspiration, direct measurement and estimation of evapotranspiration, effective rainfall, irrigation scheduling, scheduling strategies, crop production functions. Waterlogging, Salinisation and Lining of Distribution System: Effects and causes of waterlogging, salinisation process and damage, average root zone salinity, use of marginal and poor quality water, salt balance calculations, regional salt balance, remedial measures, conjunctive use of surface water and groundwater, canal losses, lining of irrigation channels, types of lining, design of lined canal, economics of canal lining. Farm Irrigation System Design: Types of farm irrigation systems, application methods and design, performance evaluation of farm irrigation system. Micro Irrigation Systems: Micro irrigation systems versus surface irrigation systems, types of sprinklers, principles of sprinkler operation, uniformity coefficient, economic design of a sprinkler system, system design efficiency, trickle irrigation systems, control head, trickle system components, water distribution in the soil profile, trickle system design, fertigation, irrigation automation. Drainage of Irrigated Land: Drainage problems, sources of excess water, drainage systems, drainage requirements, planning and design of drainage systems, design of pipe drainage systems, well drainage, mole drainage, cost evaluation of drainage projects. Environmental Impact Assessments (EIA): Definition and purpose of EIA, principles of EIA, EIA process and target groups, resources needed for EIA.", "page": "AG60104: On-Farm Water Management"}]