[{"chunk_id": "e06d33fc", "title": "Alma Matters", "text": "Alma Matters is a 2.5 hours documentary featuring the life of a student at IIT KGP. It attempts to cover most facets of student life in 3 episodes (discussed below).\nThe series tries to unfold issues less known to people outside IITs, and discuss cultural aspects specific to Kharagpur. Medium is a mix of Hindi & English, overall tone of the show is informal. Mode of the show is via student, professor & alumni interviews talking about their overall experience, or experience during certain events. The series features prominent comedian and alumni Biswa Kalyan Rath.\nThe documentary was released on May 14, 2021 and featured as the top watched show on Netflix for the first week [ tweet ].", "page": "Alma Matters"}, {"chunk_id": "02db67f6", "title": "Ep 1: Independent Variables", "text": "• The first episode talks about the motivation behind setting up the first Indian Institute of Technology, and what India expects of them.\n• Like most number games, CGPA is a number that often controls access to resources and opportunities (defining terms like the talented \"chaggi\",\"satti\", \"atthi\", \"nehli\").\n• It briefly brushes the importance of halls in which the students spent most of their college life, and the motivation towards winning the prestigious General Championships (GC) .\n• Explains the student committee , its election and their role in organising on-campus activities like GC.\n• Explores the gender ratio on campus (1 girl :9 boy), and how it creates a sexist bias towards dismissing women's opinions on campus Why there was never a girl candidate contested for the highest student post, Vice President of Gymkhana.\n• Having a girl candidate contest for the post and win Secretary Sports and Games, and what challenges / bias the candidate faced.", "page": "Alma Matters"}, {"chunk_id": "10050522", "title": "Ep 2: Escape Velocity", "text": "• Episode 2 largely covers the placement process for final year students, what kind of stress that brings - it closely follows few students living in the same wing, and them getting placed.\n• One of the highly appreciated points about the episode has been its honest depiction regarding placement packages and the proverbial \"1 crore package\" - which 5 students of a batch of 2000 receive, while most students land a package of 8-12 lakhs.\n• Disparity among hiring companies - most companies hire for a data profile, and people keep their course work for 4/5 years aside and prepare for a job that their academic work does not necessarily prepare them for.\n• Companies hiring for \"core profile\" (directly related to study / department) are few and hire a handful of students - the rest of students are not left with options.", "page": "Alma Matters"}, {"chunk_id": "929d627e", "title": "Ep 3: Young's Modulus", "text": "• The final episode of the series starts with one of the most significant cultural experiences in KGP - Illu and Rangoli .\n• During the two semesters when the documentary was filmed (2017), the campus had 5 suicides in one year, the show covers the open house held to address this and the concerns for mental health.\n• The series ends with the final few days of students before they graduate - and enter a world they have tried to prepared for.\n• ", "page": "Alma Matters"}, {"chunk_id": "de2fbdd2", "title": "References", "text": "IMDB page\nNetflix page\nYoutube trailer", "page": "Alma Matters"}]