[{"chunk_id": "23ed1552", "title": "Applied CS with Android - IIT Kharagpur", "text": "Google’s Applied CS with Android program is designed for university Computer Science students and enhances various concepts from their current curricular work. The program revisits concepts from Data Structures and Algorithms, as well as Artificial Intelligence. The course uses Android as a platform for development because it’s modern and has an easy to use graphical interface.", "page": "Applied CS with Android"}, {"chunk_id": "9a0efad4", "title": "Course Format", "text": "The program employs a flipped classroom educational model. Students prepare independently by reading and setting up software such that they're ready for the in-person workshop sessions, which consist of larger programming exercises completed in pairs with the support of facilitators. Activities will also contain optional extensions; if time permits each pair will complete at least one, further customizing their work.", "page": "Applied CS with Android"}, {"chunk_id": "152c342c", "title": "Course Delivery", "text": "Applied CS consists of six core technical units which can be delivered in a variety of formats. Each unit will require some preparation that the students complete at their own pace via self-study, to maximize the productivity of the in-person time during the workshops. This preparation will consist of relevant readings, software setups and smaller programming activities. Each workshop will consist of larger programming exercises that students complete in pairs, with the support of facilitators in selected universities. The workshop activities also include optional extensions.", "page": "Applied CS with Android"}, {"chunk_id": "325aaf28", "title": "Syllabus", "text": "* Unit A: Scarne's Dice with App Inventor (optional) Getting started with Android development * Unit 1: Anagrams Using Java in Android Studio * Unit 2: Scarne's Dice Creating an new Android app in Android Studio * Unit 3: Ghost A review of binary search * Unit 4: Ghost II Tree traversals and tries * Unit 5: Puzzle-8 Using min-heaps * Unit 6: Code Sprint * Unit 7: Word Ladder Graphs and Graph Traversal * Unit 8: Black Hole Monte Carlo and Unit Testing * Unit 9: Continental Divide Dynamic Programming * Post Assessment * Post Course Student Survey", "page": "Applied CS with Android"}, {"chunk_id": "900cb3c6", "title": "Email ID", "text": "[email protected]", "page": "Applied CS with Android"}, {"chunk_id": "65ec612a", "title": "Facilitators", "text": "Name | Contact number | Email ID\nAyushi Mrigen | +91 7872841662 | [email protected]\nSmruti Ranjan Swain | +91 8609289280 | [email protected]", "page": "Applied CS with Android"}, {"chunk_id": "a4be4c7e", "title": "Workshop Date", "text": "To be announced.", "page": "Applied CS with Android"}, {"chunk_id": "acea0c80", "title": "Survey form", "text": "https://goo.gl/forms/LH4ShNmA7rYASEN93\nReferences:\nGuide on How to Disable Android Auto by GeniusGeeks", "page": "Applied CS with Android"}]