[{"chunk_id": "info_a6a0ea", "title": "AR22004: Water Supply And Sanitation - Quick Facts", "text": "AR22004\nCourse name | Water Supply And Sanitation\nOffered by | Architecture & Regional Planning\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n2 10 10 7 8 2 EX A B C D P F | 2 | 2 | 10 | 10 | 10 | 10 | 7 | 7 | 8 | 8 | 2 | 2 | EX | A | B | C | D | P | F\n2 | 2 | 10 | 10 | 10 | 10 | 7 | 7 | 8 | 8 | 2 | 2\n2\n10\n10\n7\n8\n2\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "AR22004: Water Supply And Sanitation"}, {"chunk_id": "8bbd4abd", "title": "Syllabus mentioned in ERP", "text": "Elements of public water supply system: Elements of public water supply system: Sources of water, water quality, Biochemical Oxygen Demand, intakes, pumping and transportation of water. Conventional water treatment â sedimentation, coagulation, filtration and disinfection. Distribution system, ferrule, water meters, stopcocks, bib cocks, and pipe appurtenances.Building service connections: cold and hot water distribution systems in buildings and their design, materials, joints, fittings and valves. Direct and indirect systems, special installation in multistoried buildings. Types of fixtures and materials- wash basins, water closets, urinals, bidets, sinks etc. Over-head and under-ground reservoirs.Conditions of flow in building drainage pipes, traps, vents and their material specifications. Design of drainage and vent pipes, system for low-rise and high-rise buildings, storm water drainage, design of storm drains, building drains, sewers, gully traps, inspection chambers, manholes, connection to public sewer. Waste-water disposal systems, septic tank, soak pits and anaerobic filters, on-site processing and disposal methods. Design of sewerage systems, conventional waste-water treatment, activated sludge, trickling filters etc. Solid wastes collection and removal from buildings.", "page": "AR22004: Water Supply And Sanitation"}, {"chunk_id": "c6df72e3", "title": "Concepts taught in class", "text": "This subject is taught in two parts, sanitation and Supply, everything about how the water is treated and supplied to buildings, and how sewage is exited.", "page": "AR22004: Water Supply And Sanitation"}, {"chunk_id": "82186f29", "title": "Student Opinion", "text": "The material is partially relevant, but even then, with the approaching water crises, this subject is good to be included in our curriculum.", "page": "AR22004: Water Supply And Sanitation"}, {"chunk_id": "50d0c6c2", "title": "How to Crack the Paper", "text": "Depends on the prof who's teaching you, last year Prof Arup Das taught this subject, who asks many things from the class notes, provides PPTs to study from. He'd say that he won't mind attendance, but if you maintain a 100% attendance you'll be given extra marks at the end, so no matter what try not to miss classes. Note: Marking is quite strict, you need to write everything you know about what's asked with sketches, but don't write long paragraphs, write in small points, that will help in scoring better.", "page": "AR22004: Water Supply And Sanitation"}, {"chunk_id": "6884d1ff", "title": "Classroom resources", "text": "• may personally ping me sometime later, can't access it right now*", "page": "AR22004: Water Supply And Sanitation"}, {"chunk_id": "a1711267", "title": "Additional Resources", "text": "Sir would recommend you some books at the beginning of the course, you may want to try those.", "page": "AR22004: Water Supply And Sanitation"}]