[{"chunk_id": "info_17b427", "title": "AR33203: Architectural Detailing - Quick Facts", "text": "AR33203\nCourse name | Architectural Detailing\nOffered by | Architecture & Regional Planning\nCredits | 3\nL-T-P | 1-0-3\nPrevious Year Grade Distribution\n1 13 17 1 EX A B C D P F | 1 | 1 | 13 | 13 | 17 | 17 | 1 | 1 | EX | A | B | C | D | P | F\n1 | 1 | 13 | 13 | 17 | 17 | 1 | 1\n1\n13\n17\n1\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "AR33203: Architectural Detailing"}, {"chunk_id": "17efcbc8", "title": "Syllabus mentioned in ERP", "text": "Architectural detailing for common items like: brick and concrete parapet; coping; cornices; string course; chajja; plinth course; plinth protection/ plinth protection with surface drain; treatment of sloped roof with tiles or plaster; paving; steps etc. Different types of Wall Facing: stone, glazed tiles, earthen tiles and plastic tiles etc. Partition with timber, metal, stone, PVC / plastic etc. Glass curtain walling. R.C.C. and Wooden Staircase including details. Different types of railing details for staircase, balcony and at roof with brick, timber, metal and plastic etc.Acoustic and thermoinsulating wall paneling with different materials. Suspended ceiling with different materials and finishing including fixing details of lighting fixtures and diffusers for ventilation and air conditioning.Typical detail of rain water pipe connection.Special doors and windows: Sliding, folding, revolving, swinging and rolling etc. with hardware details.Different types of resilient and vibration resistive floors. Layout and details related to Water Supply, Drainage and Sanitation: a case study of a small residential building.", "page": "AR33203: Architectural Detailing"}, {"chunk_id": "f6604938", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday | In Dept | In Dept | In Dept\nWednesday\nThursday\nFriday", "page": "AR33203: Architectural Detailing"}]