[{"chunk_id": "info_f0c4fe", "title": "AR51005: Advanced Theory Of Arch. And Research Methodology - Quick Facts", "text": "AR51005\nCourse name | Advanced Theory Of Arch. And Research Methodology\nOffered by | Architecture & Regional Planning\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n1 2 3 2 EX A B C D P F | 1 | 1 | 2 | 2 | 3 | 3 | 2 | 2 | EX | A | B | C | D | P | F\n1 | 1 | 2 | 2 | 3 | 3 | 2 | 2\n1\n2\n3\n2\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "AR51005: Advanced Theory Of Arch. And Research Methodology"}, {"chunk_id": "7f725c2b", "title": "Syllabus mentioned in ERP", "text": "Definition, Scope and Importance of Architectural Research; The process of research â developing concepts, formulating hypotheses and empirical testing; Research strategy â Approaches (Diagnostic, descriptive, theoretical and action), Designs (Case study, Survey, Experiment) and Settings (Natural, Contrived); Substance and context of research â professional and academic; Analogical, deductive and inductive reasoning; Analytical and synthetic processes in design and practice.Assessing the performance of built environment â aesthetic, functional, social and economic; Perceptions, attitudes and values of the observer; Complexity, scale and level of analysis. New areas of research: Style and creativity in research process, architectural communication, value engineering and building economics research, culture and content, mathematics, science and art in architecture, evaluation research â alternative generation and optimization techniques.", "page": "AR51005: Advanced Theory Of Arch. And Research Methodology"}, {"chunk_id": "5224b97f", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | In Dept | In Dept\nTuesday | In Dept\nWednesday\nThursday\nFriday", "page": "AR51005: Advanced Theory Of Arch. And Research Methodology"}]