[{"chunk_id": "info_d0ebda", "title": "AR60004: Development Management - Quick Facts", "text": "AR60004\nCourse name | DEVELOPMENT MANAGEMENT\nOffered by | Architecture & Regional Planning\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | {{{semester}}}", "page": "AR60004: Development Management"}, {"chunk_id": "457e425c", "title": "Syllabus mentioned in ERP", "text": "Systems of local governments in India; development administration of National, State and Local level and the process of decision-making, development and management. Structure of implementing authorities: Improvement trusts, Development authorities, Metropolitan Development Authorities, and their relationship with local governments. Public relation and citizen participation, personnel management, manpower planning, performance, appraisal, motivation and morale. Corporate management: systems approach to urban management, organizational design, and management information systems. The concept of project evaluation; identification and estimation of project impacts; desirable and undesirable project impacts. Single criterion project evaluation; details of cost benefit analysis and its application with case studies; cost benefit analysis of public and private sector projects. Concept of multi-criteria project evaluation and their applications; concept of time scheduling; project network and monitoring; Pert and CPM with their application in planning projects; project monitoring under resource constraints. Organizational behavior: organization theories, authority and conflict, administration communication, leadership in administration, organizational changes. Environment of Urban Finance: national plan and urban development; intergovernmental fiscal relationship, municipal fiscal system. Methods of urban finance: financial perspective of urban development (water supply and sewerages, land development and housing, transportation and road). Municipal fiscal administration: property tax administration, rent control system, user changes and pricing of public services, municipal expenditure, administration of grants in-aids. Local planning and budgeting: Municipal Corporate Planning; program planning and budgeting; local financial Management: financial control delegation, performance evaluation techniques, cash flow management, local debt management, financial information system; municipal fiscal programming, project scheduling and budgeting.", "page": "AR60004: Development Management"}]