[{"chunk_id": "info_1c84b3", "title": "AR60002: Planning Legislation - Quick Facts", "text": "AR60002\nCourse name | PLANNING LEGISLATION\nOffered by | Architecture & Regional Planning\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | {{{semester}}}", "page": "AR60002: Planning Legislation"}, {"chunk_id": "d88c3abf", "title": "Syllabus mentioned in ERP", "text": "The meaning, significance and objectives of planning legislation; constitutional basis and provisions relating to land, its development and use, concept of eminent domain, police power and taxation powers as basis of legislation. Evolution of U.K. planning laws and various commission reports; concept of structure plan, local plan and action plan under English laws. Evolution of planning legislation in India. An overview of legal tools connected with urban planning development, Town and Country Planning, Improvement Trust and Development Authorities etc. - objectives, contents and procedures for preparation and implementation of Regional plans, development plans, Town Planning Schemes, Area Plans etc. Land Acquisition Act of India, its provision and limitation. Urban Land (Ceiling and Regulation) Act objectives, contents and planning implications. Legislation on Conservation of natural resources including Mining and Forestry Acts, Conservation and Management of Ancient Monuments and Archaeological sites and ruins. Significance of Land Development Control - objectives and legal tools, critical evaluation of zoning, sub-division regulations, building regulations and bye laws. Urban Arts Commission Act, Transportation, Landscape, Housing and slum clearance legislation. National Environmental Policy Act. Aims and objectives of professional institute, sister bodies, professional role and responsibility of planning consultants, professional ethics, code of conduct and scale of professional charges. Formulation of project proposal and outlines; consultancy agreements and contracts. Role in interdisciplinary groups; Appreciation of the decision-making processes, and the process in relation to varied consultancy assignments of planning.", "page": "AR60002: Planning Legislation"}]