[{"chunk_id": "info_c51653", "title": "AR60019: Dynamics Of Settlement Systems - Quick Facts", "text": "AR60019\nCourse name | DYNAMICS OF SETTLEMENT SYSTEMS\nOffered by | Architecture & Regional Planning\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | {{{semester}}}", "page": "AR60019: Dynamics Of Settlement Systems"}, {"chunk_id": "683166fa", "title": "Syllabus mentioned in ERP", "text": "Structure, morphology and functional classification of Indian cities. Elements of settlement system size, function, spacing, linkage, input tributary and output tributary, settlement patterns and factors responsible thereof. Measurement of distribution of settlements, size and class of settlements, cluster and agglomeration studies, functional at tributes and spacing of settlements, potentialities and centrality of settlements. Growth, density and spatial inequalities of population distribution, spatial patterns and characteristics of occupational types; Ekistics â a science of human settlements. Socio-economic aspects of population growth and distribution. Factors of migration, types and patterns, urban rural migration and its impact on development. Industrialization vs. Urbanization, Modernization of the countryside, regional variations in industrialized urbanization. Distribution of city sizes and rank-size rule, negative exponential density gradient. Theoretical framework of central place theory. Christallers fixed K-hierarchy, Loschs general system of location of settlements, variable K-hierarchy, Loschian economic landscape. Interaction among settlements and cities as systems within systems of cities; Urban models and structural changes - Forresters urban dynamics; New approaches in dynamical system modeling; Spatial interaction activity - the Wilson models, application of the models in the retailing and residential subsystems; from deterministic to stotachastic approaches to spatial dynamics, stability of a spatial growth process, the chaotic analysis and catastrophe theory; Paradigm of self-organization, towards a new synthesis in the modeling of evolving complex systems. Bifurcations in dynamical systems theory, the mathematical ecology of citiesDendrinos models", "page": "AR60019: Dynamics Of Settlement Systems"}, {"chunk_id": "068709e2", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | In Dept\nThursday | In Dept\nFriday | In Dept", "page": "AR60019: Dynamics Of Settlement Systems"}]