[{"chunk_id": "info_040ab2", "title": "ARK - Quick Facts", "text": "Activities | Robotics\nFounded | 2015 ( 2015 )\nFounder(s) | Aditya Agarwal, Chaitanya Bayanwala\nNumber of members | 20\nWebsite | ARK\nContact | +91 740 765 1462 (Soumyadeep Mukherjee)\nUnder TSG | No\nUnder SRIC | Yes", "page": "ARK"}, {"chunk_id": "2a141442", "title": "ARK", "text": "Aerial Robotics Kharagpur , often abbreviated to ARK is one of IIT Kharagpur's newest projects towards robotics research. It is a research group sponsored by SRIC as part of Centre for Excellence in Robotics . The aim of the research group is to drive the state of the art of aerial robotics forward and participate in international competitions like IARC . Students from all departments and years have been part of this including undergraduates and post-graduates. The principal Investigator for the project is Prof. Somesh Kumar and it is mentored by Prof. Jayanta Mukhopadhyay and Prof. D.K. Pratihar. [ 1 ]", "page": "ARK"}, {"chunk_id": "b84715d5", "title": "History", "text": "ARK was an idea that started as a Dream-a-Bot proposal which was an initiative by Technology Robotix Society in 2013. The TRS heads then liked the idea and decided to go ahead with it and ordered a simple quadrotor chassis and ESCs worth INR 7000 only. With absolutely no prior knowledge about aerial robots or control systems, couple of students started tinkering with IMUs and ESCs spoiling them, burning them and eventually learning how to use them. However, a lack of direction to the project often demotivated the people involved. So, in early 2014, the direction was decided i.e. to participate in IARC which was a much further goal compared to the situation then. With newly found direction, the small group started with attempting to fly the chassis and almost got it when the ESCs and IMUs burnt stalling for months. In August 2014, one of the students bought an AR Drone during his internship. This sped up work by a huge margin as students now could divide into two team - software and controls, the former working on the purchased drone and the latter on flying the chassis. In October 2014, the idea of Centre for Excellence in Robotics was floated and students working on this attempted to get funded through it. Aditya Agarwal made a research proposal and roped in Prof. Jayanta Mukhopadhyay and Prof. D.K.Pratihar as mentors for the project and applied for funding. Mrinal Mohit pitched in by taking his BTP on Visual SLAM from aerial drone under Prof. Jayanta Mukhopadhyay . The proposal was accepted and the fund was received in SRIC in January 2015 and the group ARK was officially formed. [ 1 ] A complete lab setup was finally ready by August 2015 for testing drones indoor and finally a new drone with a new chassis was first hovered in the lab in September 2015. [ 1 ]", "page": "ARK"}, {"chunk_id": "8377427f", "title": "List of Student Coordinators", "text": "List of Past Coordinators [ 2 ] :\n• 2014: Aditya Agarwal (EC '15)\n• 2015: Soumyadeep Mukherjee (CH '16)\n• 2016: Gaurav Gardi (PH '18)", "page": "ARK"}, {"chunk_id": "0a771f9d", "title": "Activities", "text": "List of activities ARK is involved in [ 1 ] :", "page": "ARK"}, {"chunk_id": "bf3f1ea6", "title": "International Aerial Robotics Competition", "text": "IARC is the longest running collegiate aerial robotics challenge in the world. Entering its third decade, the competition continues to tackle challenges that are currently impossible for any flying robots owned by government or industry.\nYear | Team Leader | Standing | Awards\n2016 | Soumyadeep Mukherjee | N/A | Best Team Cooperation Award", "page": "ARK"}, {"chunk_id": "273388c5", "title": "Agricultural Robotics", "text": "ARK is trying to use drones to use fly over agricultural fields to segment crop cycle times and also soil types with the help of Prof. Bhabani Das from the Department of Agriculture and Food Engineering.", "page": "ARK"}, {"chunk_id": "7de52552", "title": "Telekyb", "text": "Telekyb is a ROS framework for aerial robots developed by Autonomous Robotics and Human-Machine Systems Lab at Max Planck Institute of Biological Cybernetics . ARK is working in collaboration with them to try to improve the framework to be able to be used widely for research.", "page": "ARK"}, {"chunk_id": "3d8a0a32", "title": "Team Structure", "text": "ARK team is divided into two parts [ 1 ] :", "page": "ARK"}, {"chunk_id": "557076e4", "title": "Software Team", "text": "The software team is responsible for developing algorithms in computer vision including localisation, object detection, tracking, path planning and 3D obstacle avoidance along with artificial intelligence algorithms for exploration and herding.", "page": "ARK"}, {"chunk_id": "e2f507c1", "title": "Controls Team", "text": "The Controls Team aims towards a smooth motion of the aerial robot in space and that they attain the desired speed and orientation avoiding obstacles.", "page": "ARK"}, {"chunk_id": "f9acaedb", "title": "Media Mentions", "text": "• Indiatimes\n• NDTV\n• IIT-Kgp Alumni News\n• Scholars Avenue\n• NetworkedIndia\n• Newsd\n• egoodnews\n• CollegeDekho\n• Exams-Watch\n• enaIndia\n• Tech.FirstPost", "page": "ARK"}, {"chunk_id": "042f5e66", "title": "References", "text": "↑ 1.0 1.1 1.2 1.3 1.4 ARK Website ↑ Verified by Dementor on October 5, 2015.", "page": "ARK"}, {"chunk_id": "df97adcd", "title": "Further Information", "text": "• Github Organisation", "page": "ARK"}]