[{"chunk_id": "4a00b5a7", "title": "AT60008", "text": "AT60008 : Embedded Communication Networks (L-T-P: -3-0-0, CRD-3)", "page": "AT60008"}, {"chunk_id": "f3fcacba", "title": "Syllabus", "text": "1. Introduction: Key Concepts, Event vs. State Based Communication, Finding the Best Real-Time Protocol 2. Communication Protocols for Embedded Systems: Inter System Protocol and Intra System Protocol; - Inter system protocol: USB Communication protocols, UART Com-munication protocols, USART Communication protocols; -Intra System Communication Protocols: I2C Protocol, SPI Protocol, CAN Protocol, CAN FD; Flexray, JTAG and Boundary Scan. 1. Advanced Topics: Industrial control network: Modbus, Smart Grid Communication Protocol Standards, Time Sensitive Networking, Remote Upgrade of Firmware, Automotive Ethernet and Time triggerred ethernet, Communication standards for IIoT. 2. Dependable I/O Systems: Redundancy, Dependable Individual Sensors and Actuators, Fieldbus, Intelligent I/O 3. Error Detection and Correction: Key Concepts, Shannon’s Theorem, Liner Block Codes, CRC Codes, Convolutional Codes, Data Error Detection and Recovery, Control Flow Error Detection, Detecting and correcting I/O and memory errors. 4. Uncertainty in I/O: Robust Control Theory, Effects of Uncertainty 5. Basics of Fault Tolerance Computing: Faults and their manifestation, System Fault Response stages, Reliability and Availability Techniques in Embedded System, Fault Injection , Basics of hardware fault tolerance and software fault tolerance. 6. Fault Tolerance Analysis of Safety-Critical Embedded Systems : Fault tolerant net-work, Software Defect Masquerade Faults in Distributed Embedded Systems, Critical Message Integrity Over a Shared Network, Fault Tolerance Tradeoffs in Moving from Decentralized to Centralized Embedded Systems", "page": "AT60008"}, {"chunk_id": "7ac9c21e", "title": "Syllabus mentioned in ERP", "text": "The same as above mentioned.", "page": "AT60008"}, {"chunk_id": "3f50752d", "title": "Student Opinion", "text": "Good course which covers many network protocols and latest embedded protocols. For few of the protocols we will be using latest research papers and its an updated course of all the protocols. It was taught by Ayantika Chatterjee and Arnab Sarkar . I never felt that they are going fast or not in sync with us, they go at a right pace and helps us understand better.", "page": "AT60008"}, {"chunk_id": "dece60b7", "title": "How to Crack the Paper", "text": "Just following the slides and completing the assignments is more than enough. No specific text-book is there as it will make use of online sources and the paper will be set on what is taught in the class itself.", "page": "AT60008"}]