[{"chunk_id": "ad8a41c8", "title": "BC Roy Technology Hospital", "text": "Bidhan Chandra Roy Technology Hospital popularly known as B C Roy Hospital or simply Hospital is the primary health care centre for all the students, staff members and faculty members of IIT Kharagpur as well as for people who aren't involved with IIT Kharagpur. [ unverified ] The hospital is located inside the campus at the Scholars' Avenue near Tech Market . It provides emergency services inside the campus and an ambulance is sent immediately after a call.", "page": "BC Roy Technology Hospital"}, {"chunk_id": "898f3c9a", "title": "Controversies", "text": "On March 21, 2009, an erstwhile 3rd year undergraduate student Rohit Kumar went to the hospital for checkup. It was a Saturday evening and he was complaining of headache. Although there's no record of any report. Next morning, he had to re-visit the hospital because his conditions had gone worse and he was in severe pain. He was then sent back home with some prescribed painkillers. Unfortunately, while going back to his hostel he collapsed and his head hit a cow-trap. He was immediately taken back to the hospital where he waited around 3 hours to get an appointment with a doctor. After his arrival, the doctor without any treatment, referred him to Apollo Hospital, Kolkata stating that he needed a neurologist. He was put in an ambulance with two of his friends and one pharmacist and no trained paramedic. On the way, the conditions got worse and they decided to go for Midnapore Hospital instead. He was declared 'Dead on Arrival' at Medinipur Hospital.\nThis incident lead to an outraged protest against the Director, IIT Kharagpur. Thousands of people silently protested in front of his bungalow. Seeing the director not taking any action in the regard of improvement of facilities in the hospital, outraged students demanded Director's resignation. In consequence, Prof Damodar Acharya the erstwhile Director resigned along with the Dean of Students' Affairs. Prof. Madhusudan Chakraborty , the then Deputy Director [ 1 ] was criticized for making a comment about the incident, saying \"What's the big deal...\". [ 2 ] [ 3 ]\nKOLKATA: Classes at the Indian Institute of Technology-Kharagpur were suspended on Monday, a day after its director Damodar Acharya resigned following violent protests outside his house by students alleging medical negligence behind the death of a collegemate. “Dr. Acharya, who owned moral responsibility for the death, faxed his resignation to the Board of Governors on Sunday evening. The Dean, Students’ Affairs, also resigned,” IIT registrar D. Gunasekaran told The Hindu over telephone. M. Chakraborty, deputy director, who has taken over charge of the institute, admitted that the medical facilities on the campus were inadequate to deal with emergencies. - The Hindu reported on March 24, 2009. [ 4 ]", "page": "BC Roy Technology Hospital"}, {"chunk_id": "6b7c1b84", "title": "OPD timings", "text": "Monday to Saturday - 9 AM to 12: 30 PM & 4: 30 PM to 7 PM. Registration starts at 7:30 AM and 3:30 PM for first and second shifts). The shift and timing of doctors is updated every week and can be found at its noticeboard in physical or online. [ 5 ] Closed on Sundays and institute holidays, however the emergency ward remains open on all days.", "page": "BC Roy Technology Hospital"}, {"chunk_id": "4325c100", "title": "Schedule of visiting doctors", "text": "Available in BCRTH On-line Notice board on Internal Notice Board, IIT Kharagpur. Can be checked by clicking here .", "page": "BC Roy Technology Hospital"}, {"chunk_id": "ae1cbfa8", "title": "Contact Numbers", "text": "• Registration Counter : 282634\n• Emergency : 282632\n• Emergency MO : 282644\n• Help : 281007 , 281008 , 281009\n• Office : 282630\nHere is the full list [ 6 ]", "page": "BC Roy Technology Hospital"}, {"chunk_id": "9b3445a8", "title": "References", "text": "↑ https://web.archive.org/web/20090327091316/http://www.iitkgp.ac.in/commdir3/list.php?division=0&deptcode=DD ↑ \"Facebook post by IIT Kharagpur\" . ↑ \"Death of an IITian on shrey-knows.blogspot.in\" . ↑ http://www.thehindu.com/todays-paper/tp-national/article338886.ece ↑ \"BCRTH - Noticeboard\" . Retrieved 20 September 2015 . ↑ \"Communication Directory - B C Roy Technology Hospital\" .", "page": "BC Roy Technology Hospital"}]