[{"chunk_id": "info_9efbd4", "title": "Bitwise - Quick Facts", "text": "Type | Non-Profit Organization\nGenre | Technical\nFounded | 2001\nPlace | India\nInstitute | Indian Institute of Technology Kharagpur\nPrize money | over INR 200,000\nWebsite | http://2015.bitwise.co.in/", "page": "Bitwise"}, {"chunk_id": "48e592ac", "title": "Bitwise", "text": "Bitwise is an annual programming, application and web development fest organised by CodeClub , the CSE Department Society of IIT Kharagpur [ 1 ] over three days in the 2nd week of March. With huge support from the Department of CSE, the Bitwise team works intensely and enthusiastically to bring out the best workshops, guest lectures, and events centered around the most trending topics of Computer Science. The last iteration, Bitwise 2015, was held from March 13 to March 15, 2015. Prizes worth close to INR 200,000 were distributed.\nSSD was the Title Sponsor [ 2 ] for Bitwise 2015, and Xerox , [ 3 ] its Associate Sponsor, with HackerRank [ 4 ] slated to be the coding Partner. The 2015 edition had prize money over INR 200,000 in the offing.\nThe fest has a huge participation from students in the campus from all departments and students from close to 50 colleges all over India arriving in the campus in 2014 to take part in the first iteration of the three day fest.", "page": "Bitwise"}, {"chunk_id": "abc6c6f8", "title": "History", "text": "Bitwise was started in the year 2001 by the senior undergraduate students of Department of Computer Science and Engineering. The contest provides programmers across the globe a platform to compete, testing their ability to develop efficient algorithms to problems within a given time constraint. Over the last eleven years, the contest has grown in popularity and prize money, attracting the world's top programmers. In year 2014, Bitwise grew from being an annual online programming contest to a complete fest which had a lot of events in addition to the flagship coding marathon.", "page": "Bitwise"}, {"chunk_id": "bfa3a418", "title": "BitWise", "text": "Logo for the event Bermuda Triangle in Bitwise 2015\nBitWise [ 5 ] is the main flagship event of the fest. Team size is limited to a maximum of three, and solutions have traditionally been expected to be provided in C (programming language) or C++ . The solutions are evaluated not only on the basis of correctness, but also on their time and space complexities .", "page": "Bitwise"}, {"chunk_id": "278f3e4a", "title": "Bermuda Triangle", "text": "Logo for the event Code Gamble in Bitwise 2015\nBermuda Triangle [ 6 ] [ 7 ] is an event for a team size of 3 members. The team members will be given different problem sets, but they have to switch at the end of every time interval.The event tests the team members based on their understanding and team work extensively .", "page": "Bitwise"}, {"chunk_id": "a5cc94d6", "title": "Code Gamble", "text": "In Code Gamble , [ 8 ] [ 9 ] competitors bet upon a concealed set of questions of varying difficulties and programming paradigms and try to gather the maximum points.This event tests the credence of the competitors in their abilities to tackle questions focusing on different flavors of competitive programming.\nLogo for the event Enigma in Bitwise 2015", "page": "Bitwise"}, {"chunk_id": "45942f0b", "title": "Enigma", "text": "Enigma [ 10 ] [ 11 ] is an online quiz which was first introduced as a part of Bitwise 2007. It serves as a curtain raiser event which takes it participants on a journey discovering the facts, ideas and luminaries in various fields. It is traditionally conducted a few days prior to Bitwise. This year's event will begin on March 11, 2015.", "page": "Bitwise"}, {"chunk_id": "024da38c", "title": "Guest Lectures", "text": "This section is empty. You can help by adding to it . (March 2015)", "page": "Bitwise"}, {"chunk_id": "c8260101", "title": "Winners", "text": "Year | Winner | College/Institution\n2003 | Arun Kishore & Pham Min Tri | NT United, Singapore\n2004 | Amey Karkare | IIT Bombay\n2005 | Robin Nittka & Adrian Kuegel | University of Ulm\n2006 | Team TwoDashHeadedSpaceMonkey | University of KTH\n2007 | Team TwoDashHeadedSpaceMonkey | University of KTH\n2008 | Robin Nittka & Christoph Schwirzer | University of Ulm\n2009 | Team ACRush | Tsinghua University\n2010 | Team Eryx | Warsaw University\n2011 | Team Gawry | University of Wrocław\n2012 | Team Luminar | Shanghai Jiao Tong University\n2013 | Team Mithril | Shanghai Jiao Tong University", "page": "Bitwise"}, {"chunk_id": "9c2ec7b3", "title": "References", "text": "↑ http://cse.iitkgp.ac.in/ ↑ http://www.ssdkolkata.net/ ↑ http://www.xerox.com ↑ https://www.hackerrank.com ↑ http://2015.bitwise.co.in/Events/BitWise.html ↑ http://2015.bitwise.co.in/Events/Bermuda.html ↑ http://www.knowafest.com/2015/03/bitwise-15-iit-kharagpur-cse-symposium.html ↑ http://2015.bitwise.co.in/Events/Codegamble.html ↑ http://www.knowafest.com/2015/03/bitwise-15-iit-kharagpur-cse-symposium.html ↑ http://2015.bitwise.co.in/enigma/index.php ↑ http://www.knowafest.com/2015/03/bitwise-15-iit-kharagpur-cse-symposium.html", "page": "Bitwise"}, {"chunk_id": "880b525e", "title": "External links", "text": "• A basic description of fests in India\n• Bitwise Website\n• Department of Computer Science and Engineering, IIT Kharagpur\n• Bitwise 2015 Registration\n• Official Twitter page", "page": "Bitwise"}]