[{"chunk_id": "077c7aef", "title": "Content", "text": "Objective of Course : Our brain is the most sophisticated computational machine. It can change its own components and rewire itself into a new configuration as required for new function. Synapses, the connection between neurons, are the fundamental computational units of the brain and are the essential components needed for the brain’s remarkable ability to adapt itself. Defect in synaptic function are cause of most neuropsychiatric and learning disorders. Understanding the role of the synapse in neural computation is essential to figure out how our brain works in health and in disease conditions. In the course, students will be not only familiar about the synaptic function and plasticity including the latest tools used to explore the synaptic function but also will understand how synaptic dysfunction leads various psychiatric and learning disorders.\nCourse Content: 1) Neural doctrine. History and discovery of synapse and chemical transmission, Dales principle, Types of synapses and their mode of action. Post synaptic signalling mechanisms and their regulation. (4 hours)\n2) Synaptic plasticity: Techniques to study synaptic plasticity, mechanisms of synaptic plasticity, depression and facilitation, short term and long term plasticity, different plasticity rules, computational implications, spike timing dependent plasticity, learning and memory formation, self-organization. (5 hours)\n3) Synapse and critical period of development of various sensory function, enriched environment and experience-dependent synaptic plasticity. Synaptic dysfunction and psychiatric disorders, synaptic dysfunction and neurodevelopmental disorders. Autism, autism spectrum disorders like Down syndrome, Rett syndrome, Fragile-X syndrome, Angelman syndrome. Post traumatic stress disorders (6 hours)\n4) AMPA and NMDA receptors and their role in LTP and LTD. Short-term and long term memory, Techniques to study Hippocampal LTP. Glutamate excitotoxicity and its involvement in stroke and chronic neurodegenerative disorders. Various exogenous and endogenous neurotoxins working through NMDA, kinate or AMPA receptors, neurolathyrism. GABA receptor structure and physiological significance of its various regulatory sites (Barbiturates, Benzodiazepine binding etc.). (7 hours)\n5) Cause and possible pathogenic mechanisms of Alzheimer’s disease (AD). Cholinergic projections in the brain and dysfunction of cholinergic neurons in AD. Cause and pathogenesis of Huntington’s disease and Amyotrophic lateral Sclerosis. (5 hours)\n6) Catecholaminergic (dopamine, serotonin, nor-epinephrine and histamine) projections and their physiological role in controlling mood and other behaviours. Stress, anxiety and depression, HPA axis, hippocampus and amygdala. Dopaminergic pathways and its involvement in Parkinson’s disease as well as Schizophrenia. Various other causes of Schizophrenia and Bipolar disorders. Stress and cognitive dysfunction. (7 hours)\n7) Synaptic mechanism of drug reward and addiction. Drug tolerance and withdrawal mechanisms. Cocaine, amphetamine, opiate and their mode of action. Opiate and Canabinoid receptors and their physiological significance. Neurobiological basis of placebo effect. (4 hours)", "page": "BS60003: NEUROCHEMISTRY"}, {"chunk_id": "2377f96e", "title": "Opinion", "text": "Take this course if interested in Brain or biology. A lot of bio stuff is present in the course. Course is taught by two profs - NJ and SB. NJ part is chill, have to remember basics, to write the exam. SB part involves lot of open ended questions, can answer them only if concepts taught by SB in class are understood well.", "page": "BS60003: NEUROCHEMISTRY"}]