[{"chunk_id": "c8376a12", "title": "BT", "text": "Department of Biotechnology at IIT Kharagpur was established in 1986 with a grant from the Ministry of Human resources Development. [ 1 ] The department, however, did not move to its own center until 1996, when a new building next to Architecture and Regional Planning was inaugurated on November 12, 1996. Prof. K. L. Chopra was the director of IIT Kharagpur during that time.", "page": "BT"}, {"chunk_id": "50829dda", "title": "Programs", "text": "The department offers several programs towards completion of Bachelor's and Master's degree:\n• B.Tech.- Biotechnology & Biochemical Engg.\n• Dual Degree - Biotechnology & Biochemical Engg.\n• Dual Degree - Biotechnology & Biochemical Engg. / MBA\n• M. Tech. - Biotechnology and Biochemical Engg.", "page": "BT"}, {"chunk_id": "e2c5c695", "title": "Research labs", "text": "The faculty of the department operate laboratories based on their areas of research. As of now, following laboratories work in the mentioned areas of research under the guidance of respective faculties :\n• Computational Structural Biology Lab: Dr. R. P. Bahadur\n• Structural Biology and Crystallography Lab: Prof. A. K. Das\n• Immunotechnology Lab: Prof. S. K. Ghosh\n• Plant Cell and Tissue Culture Lab: Prof. S. Dey\n• Ganguly Lab: Dr. A. Ganguly", "page": "BT"}, {"chunk_id": "2abb7353", "title": "Facilities", "text": "The department building was equipped with additional laboratory facilities by addition of an additional floor. The renovation added two new undergraduate 24*7 laboratories with specialized equipment along with a meeting room, class room, and new offices for the faculty. The older faculty rooms were extended to become part of the hosting labs thus increasing lab space.", "page": "BT"}, {"chunk_id": "1a0e3ff7", "title": "References", "text": "↑ \"Department of Biotechnology - IIT Kharagpur\" . IIT Kharagpur . Retrieved 22 September 2015 .", "page": "BT"}]