[{"chunk_id": "info_eb6447", "title": "BT21105: Biochem. Reaction Engg. And Bioenergetics - Quick Facts", "text": "BT21105\nCourse name | Biochem. Reaction Engg. And Bioenergetics\nOffered by | Biotechnology\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n2 6 5 7 14 3 1 EX A B C D P F | 2 | 2 | 6 | 6 | 5 | 5 | 7 | 7 | 14 | 14 | 3 | 3 | 1 | 1 | EX | A | B | C | D | P | F\n2 | 2 | 6 | 6 | 5 | 5 | 7 | 7 | 14 | 14 | 3 | 3 | 1 | 1\n2\n6\n5\n7\n14\n3\n1\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "BT21105: Biochem. Reaction Engg. And Bioenergetics"}, {"chunk_id": "1fd03228", "title": "Syllabus mentioned in ERP", "text": "Biochemical Reaction Engineering; Kinetics of homogeneous reactions; reaction mechanism; Temperature dependency from Arrhenius law; Theoretical prediction of rate constant: Interpretation of batch kinetic data; Kinetics of enzyme catalyzed reactions in free and immobilized states: Michaelis-Menten equation and its various modifications. Effects of External mass transfer in immobilized enzyme systems; analysis of intra-particle diffusion and reaction; Kinetics of substrate utilization, product formation and biomass production: Monod growth model and its various modifications; structured and unstructured kinetic rate models; Thermal death kinetics of cells and spores; medium and air sterilization. Chemical mechanisms of biological energy conversion in mitochondria and chloroplasts, Experimental studies and theories photosynthesis energy transfer kinetics; Cytochrome c oxidase (Cytochrome Oxidase Oxygen Heme) or photosystem II (Photosystem II Manganese Oxygen); bacteriorhodopsin proton pumping); DNA base recognition and replication fidelity; Gibbs Free Energy; Protein folding and stability; Ligand binding; Protein-Protein and Protein-DNA interactions; Osmosis, Dialysis; Donnan Effect; Practical techniques e.g.: Isothermal Calorimetry (ITC); Spectroscopy; Fluorescence and Scanning Microscopy; X-ray diffraction", "page": "BT21105: Biochem. Reaction Engg. And Bioenergetics"}, {"chunk_id": "fa3f19a7", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday\nThursday | In Dept | In Dept\nFriday | In Dept | In Dept", "page": "BT21105: Biochem. Reaction Engg. And Bioenergetics"}]