[{"chunk_id": "info_b53a8a", "title": "BT31006: Bioinformatics - Quick Facts", "text": "BT31006\nCourse name | Bioinformatics\nOffered by | Biotechnology\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n4 8 7 10 14 3 1 EX A B C D P F | 4 | 4 | 8 | 8 | 7 | 7 | 10 | 10 | 14 | 14 | 3 | 3 | 1 | 1 | EX | A | B | C | D | P | F\n4 | 4 | 8 | 8 | 7 | 7 | 10 | 10 | 14 | 14 | 3 | 3 | 1 | 1\n4\n8\n7\n10\n14\n3\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "BT31006: Bioinformatics"}, {"chunk_id": "263cba22", "title": "BT31006: Bioinformatics", "text": "Bioinformatics is an undergraduate course offered by Department of Biotechnology typically in spring semester of third year (6th semester). The course is taken by Dr. Ranjit Prasad Bahadur , the head of computational and structural biology lab of the department.", "page": "BT31006: Bioinformatics"}, {"chunk_id": "f3eaae87", "title": "Syllabus mentioned in ERP", "text": "Introduction to Bioinformatics; Data banks: Protein and Nucleic acid; Data Banks for different organisms; Sequence analysis; Analysis Tools for Sequence Data Bank; Pairwise and Multiple sequence alignment; Secondary Structure predictions, Fold recognition; Data analysis.", "page": "BT31006: Bioinformatics"}, {"chunk_id": "0955c02c", "title": "Student Opinion", "text": "• Requires a beginner level exposure to programming. The first year course should be sufficient for implementing programs and concepts taught in class.\n• Requires intermediate exposure to basic biology - protein structures, DNA sequence and analysis.\n• Slow to moderate pace.", "page": "BT31006: Bioinformatics"}, {"chunk_id": "838acdf7", "title": "How to Crack the Paper", "text": "• Solve previous year question paper. The questions are almost similar in nature.\n• Practice basics of dynamic programming, how to create an alignment matrix\n• PDB file format, interpretation of different columns\n• Basic concepts about protein structure, folds, motifs etc.", "page": "BT31006: Bioinformatics"}]