[{"chunk_id": "info_1ea9b0", "title": "BT31014: Immunology - Quick Facts", "text": "BT31014\nCourse name | Immunology\nOffered by | Biotechnology\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n6 5 6 16 6 6 2 EX A B C D P F | 6 | 6 | 5 | 5 | 6 | 6 | 16 | 16 | 6 | 6 | 6 | 6 | 2 | 2 | EX | A | B | C | D | P | F\n6 | 6 | 5 | 5 | 6 | 6 | 16 | 16 | 6 | 6 | 6 | 6 | 2 | 2\n6\n5\n6\n16\n6\n6\n2\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "BT31014: Immunology"}, {"chunk_id": "9c06156c", "title": "BT31014: Immunology", "text": "Immunology is an undergraduate level course offered by Department of Biotechnology in spring semester of third year (6th semester). It is typically taken by two faculties - Prof. Sudip Kumar Ghosh , head of Immunotechnology lab and Dr. Agneyo Ganguly . It's a 4 credit course with one slot for tutorial class.", "page": "BT31014: Immunology"}, {"chunk_id": "c7048a53", "title": "Syllabus mentioned in ERP", "text": "The origin of immunology; inherent immunity; humoral and cell mediated immunity; primary and secondary lymphoid organ; antigen; B cell, T cell and macrophages; major histocompatability complex (MHC); antigen processing and presentation; synthesis of antibody and secretion; molecular basis of antibody diversity, polyclonal and monoclonal antibody, complement; antigen-antibody reaction; regulation of immune response, immune tolerance; hyper sensitivity; autoimmunity; graft versus host reaction.", "page": "BT31014: Immunology"}, {"chunk_id": "74734e97", "title": "Student Opinion", "text": "• Medium to hard on difficulty level\n• Slow to medium pace of teaching\nIn general, the course introduces a lot of new concepts that are critical and require careful thinking and attention to detail.", "page": "BT31014: Immunology"}, {"chunk_id": "b4ff768a", "title": "How to Crack the Paper", "text": "• Attend classes and create or procure class notes\n• Solve previous year question papers. Since the syllabus and concepts are same, most of the questions will be same (or similar)\n• Conceptual thinking rather than memorization\nThe paper contains a lot of objective questions of half mark, one mark and two marks that do require a lot of writing but are conceptual. That, however, also makes it easy to score if you have attended classes and followed notes.", "page": "BT31014: Immunology"}, {"chunk_id": "bf1ace2e", "title": "Books", "text": "• Janeway's Immunology", "page": "BT31014: Immunology"}, {"chunk_id": "99cc3090", "title": "Additional Resources", "text": "• How the Immune Systems Works", "page": "BT31014: Immunology"}]