[{"chunk_id": "info_a324f4", "title": "BT41022: Neurophysiology - Quick Facts", "text": "BT41022\nCourse name | Neurophysiology\nOffered by | Biotechnology\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n3 10 5 5 13 3 1 EX A B C D P F | 3 | 3 | 10 | 10 | 5 | 5 | 5 | 5 | 13 | 13 | 3 | 3 | 1 | 1 | EX | A | B | C | D | P | F\n3 | 3 | 10 | 10 | 5 | 5 | 5 | 5 | 13 | 13 | 3 | 3 | 1 | 1\n3\n10\n5\n5\n13\n3\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "BT41022: Neurophysiology"}, {"chunk_id": "54167798", "title": "Syllabus mentioned in ERP", "text": "Nerve-Muscle Physiology: Neuron structure and function; Regeneration of nerve;;Axoplasmic flow and transport mechanism in the axons; Nature of nerve fibre excitation and interpretation of action potential; Significance of different nerve fibre types. Structural architecture of Neuro-Muscular Junction (NMJ); Neuro-muscular transmission - Electrical and Biochemical events; Drugs acting at NMJ. Protein components and contraction mechanism of muscles. B. Nervous System : Interpretative function of cerebral cortex. Aging and its effect on brain, Regulatory function of cerebellum and structure activity relationship (neural circuitory) of cerebellum, Vestibular apparatus, hypothalamus and its functions, basal ganglia, thalamo cortical projections. Non-specific sensory mechanism- Sleep and wakefulness. Behavioral functions of the brain - emotion, memory, learning and consciousness, Pharmacology and chemical transmission autonomic nervous system. C. Special Sense: Sensory modalities, Sensory receptors, Sensory circuits, and Sensory perception. Taste system , Olfactory system, Visual Sense and Auditory Senses", "page": "BT41022: Neurophysiology"}, {"chunk_id": "bed4d1b0", "title": "Student Opinion", "text": "If taught by ASG and SD, this is going to be not interesting. You will be expected to remember only names. Not much learning happens. If interested in neuro, prefer taking these courses\n• EC dept - Computational Neuroscience - Autumn\n• BS dept - Neurochemistry - Autumn\n• EC dept - Neural Coding of Sensory Information - Spring", "page": "BT41022: Neurophysiology"}]