[{"chunk_id": "info_ebefd6", "title": "BT60016: Transgenic Technology - Quick Facts", "text": "BT60016\nCourse name | Transgenic Technology\nOffered by | Biotechnology\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n2 4 1 7 1 2 EX A B C D P F | 2 | 2 | 4 | 4 | 1 | 1 | 7 | 7 | 1 | 1 | 2 | 2 | EX | A | B | C | D | P | F\n2 | 2 | 4 | 4 | 1 | 1 | 7 | 7 | 1 | 1 | 2 | 2\n2\n4\n1\n7\n1\n2\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "BT60016: Transgenic Technology"}, {"chunk_id": "4796c427", "title": "Syllabus mentioned in ERP", "text": "Introduction to transgenic technology in plants and animals, and its applications to basic research and commercial benefit. Organization of genome, regulation of gene expression and gene silencing in plants and animals. Tools, techniques and methodologies for developing transgenic plants and animals. Strategies and methodologies of screening, selection, verification and characterization of transformed tissues of plants and animals. Molecular farming- production of high value pharmaceutical products in plant and animal systems. Biosafety, Regulation and IPR issues of genetically modified crops and animals. Innovation and Entrepreneurship development from the knowledge of transgenic technology. Transgenic technology for basic and applied research in plant systems: Transgenic technology in plant functional genomics- random insertional mutagenesis of genes, silencing of specific endogenous gene and concept of gene targeting. Application of transgenic technology for enhancement of crop yield and nutritional quality of food constituents (carbohydrates, proteins and lipids); and improvement of quantity and quality of plant biomass required for non-food industrial raw materials. Transgenic technology for basic and applied research in animal systems: Transgenic animals for functional genomics through random insertional mutagenesis and gene targeting. Transgenic farm animals, poultry birds and fishes for vaccine development, production of growth hormones and other commercial products; Improving the nutritional quality of milk and meat by transgenic approach. Transgenic mammals for gene therapy.", "page": "BT60016: Transgenic Technology"}]