[{"chunk_id": "info_df9935", "title": "BT60002: Recombinant Dna Technology - Quick Facts", "text": "BT60002\nCourse name | Recombinant Dna Technology\nOffered by | Biotechnology\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n3 5 5 5 9 6 EX A B C D P F | 3 | 3 | 5 | 5 | 5 | 5 | 5 | 5 | 9 | 9 | 6 | 6 | EX | A | B | C | D | P | F\n3 | 3 | 5 | 5 | 5 | 5 | 5 | 5 | 9 | 9 | 6 | 6\n3\n5\n5\n5\n9\n6\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "BT60002: Recombinant Dna Technology"}, {"chunk_id": "9cb1cb9f", "title": "BT60002: Recombinant Dna Technology", "text": "Recombinant DNA Technology is an advanced level course typically taken by Dual Degree students in their final year and M.Tech and Ph.D. students in their first year coursework. The course instructors are Dr. Agneyo Ganguly, Prof. A. K. Ghosh, and Prof. A. S. Ghosh. The course has 4 lecture hours along with a 2 credit practical course.", "page": "BT60002: Recombinant Dna Technology"}, {"chunk_id": "46666174", "title": "Syllabus mentioned in ERP", "text": "Tools of recombinant DNA: restriction endonucleases and other enzymes, plasmid, bacteriophage, cosmid and other vectors. c-DNA and genomic library, Gene isolation, cloning and expression, DNA sequencing, oligonucleotide synthesis, Southern and Northern hybridization, FISH, PCR, RAPD, RFLP, DNA fingerprinting and their applications for diagnosis of disease, site-directed mutagenesis, Gene silencing, Gene transfer technologies, Gene therapy; Molecular basis of genetic diseases, genetic counseling. Functional genomics: DNA chips and microarray gene screen technology; transgenic animals and gene knockout techniques, cell culture based techniques. Practical: DNA isolation and purification, restriction enzyme analysis, southern hybridization, DNA sequencing, PCR, RAPD, gene cloning, identification of recombinant clone and expression of protein in bacteria and eukaryotic cells.", "page": "BT60002: Recombinant Dna Technology"}, {"chunk_id": "0762b49f", "title": "Student Opinion", "text": "• Easy to moderate level difficulty, mostly familiar concepts already covered in previous courses like Gene Expression, Immunotechnology\n• No scope of novelty. Content and questions are repeated alike every year.", "page": "BT60002: Recombinant Dna Technology"}, {"chunk_id": "4304b251", "title": "How to Crack the Paper", "text": "• Previous year question papers", "page": "BT60002: Recombinant Dna Technology"}]