[{"chunk_id": "5446bb24", "title": "Syllabus in ERP", "text": "Course offered by CCDS, IIT Kharagpur\nPrerequisites : None\nObjective : This subject is primarily designed for students who would be working on applications that require basic understanding of the high performance computing (HPC) environment, but may not necessarily have a computer science background. The objective of the subject is to (1) Introduce the basic concepts related to HPC architecture and parallel computing; (2) To discuss various computational techniques for studying soft matter systems, and (3) To apply these concepts to examine complex biomolecular/materials systems that generally require large-scale HPC platform with hybrid CPU-GPU architectures. Hands-on tutorial sessions will provide an exposure to the students in using CPU and GPU based servers of a supercomputer (or local servers) to perform simulations and analysis of such complex systems. Upon attending the course, the students will be equipped with both theoretical and practical knowledge and skills of effectively using a large supercomputing platform and computational methods to solve and evaluate real-world problems in materials science and biology.\nContents and Lecture Hours (L,T):\nComponent 1: Introduction to HPC architecture and parallel programming (11L, 4T)\n• Basic architecture and organization: memory heirarchy, shared and distributed memory architectures, multiprocessor architecture\n• Introduction to thread level parallelism\n• Accelerators (GPU, Xeon-Phi)\n• Performance prediction and evaluation\n• Parallel programming/computing: Introduction to MPI/ OpenMP, basics of CUDA programming.\n• Optimizing cluster operation: Running jobs in HPC environment, job scheduler, cluster level load balancing\nComponent 2: Special methods for studying complex systems (15L, 4T)\n• Basics of statistical mechanics\n• Potential energy surface\n• Introduction to molecular mechanics\n• Simulation methods: Molecular Dynamics (MD), Monte Carlo (MC) simulations\n• Enhanced sampling methods\n• Coarse-grain modeling\nComponent 3: Applications to complex systems (14L, 6T)\n• Open-source software: MD and MC simulation packages\n• Parallelization in software: domain/spatial decomposition, distribution of non-bonded interactions, dynamic load balancing, multiprocessor communication\n• Modeling of soft matter systems such as biomolecules, polymers, carbon nanostructures etc.\n• Computation of thermodynamic, kinetic and mechanical properties of different complex systems\nThe above information can also be found at this link - https://erp.iitkgp.ac.in/InfoCellDetails/resources/external/groupemailfile?file_id=274", "page": "CD61004: High Performance Computing and its Applications in Complex Physical Systems"}, {"chunk_id": "a2a59649", "title": "Concepts taught in class", "text": "• Programming in Fortran90 with hands on sessions\n• Using Open MPI Library for parallel programming in Fortran\n• Introduction to Molecular Dynamics\n• Hands on Demo on Molecular Dynamics softwares like VMD, Packmol\n• Basics of Computer Architecture, Parallel Computing Architecture, HPC Architecture\n• Limits and Costs of Parallel Programming - Amdahl's law\n(The concepts may vary from year to year depending upon the time availability)", "page": "CD61004: High Performance Computing and its Applications in Complex Physical Systems"}, {"chunk_id": "385289fd", "title": "Student Opinion", "text": "If you are interested in learning FORTRAN and basics of parallel programming, this course will be useful for you. This course is mainly for people interested in the fields of Molecular Simulations and HPC. However, if you are interested only in computing aspects, not Simulation aspects, you can take the other course offered by CCDS in Spring Semester - CD61002 - High Performance Scientific Computing. (Read more about the courses offered by CCDS here )\nFORTRAN, though an old language, is popular among scientific community, and use it widely in HPC codes. The best part about the course is that emphasis is laid on hands on for FORTRAN, Open MPI and parallel computing, and the pace is comfortable even for a beginner in programming. Do take the course, if you are interested in working in this field. This course is mostly offered in Autumn Semester.(Do check ERP, things may change)", "page": "CD61004: High Performance Computing and its Applications in Complex Physical Systems"}, {"chunk_id": "4dbaa873", "title": "Resources", "text": "• An amazing guide for Parallel Computing\n• A good resource on using MPI, the codes are in C language, but the concepts are explained well here\n• Video explaining the basics of Molecular Dynamics\n• Fortran code Snippets , MPI code Snippets written by a random guy in class\n• Code Snippets written by another random guy in class", "page": "CD61004: High Performance Computing and its Applications in Complex Physical Systems"}]