[{"chunk_id": "info_41e5c0", "title": "CE29002: Surveying Peactice - Quick Facts", "text": "CE29002\nCourse name | Surveying Peactice\nOffered by | Civil Engineering\nCredits | 2\nL-T-P | 0-0-3\nPrevious Year Grade Distribution\n37 56 22 1 EX A B C D P F | 37 | 37 | 56 | 56 | 22 | 22 | 1 | 1 | EX | A | B | C | D | P | F\n37 | 37 | 56 | 56 | 22 | 22 | 1 | 1\n37\n56\n22\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "CE29002: Surveying Peactice"}, {"chunk_id": "0c657fe4", "title": "Syllabus mentioned in ERP", "text": "(To be modified as per CE department) Theory: Introduction, ;Types of Surveys, Chaining, Taping, Corrections, Angle and Direction Measurements, Prismatic compass, Measurement of bearing, Computations of angles from bearings, Theodolite Surveying, Temporary Adjustments, Traversing, Principle of Levelling, Simple and Differential Levelling, Adjustments, Plane table Surveying, Different Methods, Two and Three Point Problems, Minor Surveying Instruments, Setting out Simple Works. Practicals: Chaining, Offsets, Field book entry, Triangulation & Traversing, Compass Surveying & Traversing, Plane Table Surveying , TwoPoint and Three Point Problems, Levelling, Level book entry, Preparation of contour Map, Study of Theodolites and Angle Measurements, Theodolite Traversing, Techeometric Traversing, Use of Distomat / Theomat, Interpretation of Aerial Photographs & Satellite Imagery. Surveying through Total Station equipment.", "page": "CE29002: Surveying Peactice"}, {"chunk_id": "6e501d3e", "title": "Concepts taught in class", "text": "Different types of Surveying", "page": "CE29002: Surveying Peactice"}, {"chunk_id": "e202785a", "title": "Student Opinion", "text": "It is a way where you learn to survey different places using various method. It is very important because architects as well as civil engineers need the map which describes the site of work .", "page": "CE29002: Surveying Peactice"}, {"chunk_id": "c8b76070", "title": "How to Crack the Paper", "text": "Just work according to the instructions and consult the TA before submission. Try to rectify the mistakes made in the last submission. Ask every minute details of the instrument and remember them before the viva. Take atleast one reading by yourself such that you get hands on the instrument and try to verify your reading with other members of the group or the TA", "page": "CE29002: Surveying Peactice"}, {"chunk_id": "627f6d74", "title": "Classroom resources", "text": "Get hold of the book that is given by the prof qnd go through it thoroughly before the viva", "page": "CE29002: Surveying Peactice"}, {"chunk_id": "16f6adf4", "title": "Additional Resources", "text": "Consult your senior for more guidance", "page": "CE29002: Surveying Peactice"}]