[{"chunk_id": "info_12a519", "title": "CE39007: Concrete Laboratory - Quick Facts", "text": "CE39007\nCourse name | CONCRETE LABORATORY\nOffered by | Civil Engineering\nCredits | 2\nL-T-P | 0-0-3\nPrevious Year Grade Distribution\n7 59 41 2 3 1 EX A B C D P F | 7 | 7 | 59 | 59 | 41 | 41 | 2 | 2 | 3 | 3 | 1 | 1 | EX | A | B | C | D | P | F\n7 | 7 | 59 | 59 | 41 | 41 | 2 | 2 | 3 | 3 | 1 | 1\n7\n59\n41\n2\n3\n1\nEX | A | B | C | D | P | F\nSemester | {{{semester}}}", "page": "CE39007: Concrete Laboratory"}, {"chunk_id": "803033a0", "title": "Syllabus mentioned in ERP", "text": "Casting and load-deformation test of reinforced concrete and postâtensioned beams. Cement test: Standard consistency; setting times; compressive strength; fineness and soundness, Aggregate Tests: Sieve analysis; Bulking of sand; Aggregate crushing value; Absorption; Unit weights. Tension test of MS, HYSD, HT bars: Yield/ Proof stress, Ultimate Strength, Young s modulus, percentage elongation. Compressive strength of bricks and Pre-conditioning. Load deformation testing of steel beam. Concrete mix design and slump test; Demonstration of flow table, compacting factor and V.B. tests. Study and fixing of electrical resistance strain gages. Determination of E value, Poisson s ratio, Stress Intensity Factor. Calibration of load cells. Dynamics of SDOF, MDOF systems. Photo-elasticity, Properties of hardened concrete and FRC specimens. Compressive strength of cubes by Non-Destructive Testing, Indirect tensile strength of cylinders and FRC cylinders, Modulus of rupture of prisms (2-point and central loading) and FRC prisms", "page": "CE39007: Concrete Laboratory"}, {"chunk_id": "a7e496a1", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | In Dept | In Dept | In Dept\nTuesday\nWednesday\nThursday | In Dept | In Dept | In Dept\nFriday | In Dept | In Dept | In Dept", "page": "CE39007: Concrete Laboratory"}]