[{"chunk_id": "info_f13275", "title": "CE60119: Rock Mechanics And Tunnelling - Quick Facts", "text": "CE60119\nCourse name | Rock Mechanics And Tunnelling\nOffered by | Civil Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | Autumn", "page": "CE60119: Rock Mechanics And Tunnelling"}, {"chunk_id": "0e17081a", "title": "Syllabus mentioned in ERP", "text": "Introduction - objective, scope and problems of Rock Mechanics. Classification by origin, Lithological, Engineering. Rock exploration - rock coring, geophysical methods. Laboratory testing of rocks - all types of compressive strength, tensile strength and flexural strength tests. Strength and failure of rocks â Griffith s theory, Coulombs theory, rheological methods. In-situ tests on rock mass. Deformation characteristics of rocks, instrumentation and measurement of deformation of rocks. Permeability characteristics interstitial water on rocks, unsteady flow of water through jointed rock mass. Mechanical, thermal and electrical properties of rock mass. Correlation between laboratory and field properties. Analysis of stresses. Thick wall cylinder, formulae, Kreish equation, Green span method. Openings in rock mass and stresses around openings. Pressure tunnels, development of plastic zone. Rock support needed to avoid plastic deformation. Lined and unlined tunnels. Underground excavation and subsidence. Rock mechanics applications. Bearing capacity of homogeneous as well as discontinuous rocks. Support pressure and slip of the joint. Delineation of types of rock failure. Unsupported span of underground openings, pillars. Rock slopes. Rock bolting. Plastic mechanics. Tunnels, shapes, usages, Methods of Construction, Problems associated with tunnels, tunnelling in various subsoil conditions and rocks.", "page": "CE60119: Rock Mechanics And Tunnelling"}, {"chunk_id": "33b8b775", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NC441\nTuesday\nWednesday | NC441 | NC441\nThursday\nFriday", "page": "CE60119: Rock Mechanics And Tunnelling"}]