[{"chunk_id": "info_d608ab", "title": "Central Library - Quick Facts", "text": "Central Library\nAbout\nThe central library, one of the largest technical library in India and one of the largest libraries in terms of collection.\nMain Contact\nHead: | Dr. B. Sutradhar ( email )\nWebsite: | http://library.iitkgp.ernet.in\nMain phone: | +91-3222-282432 (O)\nMain Location\nAddress: | Entrance, Main building\nBuilding:", "page": "Central Library"}, {"chunk_id": "2c6b42f2", "title": "Central Library", "text": "The Central Library started in a small room of the Institute old Building, Shahid Bhavan, in the year 1951. It was shifted to its present location in the main building in 1956. This is the first of such central libraries in the IIT System of institutions. Central Library also provides IP based access to 40,000 full-text e-Journals, and 20,000 full-text e-books subscribed by the INDEST-AICTE Consortium to the users. [ 1 ] In November 2014, the Central Library received the ISO 9000:2008 certification. [ 2 ]", "page": "Central Library"}, {"chunk_id": "8473138e", "title": "Sections", "text": "The library has two buildings, the main building and the annex building. The former is further divided into several halls (1-6) while the latter consists of digital library and discussion rooms besides the collection of books.", "page": "Central Library"}, {"chunk_id": "7e677ac2", "title": "Basement", "text": "Image of Basement section of Library, IIT Kharagpur\nThe basement section has a reserved collection of books for the SC/ST students. It has a seating capacity of 168 students. The hall is fully air conditioned and so is one of the most occupied places in hot summer examination days. There are no personal computers provided by the library in this section.", "page": "Central Library"}, {"chunk_id": "598384e8", "title": "Hall 1", "text": "The security gate of the library opens in the Hall 1 after passing the circulation counters. It has the most diversified collection of books among all the other halls. With the seating capacity of 144 students, it also has 2 PCs for the students usage.", "page": "Central Library"}, {"chunk_id": "9dd540ac", "title": "Hall 2", "text": "The Hall 2 does not contain any textbooks and is not listed in the classification of books but has a great collection of reference books of all kinds. It has 80 personal computers installed in the section to access the e-Journals and e-books. There are seats for around 100 people to sit and study along with a couch and two chairs where people prefer to sit and read newspapers and magazines.", "page": "Central Library"}, {"chunk_id": "4401a2ba", "title": "Hall 3", "text": "Hall 3 has a seating capacity of 44 people at one time only but has a great collection of books varying from topics like Philosophy to Ethics and from Social Studies to Languages. The hall has air cooling system via duct pipes and also has table fans on each table. And hence a good place to sit and ponder over reading.", "page": "Central Library"}, {"chunk_id": "2f684355", "title": "Hall 4", "text": "Image of Hall 4 of Library, IIT Kharagpur\nThis hall has a large volume of books of subjects like Chemical engineering, Manufacturing, Management and Agriculture and has a seating capacity of 100 people and does not have a centralized cooling system.", "page": "Central Library"}, {"chunk_id": "ad50e43b", "title": "Hall 5", "text": "Hall 5 is similar to Hall 3 in design and is one floor above the latter one. It has the least number of seating capacity of 16 only but has a good collection of books of subjects like History, Literature and Arts.", "page": "Central Library"}, {"chunk_id": "14e34940", "title": "Hall 6", "text": "Hall 6 is the largest among all the halls with a seating capacity of 200 people at a time and contains the books of major subjects like Science, Mathematics, Physics, Astronomy, Chemistry and Computer Science. The collection also includes all the other rare and unassigned books, quotations, manuscripts and encyclopedias.", "page": "Central Library"}, {"chunk_id": "2b067f2f", "title": "Annex Building", "text": "It contains Digital Library- First Floor, office of National Digital Library project room- Second Floor, study rooms, seminar rooms and group discussion rooms. Mainly Thesis and Journals are kept in Annex Building.", "page": "Central Library"}, {"chunk_id": "3d2a0bbe", "title": "Sorting Section", "text": "This is the place where bulk of books are brought and redirected to proper location.", "page": "Central Library"}, {"chunk_id": "b57416d0", "title": "Acquisition Section", "text": "Third Floor- Above Sorting Section", "page": "Central Library"}, {"chunk_id": "774aad3a", "title": "Technical Processing Section", "text": "Third Floor- Above Sorting Section", "page": "Central Library"}, {"chunk_id": "072b61b4", "title": "Tower Building", "text": "It is situated above Sorting Section. It is a place where precious hard-copies of journals, projects, thesis, research papers are kept.\nSource: Library Orientation Programme", "page": "Central Library"}, {"chunk_id": "b030c385", "title": "Gallery", "text": "Image of Hall 1 of Library, IIT Kharagpur | Image of Hall 2 of Library, IIT Kharagpur\nImage of Hall 3 of Library, IIT Kharagpur | Image of Hall 6 of Library, IIT Kharagpur | Image of Hall 5 of Library, IIT Kharagpur", "page": "Central Library"}, {"chunk_id": "26c911df", "title": "Timings", "text": "Library is open all days from 8 AM to 12 Midnight, except public and institute holidays. [ 3 ] There are, however, exceptional circumstances like semester examinations when the timings as extended to 8 am in the morning, essentially keeping the library open all the time during that period. The notice for such changes are properly conveyed through official channels (library notice board, department notice boards etc.,) and on-campus newspapers.", "page": "Central Library"}, {"chunk_id": "ba321ffe", "title": "Classification", "text": "Classification of books and hall distribution\nThe books are distributed in all the halls as per the Dewey Decimal Classification . The Dewey Decimal Classification System is the most widely used method for classifying books in the library. Hall 1 contains books of all the categories while other halls are divided with sub-categories.", "page": "Central Library"}, {"chunk_id": "b29a4392", "title": "Borrowing Facility", "text": "Library books are issued to all the undergraduate, postgraduate students, research scholars, staff members and faculties. The limit to the number of books and duration is not same for each category but differs.\nCategory | Number of Books | Duration\nUG Students | 5 books | 60 Days\nUG (SC/ST) | 5 + 8 = 13 books | 90 Days\nM.Sc Students | 5 books | 60 Days\nM.Sc (SC/ST) | 5 + 8 = 13 books | 90 Days\nM.Tech Students | 5 books | 60 Days\nM.Tech (SC/ST) | 5 + 8 = 13 books | 90 Days\nM.Tech (Dual Degree) | 5 books | 60 Days\nPhysically Disabled | 8 books | 90 Days\nResearch Scholars | 8 books | 90 Days\nFaculty/Academic Staff | 10 books | 180 Days\nScientific/Computer Staff | 10 books | 180 Days\nNon Faculty Gr. A Staff | 10 books | 180 Days\nGr. B,C,D Staff | 5 books | 90 Days\nProject Manager | 10 books | 90 Days\nProject Staff | 5 books | 90 Days", "page": "Central Library"}, {"chunk_id": "bc35e1e9", "title": "Circulation", "text": "Books can only be issued or returned at fixed circulation timings of the library. For Monday to Friday, it is 9 am to 6 pm and for Saturday and Sunday, it is 9 am to 12 noon and 4 pm to 6 pm. [ 4 ]", "page": "Central Library"}, {"chunk_id": "de8660c8", "title": "Fine Rules", "text": "Library fine can be either be paid through debit/credit at the Circulation Counter or it can be paid at SBI IIT Kharagpur through challan form. [ 5 ] The due deposit counter is open only on weekdays , and that too upto 5 pm.", "page": "Central Library"}, {"chunk_id": "63fb5cde", "title": "Overdue", "text": "The fine is Re 1/- per day after the due date. [ 6 ]", "page": "Central Library"}, {"chunk_id": "f718a33d", "title": "Loss of Book", "text": "In case of loss of a book, the student has following two options- [ 5 ]\n• Replace the lost book by a new book as per the library regulation\n• Pay the current price of the lost book.\nThe price of the book can be inquired by writing a formal application to the Requisition Section along with the details of book.", "page": "Central Library"}, {"chunk_id": "4f549317", "title": "OPAC", "text": "The library maintains an online publicly accessible collection (OPAC) of its records which can be to used to search for books. The interface also provides the facility to view the books issued in one's account, due dates, fine if any and also reserve books if needed. The OPAC interface can be accessed in following two ways:\n• Through the webpage of library, where one can open the link after disabling the proxy. [ 7 ]\n• Through the software installed on publicly usable computers provided at the entrance of library (near the big world map).", "page": "Central Library"}, {"chunk_id": "30aed9a9", "title": "Logging", "text": "OPAC provides you personalized access to your account with several handy features. You can view issued books along with issue and due dates, fine collected, paid long, reserves and wishlist among many other things. To login, just click on the My Account tab on the rightmost part of top navigation bar, and you'll see a login form asking for username and password. Simply enter your roll number as username and click submit (without entering any password). This should login into your account,", "page": "Central Library"}, {"chunk_id": "61297225", "title": "References", "text": "↑ \"IP based access\" . Retrieved 21 May 2015 . ↑ \"Central Library gets ISO Certification\" . The Scholars' Avenue . Retrieved 21 May 2015 . ↑ \"Library General Information\" . IIT Kharagpur . Retrieved 16 May 2015 . ↑ https://commons.wikimedia.org/wiki/File:Borrowing_Facility_of_Books.jpg Notice regarding the timings, Retrieved 18 September 2015 ↑ 5.0 5.1 \"About Circulation System\" . Retrieved 16 May 2015 . ↑ \"Overdue Rules\" . Central Library . Retrieved 16 May 2015 . ↑ \"OPAC - Central Library, IIT Kharagpur\" . IIT Kharagpur . Retrieved 17 May 2015 .", "page": "Central Library"}]