[{"chunk_id": "03dfe6da", "title": "Centre for Excellence in Robotics", "text": "Centre for Excellence in Robotics Logo\nThe Centre for Excellence in Robotics , Indian Institute of Technology Kharagpur, India, is an umbrella body, under the aegis of which, all robotics-related activities of the Institute will be conducted and coordinated.\nThe main emphasis of the center is the design and development of intelligent and autonomous robots and work on research problems and innovative projects that extend the state of the art in robotics. The vision behind it is to promote and encourage student activities, research projects, and relevant courses related to this field. Besides the students, a large number of faculty members from various departments are part of this center.\nCentre for Excellence in Robotics received its first funding from IIT Kharagpur in 2015.", "page": "Centre for Excellence in Robotics"}, {"chunk_id": "369e5ce9", "title": "History", "text": "Robotics as a field is expanding all across the world. So in order to keep up, a proposal for a Centre for Excellence in Robotics was drafted with the initiative of Prof. Partha Pratim Chakrabarti, Current Director with the help of multiple professors and Nalin Gupta, a final year student and then Student Coordinator of AGV in August 2014. This included 10 robotics project proposals from multiple departments, students and professors. [ 1 ]\nIn December 2014, the proposal was accepted which finally included 12 projects and a total fund of 5 Crores approved through the Institute and Centre for Excellence in Robotics was kick-started with Prof. D.K.Pratihar as it's Overall Coordinator. Currently, all 12 projects are running independently funded through Sponsored Research and Industrial Consultancy ( SRIC ). [ 1 ]", "page": "Centre for Excellence in Robotics"}, {"chunk_id": "7a05bd6d", "title": "Research Projects", "text": "Name | Department/Centre | Professors | Abstract | Student Contact | Link\nAerial Robotics Kharagpur | Technology Students Gymkhana | Prof. Somesh Kumar, Prof. Jayanta Mukhopadhyay, Prof. D.K.Pratihar | Design autonomous aerial vehicles which can navigate outdoor and indoor in unknown environment. | Soumyadeep Mukherjee, Fifth Year, RP Hall | Website Link\nAutonomous Ground Vehicle | Department of Mining Engineering | Prof. D.Chakravarty | Team AGV envisions making an autonomous vehicle that is not only practically feasible but also economically viable. | Ayush Pandey, Fourth Year, LBS Hall | Website Link\nBiomedical Robotics for neuro-controlled prosthesis | Medical Science and Technology | Prof. M Manjunatha, Prof. C.S.Kumar | Robotic systems for assistance and rehabilitation focus on providing missing movements and sensing, providing safer environments, and providing environments that make regaining movement-related function easier and faster. | - | -\nDesign and Development of Orthotic Devices for Knee and Hip Joints during Walking of Disabled Person | Department of Mechanical Engineering | Prof. D.K.Pratihar, Prof. S. Gupta | Rehabilitation robotics to regain physical activityusing orthotic devices which are used as artificial instruments to support the skeletal system to modify proper functional characteristics of neuromuscular activity. | - | -\nKharagpur Robosoccer Student's Group | Department of Computer Science and Engineering | Prof. Jayanta Mukhopadhyay, Prof. A.K.Deb, Prof. D.K.Pratihar, Prof. Sudeshna Sarkar | KRSSG is a student research group under the Department of Computer Science and Engineering, primarily working on autonomous soccer playing robots. | Akshay Gupta, Fourth Year, HJB Hall; Raunak Dhaniwala, Fourth Year, Azad Hall; Seemant Jay, Fourth Year, RP Hall | Website Link\nRobot as a Social Assistant | Department of Computer Science and Engineering | Prof. Jayanta Mukhopadhyay, Prof. A.K.Deb, Prof.K.S.Rao | Develop a robotic framework with potential benefits in providing assistance to elderly people or having cognitive disorder. | - | -\nRobotic Framework for exploring rugged and potentially hazardous terrain | Department of Computer Science and Engineering | Prof. Jayanta Mukhopadhyay, Prof. A.K.Deb, Prof.K.S.Rao | This project has got a potential benefits in exploration of a rugged terrain where Human fails in maneuvering due to the instability of their body dynamics as well as in reaching hazardous places. | - | -\nRobotics for Advanced Manufacturing Applications | Department of Mechanical Engineering | Prof. S.Deb | The objectives of our research are (1) to develop intelligent sensor-based robotic system for material handling and assembly applications and (2) to develop sensor integrated multi-finger robot grippers for applications in manufacturing. | - | Website Link\nSwarm IIT Kharagpur | Technology Students' Gymkhana | Prof. Somesh Kumar, Prof. Pallab Dasgupta | The aim of this project is to design a team of coordinating robots which use swarm intelligence to achieve a number of objectives related to navigation and mapping in successive stages. | Kumar Krishna Agarwal, Fourth Year, LBS Hall | Website Link\nUndergraduate Research Support for Underwater Robotics | Department of Mechanical Engineering | Prof. C.S.Kumar, Prof. V Racherla, Prof. V.Nagarajan | The objective of this project is to facilitate a continuing learning and development autonomous systems in underwater robotics. | Abhay Kumar, Fifth Year, RK Hall | Website Link\nUndergraduate research in Humanoid Robotics | Department of Mechanical Engineering | Prof. C.S.Kumar, Prof. M. Manjunatha | Humanoid robotics with bipedal walking has attracted several researchers and bright students worldwide, as these robots challenge the young minds with interesting problems. | Ashish N, Fifth Year, LLR Hall | -\nUser Emotion Classification from Keyboard Keystroke | Department of Computer Science and Engineering | Prof. P.P.Chakrabarti, Prof. D.K.Pratihar | Develop a system capable of classifying user emotion (1. Happiness, 2. Disgust, 3. Anger, 4. Fear, 5. Sadness, 6. Surprise and 7. Neutral.) based on timing data and relative position data of consecutive keystrokes (while typing on a keyboard). | - | -", "page": "Centre for Excellence in Robotics"}, {"chunk_id": "3bafe838", "title": "Mentoring professors", "text": "• Partha Pratim Chakrabarti\n• D.K.Pratihar\n• A.K.Deb\n• C.Jacob\n• C.S.Kumar\n• D.Chakravarty\n• J Mukhopadhyay\n• K.S.Rao\n• M Manjunatha\n• P.Bhowmik\n• P.Dasgupta\n• P.K.Biswas\n• P.P.Das\n• S.Deb\n• S. Gupta\n• S. Kumar\n• S. Sarkar\n• V.Nagarajan\n• V.Racherla", "page": "Centre for Excellence in Robotics"}, {"chunk_id": "a1528b78", "title": "See Also", "text": "• Robotics\n• KRSSG\n• AGV\n• Aerial Robotics Kharagpur\n• Swarm IIT Kgp", "page": "Centre for Excellence in Robotics"}, {"chunk_id": "4e100c45", "title": "References", "text": "↑ 1.0 1.1 Verified by Dementor on September 14, 2015.", "page": "Centre for Excellence in Robotics"}]