[{"chunk_id": "ac0b9ae5", "title": "CET", "text": "Established in 1995, the Centre for Educational Technology (CET) represented IIT Kharagpur’s early recognition of the increasing importance of the role of Technology and Pedagogy in Engineering Education. For the first ten years of its existence, CET remained primarily a Research Centre and concentrated mainly on technology and technology infrastructure development and also conducting research in the area of Technology Enhanced Learning (TEL).The Centre developed Virtual Classroom software, multiparty Video Conferencing tool, Virtual Laboratory in different disciplines, Video on Demand facility (VOD), electronic test item banking sofware and experimented with their use in the teaching-learning process, The country wide Electronically Networked Life-Long Learning (El Net-3L) project being a typical example.\nIn 2001, CET moved into its present 25000 sft fully air conditioned location in the high-tech Takshasila building in the Ramanujan Complex. It houses world class video course production, web course production, video on demand, video conference based teaching facilties and other laboratories.\nFrom 2005, CET took up additional resposibilty of offering M.Tech and Ph.D programmes in both technology and education areas and became a full fledged Academic Centre of the Institute. Currently it offers a two year full time M.Tech programme in Media and Sound Engineering with a major emphasis on audio-video systems engineering and image and speech processing. Presently, there are 9 Ph.D scholars working in widely differing areas such as game based learning, speech and image processing, virtual laboratories. In addition, CET offers several elective courses for non-departmental UG and PG students of IIT kharagpur.\nFaculty members of CET are Principal Investigators of several prestigious national and international R & D projects. [ 1 ]\nProf. Anupam Basu is the current Head of the Center. [ 2 ]", "page": "CET"}, {"chunk_id": "c19c6909", "title": "Research Interests", "text": "• Artificial Intelligence\n• Big Data Analytics\n• Computer Aided Assessment\n• Computer Assisted Language Learning\n• Data and Web Mining\n• Digital Library\n• Educational Psychology\n• Information Retrieval\n• Machine Learning\n• Natural Language Pocessing\n• Pedagogy Design\n• Speech Processing", "page": "CET"}, {"chunk_id": "82534e30", "title": "Research Laboratories", "text": "• Audio-Video Laboratory\n• Editing Laboratory\n• Multimedia Laboratory\n• Post Production Laboratory", "page": "CET"}, {"chunk_id": "cf9d04c5", "title": "References", "text": "↑ http://www.cet.iitkgp.ac.in/cet_site/index.jsp ↑ http://www.iitkgp.ac.in/department/ET", "page": "CET"}]