[{"chunk_id": "efacd7e5", "title": "CGPA", "text": "Starting from the second semester, at the end of each semester S , a Cumulative Grade Point Average (CGPA) will be computed for every student as follows:\n• The CGPA is out of a scale of 10.0. To graduate, a minimum of 6.0 is required [ 1 ] [ 2 ] .\n• \nPerformance | Letter Grade | Grade Point per Credit\nExcellent | EX | 10\nVery Good | A | 9\nGood | B | 8\nFair | C | 7\nAverage | D | 6\nPass | P | 5\nFail | F | 0\nDeregistered | X\n• A Semester Grade Point Average (SGPA) will be computed for each semester. The SGPA will be calculated as follows: CGPA = (Σ i=1 m c i g i ) / (Σ m i=1 c i ) where ‘m’ is the number of subjects registered and cleared for the semester, ‘c i ’ is the number of Credits allotted to a particular subject, and ‘g i ’ is the grade points carried by the letter corresponding to the grade awarded to the student for the subject. SGPA will be rounded off to the second place of decimal and recorded as such. [ 2 ]\n• The CGPA is calculated as follows [ 2 ] : CGPA = (Σ i=1 n c i g i ) / (Σ n i=1 c i ) where n is the total number of subjects the students has registered and cleared from the first semester onwards up to and including the semester S , c i is the number of credits alloted to the subject s i and g i is the grade-point carried by the letter corresponding to the grade awarded to the student for the subject s i . CGPA will be rounded off to the second place of decimal and recorded as such.\n• From 2022, Percetange of Marks = 20/7 (4*CGPA - 5) [ 2 ] . Prior to this, the formula Percentage of Marks = CGPA * 10 [ 1 ] was used.\n• When a student gets the grade ‘F’ in any subject during a semester, the SGPA and the CGPA from that semester onwards will be tentatively calculated, taking only ‘zero points’ for each such ‘F’ grade. After the ‘F’ grade(s) has/have been substituted by better grades during a subsequent semester, the SGPA and the CGPA of all the semesters, starting from the earliest semester in which the ‘F’ grade has been updated, will be recomputed and recorded to take this change of grade into account.", "page": "CGPA"}, {"chunk_id": "c433ae93", "title": "How to Calculate CGPA Result?", "text": "CGPA result is the sum of results of more than one semester or year. GPA results of multiple semesters or years are divided together to show a single result and that is the CGPA result. The CGPA result is calculated by multiplying the credit score of each subject by multiplying all the grade scores by the total credit score. But you can easily get your CGPA result using CGPA-Calculator .", "page": "CGPA"}, {"chunk_id": "c1451b90", "title": "References", "text": "UG Regulation Document\n↑ 1.0 1.1 CertConversionCGPAtoPercentage_PG ↑ 2.0 2.1 2.2 2.3 stu_ad.pdf", "page": "CGPA"}]