[{"chunk_id": "info_effe0c", "title": "CH20001: Fluid Mechanics - Quick Facts", "text": "CH20001\nCourse name | Fluid Mechanics\nOffered by | Chemical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n13 14 23 17 14 6 2 EX A B C D P F | 13 | 13 | 14 | 14 | 23 | 23 | 17 | 17 | 14 | 14 | 6 | 6 | 2 | 2 | EX | A | B | C | D | P | F\n13 | 13 | 14 | 14 | 23 | 23 | 17 | 17 | 14 | 14 | 6 | 6 | 2 | 2\n13\n14\n23\n17\n14\n6\n2\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "CH20001: Fluid Mechanics"}, {"chunk_id": "1655033a", "title": "Syllabus mentioned in ERP", "text": "Definition of Fluid, Lagrangian and Eulerian methods of description; Velocity Field: Streamline and stream function, Vorticity, Stress Field; Rheology: Newtonian/non-Newtonian Fluids. Classification of Fluid Flow: Viscous/Inviscid, Laminar/Turbulent, Compressible/ Incompressible, Internal/External, Rotational/Irrotational. Fluid Statics: Pressure variation in static fluids, manometer, capillary hydrostatics; Macroscopic mass and momentum balance using integral control volume method, Euler & Bernoulli equations. Internal Incompressible Viscous Flow: Fully developed laminar flow in pipes, Couette and annular flows; Hagen Poiseulle Equation; Turbulent flow: Eddy viscosity, Universal velocity profile; Skin and Form Friction, friction factor and friction factor versus Reynolds number relation, Calculation of Head Losses in pipes and fittings, Converging and diverging nozzles, Solution of single and multi-path pipe flow systems. External Incompressible Viscous Flow: Flow around immersed bodies, Drag and Lift, Drag coefficient. Flow Devices and Instruments: Valves, Pumps, Compressors, Flow meters (Head/Area): Venturi, Orifice, Flow nozzle, Rotameter. Flow through Packed and Fluidized Beds; Compressible flow. Text Book: 1.Chemical Engineering –Volume I by J. M. Coulson, J. F. Richardson, J. R. Backhurst and J. H. Harker 2.Elementary Fluid Mechanics by J. K. Vennard and R. L. Street 3.Fluid Mechanics by V. L. Streeter 4.An Introduction to Fluid Dynamics : Principles of Analysis and Design by S. Middleman 5.Introduction to Fluid Mechanics by R. W. Fox & Alan T. McDonald Reference Book: 1.Fluid Mechanics with engineering applications by R. L. Daugherty, J. B. Franzini & E. J. Finnemore 2.Fluid Mechanics for Chemical Engineers by Noel de Nevers 3.Chemical Engineering Fluid Mechanics by Ron Darby. 4.Pump Application Engineering by T. G. Hicks 5.Pump Selection and Application by T. G. Hicks 6.Momentum Transfer Operations by S. K. Gupta 7.Unit Operations of Chemical Engineering by W. L. McCabe, J. C. Smith and P. Harriott 8.Unit Operations by Foust and Wenzel 9.Transport phenomena by R. B. Bird, W. E. Stewart and E. N. Lightfoot.", "page": "CH20001: Fluid Mechanics"}, {"chunk_id": "99e26d3c", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | NC141\nThursday | NC141\nFriday | NC141 | NC141", "page": "CH20001: Fluid Mechanics"}]