[{"chunk_id": "info_c3bfc3", "title": "CH30016: Computer Aided Process Engineering - Quick Facts", "text": "CH30016\nCourse name | Computer Aided Process Engineering\nOffered by | Chemical Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n15 22 20 9 14 13 EX A B C D P F | 15 | 15 | 22 | 22 | 20 | 20 | 9 | 9 | 14 | 14 | 13 | 13 | EX | A | B | C | D | P | F\n15 | 15 | 22 | 22 | 20 | 20 | 9 | 9 | 14 | 14 | 13 | 13\n15\n22\n20\n9\n14\n13\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "CH30016: Computer Aided Process Engineering"}, {"chunk_id": "f6f72b31", "title": "Syllabus mentioned in ERP", "text": "Prerequisite-Mathematics III and IV, and CH30005Review of numerical methods convergence techniques, solution of linear and non-linear algebraic equations, solution of coupled ordinary differential equations. Importance of VLE/ LLE calculations for process simulation. Process modeling and simulation, Information Flow diagram, modelling of different process equipment - heat exchangers, furnaces, flash drum, distillation, absorption, other staged / differential contacting processes, reactors etc. Process flowsheeting and simulators - Simulator components and structures, Salient features of simulators like ASPEN etc. Industrial Automation-Real time systems and Process optimization, Concepts of process economics.Process Integration-Pinch Technology, Heat exchangers network design, MER design, Energy trade off for reducing number of units, Stream splitting, optimization of mass exchangers network and water system.Use of AI (Fuzzy logic, ANN, GA etc.) techniques in process diagnosis, control and optimsation.Text Book:1.User Guide on Process integration for the efficient use of energy by B. Linnhoff et al.2.Fuzzy logic with engineering applications by T. Ross3.Modeling and simulation in chemical engineering, Roger G. E. Franks4.Chemical process design and integration by Robin SmithReference Book:1.Computational methods for processes simulation by W F Ramirez2.Neurofuzzy with soft computing by J S R Jang, C. T. Sun, and E. Mizutani3.Chemical process modeling and computer simulation by A. K. Jana4.Neural network, fuzzy logic and genetic algorithms by S. Rajasekaran and G. A. V. Pai", "page": "CH30016: Computer Aided Process Engineering"}]