[{"chunk_id": "info_54e42d", "title": "CH31001: Mass Transfer I - Quick Facts", "text": "CH31001\nCourse name | Mass Transfer I\nOffered by | Chemical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n10 23 35 27 39 24 5 EX A B C D P F | 10 | 10 | 23 | 23 | 35 | 35 | 27 | 27 | 39 | 39 | 24 | 24 | 5 | 5 | EX | A | B | C | D | P | F\n10 | 10 | 23 | 23 | 35 | 35 | 27 | 27 | 39 | 39 | 24 | 24 | 5 | 5\n10\n23\n35\n27\n39\n24\n5\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "CH31001: Mass Transfer I"}, {"chunk_id": "d4982e92", "title": "Syllabus mentioned in ERP", "text": "Fundamentals of mass transfer: Diffusional mass transfer, mass transfer coefficients, steady state and unsteady state theories of mass transfer, interphase mass transfer, Whitman s two film theory and its variations, multiphase contacting equipments, concept of transfer unit, unified approach to staged processes.Distillation: Vapour-liquid Equilibria â x-y, t-x-y, P-x-y and H-x-y diagrams; Henry s, Raoult s and Dalton s Laws; Ideal and Non-ideal solutions â Azeotropes; Relative Volatility; Flash Vaporization; Differential Distillation; Steam Distillation; Continuous Rectification â Staged Calculation using Ponchon-Savarit and McCabe-Thiele Methods; Complex/Multi-draw Configuration; Packed Distillation Column; Multicomponent Distillation; Azeotropic and Extractive Distillations; Performance Evaluation of Distillation Columns including Reboilers and Condensers.Absorption: solubility, choice of solvent, concept of rate approach and stagewise approach, stage-wise and continuous contact absorbers; rich and lean gases; absorption with chemical reaction. Counter-current and co current multistage operations, dilute and concentrated systems, process design and performance evaluation of absorbers.Crystallisation: Theory of solubility Crystallization, phase diagram (temp/solubility relationship), crystal geometry; crystal nucleation and growth; equilibria and yields; population balance analysis, method of moments for rate expressions for, volume, area and length growth, CSD distribution, MSMPR operation, programmed evaporative and cooling (rate expressions), most dominant size, ideal classified bed, melt Crystallization, process design of crystallisers and their operation, selection and specification of crystallisers like OSLO, Swenson Walker, agitated type, etc. performance evaluation of crystallisers. Text Book:1.Mass Transfer Operations by R. E. Treybal2.Unit Operations of Chemical Engineering by W. L. McCabe, J. C. Smith and P. Harriott3.Diffusion Mass Transfer by E. I. Cussler4.Diffusional Mass Transfer by A. H. P. SkellandReference Book:1.Chemical Engineering, Volume 2 by J. M. Coulson, J.F. Richardson, J. R. Backhurst and J. H. Harker2.Convective Heat and Mass Transfer by W. M. Kays, M. E. Crawford and B. Weigand3.Transport Processes and Unit Operations by C. J. Geankoplis.", "page": "CH31001: Mass Transfer I"}, {"chunk_id": "20c1e46e", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | V3\nTuesday\nWednesday | V3 | V3\nThursday | V3\nFriday", "page": "CH31001: Mass Transfer I"}]