[{"chunk_id": "info_5f4c06", "title": "CH31007: Mechanical Operations - Quick Facts", "text": "CH31007\nCourse name | Mechanical Operations\nOffered by | Chemical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n2 9 20 21 27 10 EX A B C D P F | 2 | 2 | 9 | 9 | 20 | 20 | 21 | 21 | 27 | 27 | 10 | 10 | EX | A | B | C | D | P | F\n2 | 2 | 9 | 9 | 20 | 20 | 21 | 21 | 27 | 27 | 10 | 10\n2\n9\n20\n21\n27\n10\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "CH31007: Mechanical Operations"}, {"chunk_id": "d29fdb33", "title": "Syllabus mentioned in ERP", "text": "Prerequisite -nonePrinciples of crushing and grinding, Laws of crushing and grinding. Determinations of mean particle size, Size distribution equations. Characteristics of industrial crushers and mills. Industrial screening, effectiveness of screens, cyclones. Fluid-particle mechanics, free and hindered settling. Industrial classifiers, clarifiers and thickeners, gravity separation, tabling and jigging. Floatation and its kinetics, magnetic and electrostatic separation and precipitation. Mixing of liquids and solids, power requirement in mixing. Principles of filtration, filtration equipments. Introduction to storage and conveying, elevating equipments, hydraulic and pneumatic transport. Text Book:1.Unit Operations of Chemical Engineering by W. L. McCabe, J. C. Smith and P. Harriott2.Chemical Engineering -Volume 2 by J. M. Coulson, J. F. Richardson, J. R. Backhurst and J. H. Harker3.Principles of Mineral dressing by A. M. GaudinReference Book:1.Chemical Engineers Hand Book by R. H. Perry and C. H. Chilton2.Handbook of Mineral Dressing : Ores and Industrial Minerals by A. F. Taggart.", "page": "CH31007: Mechanical Operations"}, {"chunk_id": "c168242c", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NC343\nTuesday | NC343 | NC343\nWednesday\nThursday | NC343\nFriday", "page": "CH31007: Mechanical Operations"}]