[{"chunk_id": "info_1d300b", "title": "CH31010: Mass Transfer Ii - Quick Facts", "text": "CH31010\nCourse name | Mass Transfer Ii\nOffered by | Chemical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n8 15 16 15 12 10 11 EX A B C D P F | 8 | 8 | 15 | 15 | 16 | 16 | 15 | 15 | 12 | 12 | 10 | 10 | 11 | 11 | EX | A | B | C | D | P | F\n8 | 8 | 15 | 15 | 16 | 16 | 15 | 15 | 12 | 12 | 10 | 10 | 11 | 11\n8\n15\n16\n15\n12\n10\n11\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "CH31010: Mass Transfer Ii"}, {"chunk_id": "68a83172", "title": "Syllabus mentioned in ERP", "text": ". CH30010 Mass Transfer II (3-1-0) Prerequisite â CH30005Humidification/Dehumidification: Definitions, Psychometric chart, Adiabatic saturation and wet-bulb temperatures, Adiabatic and non-adiabatic operations, Dehumidification, Mass and heat balances in bulk and at interfaces, Spray chamber, Cooling towers - counter-current, co-current and cross-current, Performance evaluation of cooling towers, Principles of air conditioning.Drying: Theory and mechanism of drying, Batch and continuous drying; Drying rate curves, Estimation of drying times, Cross-circulation and through-circulation drying, Transfer unit concept in drier, Design calculations with special reference to rotary and spray driers, Special driers â Fluidizedbed, Flash, Dielectric, Freeze, Infrared.Liquid-Liquid Extraction: Ternary liquid equilibria, Solvent selection, Cross-current and counter-current multistage extraction, Staged calculations, Mixer-settlers; Extraction with reflux, Extraction equipment, Performance evaluation of extractors.Leaching: Solid-liquid equilibria, Single and multistage, Cross-current and countercurrent leaching, Steady state and unsteady state operations, Operation and performance evaluation of leaching equipments.Adsorption and Ion Exchange: Adsorption equilibria - Various isotherms, Breakthrough curves, Basic equations, Ion exchange equilibria, Contact filtration, Design of adsorbers and ion exchangers, Chromatography.Membrane Separations: Reverse osmosis, Dialysis, Microfiltration, Ultrafiltration; Pervaporation, Separation of gases and liquids.Text Book:1.Mass Transfer Operations by R. E. Treybal2.Unit Operations of Chemical Engineering by W. L. McCabe, J. C. Smith and P. Harriott3.Diffusion Mass Transfer by E. I. Cussler4.Diffusional Mass Transfer by A. H. P. SkellandReference Book:1.Chemical Engineering, Volume 2 by J. M. Coulson, J.F. Richardson, J. R. Backhurst and J. H. Harker2.Convective Heat and Mass Transfer by W. M. Kays, M. E. Crawford and B. Weigand3.Transport Processes and Unit Operations by C. J. Geankoplis.", "page": "CH31010: Mass Transfer Ii"}]