[{"chunk_id": "info_ee150a", "title": "CH61011: Advanced Fluid Dynamics - Quick Facts", "text": "CH61011\nCourse name | Advanced Fluid Dynamics\nOffered by | Chemical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n2 12 7 11 6 2 EX A B C D P F | 2 | 2 | 12 | 12 | 7 | 7 | 11 | 11 | 6 | 6 | 2 | 2 | EX | A | B | C | D | P | F\n2 | 2 | 12 | 12 | 7 | 7 | 11 | 11 | 6 | 6 | 2 | 2\n2\n12\n7\n11\n6\n2\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "CH61011: Advanced Fluid Dynamics"}, {"chunk_id": "281cd19e", "title": "Syllabus mentioned in ERP", "text": "Prerequisite-CH20001 or equivalentMomentum theorem, equations of change, ideal flow, Eulers equations of motion. Velocity potential, rotational and irrotational flow; Navier-Stokes equation, Poiseuille flow, creep flow and Couette flow. Boundary layer theory: integral momentum analysis. Turbulent boundary layer: turbulence and mixing. Universal velocity profile. Stability analysis of laminar flow, Orr-Sommerfield solution, transition to turbulence, detailed modeling of turbulent flow. Laminar and turbulent flow of non Newtonian fluid. Rheological characteristics, consistency measurement, viscometric flow, pipe and annular flow, pipeline design equations.The phenomena of fluidization and its industrial application. Characteristics of particles. Principle of fluidization and mapping of various regimes. Two phase theory of fluidization. Bubbles in fluidized bed. Entrainment and Elutriation. Fast fluidized bed. Mixing, segregation and gas dispersion. Heat and mass transfer in fluidized bed. Solid-liquid fluidized bed and three phase fluidized bed. Design of fluidized bed reactors.Text Book:1.Fluid Dynamics by P. K. Kundu and I. M. Cohen2.Advanced Engineering Fluid Mechanics by K. Muralidhar and G. Biswas3.Analysis of Transport Phenomena by William M. Denn4.Transport Phenomena by R. B. Bird, W. E. Stewart and E. N. Lightfoot5.Fluidization Engineering by B. Kunni and O LevenspielReference Book: 1.Vector Tensor and Basic equations of Fluid Mechanics by R. Aris2.An Introduction to Fluid Dynamics by G. K. Batchelor3.Viscous Fluid Flow by Frank M. White4.Hydrodynamics by S. H. Lamb5.Fundamental Mechanics of Fluids by I. G. Currie6.Ideal and Incompressible Fluid Dynamics by M. E. O Nell, F. Chorlton.7.Boundary Layer Theory by H. Schlichting8.Fluid Mechanics by L D Landau, Lifschitz9.Hydrodynamic Stability by P. G. Drazin and Reid10.Computational Fluid flow and heat Transfer by K. Muralidhar and T. Sundarrajan", "page": "CH61011: Advanced Fluid Dynamics"}, {"chunk_id": "b793603f", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | NC342\nThursday | NC342\nFriday | NC342 | NC342", "page": "CH61011: Advanced Fluid Dynamics"}]