[{"chunk_id": "info_8a83d7", "title": "CH61016: Process Dynamics And Control - Quick Facts", "text": "CH61016\nCourse name | Process Dynamics and Control\nOffered by | Department of Chemical Engineering\nCredits | 4\nL-T-P | 4-0-0\nProfessor(s) | A.N. Samantal , A.K. Jana [ 1 ]\nVenue(s) | Room No 311, Department of Chemical Engineering [ 1 ]\nPrevious Year Grade Distribution\n6 18 22 10 7 6 EX A B C D P F | 6 | 6 | 18 | 18 | 22 | 22 | 10 | 10 | 7 | 7 | 6 | 6 | EX | A | B | C | D | P | F\n6 | 6 | 18 | 18 | 22 | 22 | 10 | 10 | 7 | 7 | 6 | 6\n6\n18\n22\n10\n7\n6\nEX | A | B | C | D | P | F\nSemester | {{{semester}}}", "page": "CH61016: Process Dynamics And Control"}, {"chunk_id": "10078398", "title": "Syllabus mentioned in ERP", "text": "Linear processes with difficult dynamics. Nonlinear process dynamics; phase-plane analysis; multiple steady state and bifurcation behavior; Process Identification; Controller design via frequency response analysis; Direct synthesis and Internal model control design; Cascade, feed forward and ratio control; Introduction to multivariable systems. Interaction analysis and multiple single loop controller design. Design of multivariable controllers; Controller design for nonlinear systems; Introduction to sampled-data systems; Tools of discrete-time systems analysis; Dynamic analysis of discrete-time systems; Design of digital controllers; Introduction to model predictive control; Convolution models; Model predictive control of MIMO systems", "page": "CH61016: Process Dynamics And Control"}, {"chunk_id": "0e7c8a84", "title": "Concepts taught in class", "text": "The course is divided into two parts each taught by a different professor. Prof. Samanta teaches about the mathematical modelling of the system and it's need along with methods to reduce the model into solvable form. Prof. Jana teaches about the controllers used specifically advanced controllers used in various systems and their need along with the mathematics behind them.", "page": "CH61016: Process Dynamics And Control"}, {"chunk_id": "cf30e7d9", "title": "ANS (Till Midsems)", "text": "• Forms of Control Relevant Model Continuos Domain State Space Model Transform Domain Form Convolution Model Frequency Response Model Discrete Domain State Space Z Domain Model Convolution Model\n• Development of Control Relevant Models Develop the Dynamic Model <math>x' = f(x,u) </math> Decide the Control Objectives - Variable(s) to be Controlled <math> y = h(x) </math> Put these two equations in state space model (Non Linear) State Equation: <math> x' = f(x) + g(x) u </math> <math> y = h(x) </math> Develop a linear model by linearising since it's easy to implement and the theory is well developed. Linear State Space Model - <math> X' = AX + BU </math> Output Model - <math> Y = CX + DU </math> Then Develop the linear control strategy\n• Realization of State Space Model - Getting State Space Model from Transformed Domain Model State Companion Form - Controllable Canonical Form Jordan Companion Form Alternative Companion Form - Toeplitz Method Second Companion Form - Observable Canonical Form", "page": "CH61016: Process Dynamics And Control"}, {"chunk_id": "f8d2663b", "title": "AKJ (Till Midsems)", "text": "Study Chapter 19,20,21 from Chemical Process Control - Stephanopoulos", "page": "CH61016: Process Dynamics And Control"}, {"chunk_id": "e4d053a3", "title": "Additional Resources", "text": "• Observable Canonical Form (m=n)\n• Observable Canonical Form (m<n)\n↑ 1.0 1.1 Verified by Dementor on 2016-02-22.", "page": "CH61016: Process Dynamics And Control"}]