[{"chunk_id": "info_c4d0a8", "title": "CH62015: Advanced Thermodynamics - Quick Facts", "text": "CH62015\nCourse name | Advanced Thermodynamics\nOffered by | Chemical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | Autumn", "page": "CH62015: Advanced Thermodynamics"}, {"chunk_id": "ae9cb1b2", "title": "Syllabus mentioned in ERP", "text": "Prerequisite-CH20004 or equivalentIntroduction to molecular thermodynamics of fluid phase equlibria - basic differences between classical thermodynamics, statistical and molecular thermodynamics. Fundamental concepts of statistical thermodynamics. Classical thermodynamics of phase equilibrium-open and closed systems, Gibbs-Duhem equation, chemical potential, fugacity and activity. Thermodynamic properties from volumetric data-fugacities at moderate pressure, fugacity of a pure liquid or solid. Fugacities in gas mixtures-Virial equation of state, fugacities from Virial equation, third Virial coefficient, chemical interpretations of deviation from gas phase ideality, fugacities at high pressure, Redlich-Kwong equation of state, solubility of solids and liquids in compressed gases. Fugacities in liquid mixtures: excess functions, activity and activity coefficient, testing of equilibrium data, Whols expansion for excess Gibbs energy, equations of van der Waal, Wilson and Renon equations for activity coefficient. Thermodynamic criteria of miscibility.Intermolecular Forces and the theory of corresponding statespotential energy functions for different molecular systems; Polar and non-polar molecules.Theories of solutions: van Laar, Scatchard-Hildebrand theory, Lattice theory, two liquid theories, Flory-Huggins theory.Text Book: 1.Chemical Engineering Thermodynamics by Smith and Van Ness2.Chemical Engineering Thermodynamics by Y. V. C. Rao3.Chemical Engineering Thermodynamics by B. G. Kyle4.Phase Equilibrium thermodynamics by Prausnitz", "page": "CH62015: Advanced Thermodynamics"}, {"chunk_id": "becf2beb", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | Prof. A.N. Roy Seminar Hall\nTuesday\nWednesday | Prof. A.N. Roy Seminar Hall | Prof. A.N. Roy Seminar Hall\nThursday | Prof. A.N. Roy Seminar Hall\nFriday", "page": "CH62015: Advanced Thermodynamics"}]