[{"chunk_id": "info_5d7438", "title": "CH62047: Cfd Applications In Chemical Processing - Quick Facts", "text": "CH62047\nCourse name | Cfd Applications In Chemical Processing\nOffered by | Chemical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n1 EX A B C D P F | 1 | 1 | EX | A | B | C | D | P | F\n1 | 1\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "CH62047: Cfd Applications In Chemical Processing"}, {"chunk_id": "227251f8", "title": "Syllabus mentioned in ERP", "text": "Introduction to Computational Fluid Dynamics (CFD) and modeling of flow; Summary of governing equations; Conservation form of equations; Well-posed and ill-posed problems.Discretization of the equations; Truncation and Round-off error; Explicit and Implicit approaches; Concepts of numerical or artificial viscosity; Different boundary conditions.Application of Finite Difference methods to wave equations, Laplace equations and Burgers equation; Stability considerations.Numerical methods for boundary layer type equations, NavierStokes equations; Outline of MAC and SIMPLE algorithms. Grid generation; Concepts of Finite volume methods.Solution of Flow with coupled heat transfer (forced and natural convection); Outline of Reactive flow (combustion) and multi-phase flow.Introduction of a commercial CFD package (FLUENT).Text/Reference Books:1. Computational Fluid Mechanics and Heat Transfer by D. A. Anderson, J. C. Tannehill and R. H. Pletcher.2. Numerical Heat transfer and and Fluid Flow by S. V. Patankar3. Computational Fluid Dynamics by P. J. Roache4. Computational Methods for Fluid Flow by R. Peyret and T. D. Taylor.", "page": "CH62047: Cfd Applications In Chemical Processing"}, {"chunk_id": "961c3b04", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NC431\nTuesday | NC431 | NC431\nWednesday\nThursday | NC431\nFriday", "page": "CH62047: Cfd Applications In Chemical Processing"}]