[{"chunk_id": "info_e7f642", "title": "CH62045: Chemical Engineering Principles In Polymer Processing - Quick Facts", "text": "CH62045\nCourse name | Chemical Engineering Principles In Polymer Processing\nOffered by | Chemical Engineering\nCredits | 4\nL-T-P | 4-0-0\nPrevious Year Grade Distribution\n6 4 3 3 1 EX A B C D P F | 6 | 6 | 4 | 4 | 3 | 3 | 3 | 3 | 1 | 1 | EX | A | B | C | D | P | F\n6 | 6 | 4 | 4 | 3 | 3 | 3 | 3 | 1 | 1\n6\n4\n3\n3\n1\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "CH62045: Chemical Engineering Principles In Polymer Processing"}, {"chunk_id": "2f469855", "title": "Syllabus mentioned in ERP", "text": "Prerequisite – None Fundamentals of polymer and processing: Polymer structure and properties, Classification of polymers, Molecular weight distribution, polymer rheologies, thermal properties, PVT diagram, morphology, Experimental techniques to determine important polymer properties, Role of additives in polymer processing Chemical Engineering principles in polymer processing: Polymer melt rheology- linear viscoelasticity, GNF and CEF equations, experimental determination of viscosity, elongational flow, Correlations Flow of polymer melts-equation of continuity, equation of motion, flow of viscous polymeric melt. drag and pressure induced flow Mixing- concepts, mechanisms, characterization, distributive and laminar mixing, melt mixing, Mixing in roll mills, internal batch mixing Heat transfer in polymer processing – basic equations, viscous heating, polymer melting, heat removal and polymer cooling process, cooling and crystallization kinetics Pressurization and pumping: viscous pressurization, screw pumps and rotating rolls Other unit operations such as grinding, solid mixing and conveying Polymer processing techniques: Continuous process-Extrusion, calendaring Cyclic process-compression molding, injection molding Transforming process-thermoforming, cold forming, blow molding Other treatment of polymers-welding, adhesive bonding, coating, surface treatment Text Book: 1.Fundamentals of Polymer Processing by Stanley Middleman 2.Understanding Rheology by Faith A. Morrison 3.Principles of Polymer Processing by Z. Tadmor and C. G. Gogos Reference Book: 1.Transport Phenomena by Bird, R.B., W.E. Stewart and E.N. Lightfoot, 2.Dynamics of Polymeric Liquids, Volume 1, by Bird, R.B., R.C. Armstrong and O. Hassager 3.Polymer Processing Principles and Design, by Baird, D.G. and D.I. Collias 4.Polymer Processing Fundamentals by Osswald, T.A.", "page": "CH62045: Chemical Engineering Principles In Polymer Processing"}, {"chunk_id": "3d48d7d9", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NC232\nTuesday\nWednesday\nThursday\nFriday", "page": "CH62045: Chemical Engineering Principles In Polymer Processing"}]