[{"chunk_id": "45396f94", "title": "Foreword", "text": "Technology Students’ Gymkhana is the hub of the numerous extra-curricular and cocurricular activities ranging from sports to music. The Gymkhana is managed by the students, for the students, under the guidance and active participation of the faculty and staff members. Any extensive system of operation needs to be guided by rules, regulations and a constitution. The constitution of the Gymkhana was drafted in 1952 and was revised in 1974. With rapid changes occurring on various fronts in the Institute, the students have felt the need for some revisions of the constitution to reflect the changed condition. Professor S.C.Roy, the present President of the Gymkhana requested Professor Y.P.Singh. an old alumnus and presently a Professor of the Institute to examine the document and to propose revisions. After discussion with the Deans and the concerned student office bearers, the final revised version of the condition is presented here. I must acknowledge my gratitude to Professor Y.P. Singh and others who have contributed to the revised Constitution. I hope this Constitution will serve to heighten the involvement and commitment of the students to the Gymkhana activities.\n( K. L. Chopra ) Director, IIT, Kharagpur & Rector Technology Students’ Gymkhana", "page": "Constitution"}, {"chunk_id": "9149b450", "title": "Preamble", "text": "The Constitution of the Technology Students’ Gymkhana was drawn in the year 1952, and subsequently revised in 1974. The basic structure and philosophy of the Gymkhana as envisaged by the founding fathers of the Institute have stood the test of time, and have been instrumental in contributing to the all round development of the IITians during the last four decades.\nHowever, substantial structural changes during the last two decades have necessitated some modifications in the Constitution of the Technology Students’ Gymkhana. The proposed amendments have been evolved through detailed discussions with a broad cross section of the students and the academic community over a prolonged period, and aim to further enhance the role of the Technology Students’ Gymkhana in aiding its members in the cultivation of their interests in co-curricular and extra-curricular activities. The major changes are in respect of the following:\n• Structural adjustments in the composition of various Committees and Subcommittees for providing a greater degree of initiative to the Secretaries through a greater degree of decentralization. The Executive Committee has been redesignated as the Executive Council to reflect these changes.\n• The Students’ Senate has been given its due recognition as an advisory body to the Vice-President on various matters relating to the Halls of Residence, disciplinary issues and general welfare of the student body.\n• The Students’ Court would fulfill a long felt void and would promote the growth of a more responsible and more self confident student body.\n• The functions of the Modelling Sub-committee have been redefined. This sub-committee would organize the Hobby Club and shall, in collaboration with the Nehru Technology Museum, organize an Inter-hall Modelling Competition in order to provide a new dimension and to give a fillip to the creative potential of the members of the Technology Students’ Gymkhana.\nIt is fervently hoped that these suggested amendments would make the Technology Students’ Gymkhana instrumental in playing a more positive and vibrant role in adding many more dimensions to the multifaceted talents of the members.\nKharagpur ( YASH PAL SINGH ) March 17, 1993 Professor of Electrical Engineering", "page": "Constitution"}, {"chunk_id": "785ce45b", "title": "Constitution Of The Technology Students’ Gymkhana", "text": "INDIAN INSTITUTE OF TECHNOLOGY Kharagpur – 721302", "page": "Constitution"}, {"chunk_id": "00550aa2", "title": "1. Objective", "text": "The Technology Students’ Gymkhana aims to foster a well balanced development of its members through excellence in extra-curricular and cocurricular activities along with their academic attainments. The Gymkhana shall be managed by the elected representatives of the students with active support and guidance of the members of the faculty and staff.", "page": "Constitution"}, {"chunk_id": "e38fcade", "title": "2. Motto", "text": "The motto of the Gymkhana is: “YOGAH KARMASU KAUSALAM”", "page": "Constitution"}, {"chunk_id": "f6b12c6e", "title": "3. Administration", "text": "The Director of the Institute shall be the Rector of the Gymkhana, shall nominate a Professor of the Institute as the President of the Gymkhana and another member of the academic staff as the Honorary Treasurer of the Gymkhana. The President shall be the Chief Executive of the Gymkhana.\nThe affairs of the Gymkhana shall be conducted by the President in consultation with the concerned members of the staff and faculty along with the elected office bearers, constituting the Executive Council and other committees and bodies hereinafter provided. The duties and functions of the President and the other functionaries of the Gymkhana are outlined in Appendix-A.\nThe fund of the Gymkhana shall comprise of fees paid by the members of the Gymkhana, contributions made by the Institute and any other approved grants and contributions. The Rector shall approve the budget and estimates of the receipts and expenditure of the Gymkhana fund on the advice of the Executive Council. The rules governing the finance, budget, accounts and audit of the Gymkhana fund are detailed in Annexure-1.\nThe Rector, on the recommendation of the President shall have the power to dissolve the Executive Council or any or all committee(s) and subcommittee(s) of the Gymkhana and order fresh elections and to have the affairs of the Gymkhana conducted for a limited period through any alternative arrangements he may deem proper.", "page": "Constitution"}, {"chunk_id": "543f65a7", "title": "4. General Body", "text": "All students, undergraduates, postgraduates and research scholars shall be members of the Gymkhana, and they shall collectively constitute the General Body of the Gymkhana. They shall pay the requisite fees, and shall be attached to one of the Halls of Residence. If a member withdraws his residence he shall remain suspended for the period of withdrawal.\n(a) The General Body shall elect the office-bearers for all the elected posts as detailed hereafter, in accordance with the Election Rules given in Appendix B. The President shall preside over meetings of the General Body, and the Vice President shall act as its Secretary.\n(b) The General Body shall have the power to review the performance of the Executive Council and its Committees and Sub-committees. Report on the activities for the session shall normally be submitted by the concerned General Secretaries and the Vice President to the General Body during the Annual Farewell Function of the Technology Students’ Gymkhana.\n(c) The elected office-bearers of the Gymkhana, the Executive Council and its Committees and Sub-committees, and Students’ Forum created and constituted as per this Constitution, shall discharge their stipulated functions on behalf of the General Body under normal conditions.\n(d) The Standing Appeals Committee, and the Students’ Court shall discharge their functions as stipulated in this Constitution.\n(e) In the case of a constitutional crisis, or in emergent situations, an Extra-ordinary meeting of the General Body may be called by the President or by the Vice President with the approval of the President with a notice of at least 24 hours. 400 of the members shall form the quorum for the Extra-ordinary general Body Meeting. The Extra-ordinary meeting of the General Body may recommend specific measures for the emergent situation.", "page": "Constitution"}, {"chunk_id": "2a8fc575", "title": "5. Students’ Forum", "text": "The students’ form shall be a representative body of the general body and shall have as members the following student representatives\ni) All elected office bearers of Gymkhana. ii) The President or General Secretaries of each Hall of Residence. iii) A second representative to the Students’ Senate from each Hall of Residence. iv) The president or General Secretary of each Departmental Society.", "page": "Constitution"}, {"chunk_id": "de199725", "title": "Invitees", "text": "All Ex-Officio members of the Executive Council shall attend the meetings of Forum as invitees. The Dean of Student Affairs , The Dean of Academic Affairs, The Dean of Post Graduate Studies and The Chairman, Hall Management Committee shall be the permanent invitees to the meetings of the Forum.", "page": "Constitution"}, {"chunk_id": "3886def0", "title": "Meetings", "text": "The president shall preside over the meetings of the forum and one of the General Secretaries, Technology Students’ Gymkhana shall act as the secretary. The quorum of the meeting shall be half of the total membership. The forum shall meet at least twice a semester. The meetings of the forum shall be called by the secretary or by requisition of 50 % of the members. The meeting shall be called by giving a written notice of 3 days.", "page": "Constitution"}, {"chunk_id": "a6cc3e4d", "title": "Functions", "text": "a) The forum shall review the annual budget of Gymkhana and the program of its activities. b) The forum on behalf of General Body shall have the power to initiate and propose to the Rector any amendment to the Constitution. Any amendment to the Constitution can be passed only by at least two thirds majorities of the members present and voting, provided the number of votes in favor is in excess of 50 % of the total membership of the Forum. c) The Forum shall elect three Post Graduate representatives, one each for Social & Cultural, Sports and Games, Technology. d) The Forum shall recommend for Presidential nomination three student advisors, one each for Social & Cultural, Sports & Games, Technology from the respective previous year’s General Secretaries. e) The Forum shall elect the Undergraduate, Post Graduate Research Scholar representative to the institute senate. f) The Students’ Forum shall ratify policy decisions taken by the students’ senate with regard to general student welfare, disciplinary policies on the campus. However, this duty does not extend to issues related to appointments and awards and other executive functions. A policy proposal of students’ senate stands ratified only when approved by 2/3rd majority of members present and voting. In a case where the forum does not ratify a policy decision taken by the senate, the same proposal may not be initiated for a period of one year from the date of rejection.", "page": "Constitution"}, {"chunk_id": "a53362b6", "title": "6. Students’ Senate", "text": "The students of IIT Kharagpur are an important part of the IIT Community, and are therefore entitled to an active role in deciding its policies and priorities. To this end, we hereby constitute a Students’ Senate to represent student interests; to promote student groups and organizations; and thereby promote student morale and interaction; and finally, to serve as a campus-wide forum for the expression and exchange of student ideas and opinions. The Senate is a permanently and continuously organized body with authority vested in its representatives and elected officers and officials. This Senate shall also be responsible for any and all matters relating to student welfare as well as the appointment of any groups or delegates to conferences representing IIT Kharagpur’s student body.", "page": "Constitution"}, {"chunk_id": "08289e10", "title": "Composition", "text": "i. Vice President (Chair) ii. UG Representative to Institute Senate (Secretary) iii. President or General Secretary of each Hall of Residence iv. Second Senate Members of all Halls of Residence v. The Postgraduate and Research Scholar representative to the", "page": "Constitution"}, {"chunk_id": "312aac66", "title": "Institute Senate", "text": "Chair: In the absence of the Vice President, President (TSG) chairs the meeting of the students’ senate. In addition The President (TSG) at his will, can choose to chair any of the meetings of Students’ Senate.\nSecretary: In the absence of UG Rep, either PG Rep or RS Rep serves as the secretary. If these two are also absent, then the senate may elect a secretary from amongst the senators to serve in the meeting, by a majority vote.\nIn addition to the given composition, each hall may invite a maximum of one extra member. The member can be invited on grounds of his/her expertise in the matter of discussion however the extra member does not possess voting rights.", "page": "Constitution"}, {"chunk_id": "fb09b6db", "title": "Meetings", "text": "The Students’ Senate must meet at least thrice a semester or/and when initiated by the chair. Meetings on the following occasions are highly recommended:\ni. Before Institute and Gymkhana Functions to review the proceedings and ensure healthy student participation. ii. Before Illumination and Rangoli to discuss the rules and regulations iii. Before Spring Fest and Kshitij to make security plans.\nRequisition meeting of the student senate may be convened on request in writing by one- third of its members.", "page": "Constitution"}, {"chunk_id": "b7bc22bf", "title": "Quorum: 50% of the membership", "text": "Meetings have to be called with a notice of a minimum of 48 hrs in writing. In addition the chairman may call an extra ordinary meeting of the senate at a short notice.", "page": "Constitution"}, {"chunk_id": "2cf5a035", "title": "Role", "text": "i. To advice the Vice President on various matters relating to Halls of Residence, Disciplinary Issues and general welfare of the student body. ii. One time nomination of a standing panel of 8 members for the Student Court while ensuring that these members represent all three spheres of extra curricular activities (Sports, Social-Cultural and Technology) fairly. iii. Discuss the matters of student welfare and interest and initiate proposals related to the general body for implementation by the institute through the Vice President. The proposal might be initiated by any of the senators iv. Recommend Students for Institute Prizes v. Review rules for Illumination and Rangoli Contest.", "page": "Constitution"}, {"chunk_id": "71e2a6e1", "title": "7. Elected Office Bearers", "text": "The General Body shall elect representatives for the following offices: i) Vice President ii) General Secretaries (Sports & Games) iii) General Secretaries (Social & Cultural ) iv) Secretaries of the following Subcommittees(Sports & games):\na) Football Subcommittee b) Cricket Subcommittee c) Hockey Subcommittee d) Tennis Subcommittee e) Indoor Games Subcommittee f) Volleyball Subcommittee g) Basketball Subcommittee h) Badminton Subcommittee i) Gymnasium and Weightlifting Subcommittee j) Athletics Subcommittee k) Aquatics Subcommittee\nv) Secretaries of the following Subcommittees(Social & Cultural):\na) Entertainment Subcommittee b) Dramatics Subcommittee c) Journal Subcommittee d) Literary Subcommittee e) Films and Photography Subcommittee f) Fine Arts and Modeling Subcommittee\nvi) Secretaries of the following Subcommittees(Technology):\na) Knowledge Events Subcommittee b) Application Events Subcommittee c) Innovation Events Subcommittee\nIn addition to the representatives elected by the General Body the following Representatives elected by the Students’ Forum and Students Senate on behalf of the General Body.\ni) Representatives to the Institute Senate\na) Undergraduate Representative to the Institute Senate b) Postgraduate Representative to the Institute Senate c) Research Scholar Representative to the Institute Senate\nii) Advisors to the various Committees\na) Advisor , Social and Cultural Committee b) Advisor, Sports and Games Committee c) Advisor, Technology Committee\niii) Post Graduate Representatives to the various Committees\na) PG Rep , Social and Cultural Committee b) PG Rep , Sports and Games Committee c) PG Rep , Technology Committee\niv) Sitting Panel of Members on the Students’ Court", "page": "Constitution"}, {"chunk_id": "67858578", "title": "8. Nominated Office Bearers", "text": "i) Technology Coordinator ii) Public Relations Chair iii) Governors of the following Societies and Clubs\na) Technology Literary Society b) Technology Dance Society c) English Technology Dramatics Society - Encore d) Hindi Technology Dramatics Society - Pravah e) Eastern Technology Music Society f) Western Technology Music Society g) Technology Robotix Society h) Quiz Club i) Yoga and Health Club iv) Core Organizing Teams of Spring Fest and Kshitij\na) Steering Committee Members b) Core Team Heads c) Core Team Members", "page": "Constitution"}, {"chunk_id": "e02a3202", "title": "9. Executive Council", "text": "There shall be an Executive Council to coordinate all activities of the Gymkhana including participation in events, composition of teams; to frame and to propose the annual budget; to institute and declare the Gymkhana awards and to look after the overall development of the Gymkhana. The Executive Council shall frame rules for conduct of the business of the Gymkhana.\nThe details of the awards are given in Annexure-2. This list can be updated from time to time by the Rector upon advice from the Executive Council. The Executive Council shall be chaired by the President (nominated by the Rector) and shall contain\ni) Six Rector’s Nominees ii) Sports Officer-in-Charge (Ex-officio) iii) Vice President iv) Six General Secretaries v) Three Student Advisors from, one from each Committee vi) Three PG Representatives (Social & Cultural, Sports & Games, Technology)\nThe Vice-President shall act as the Secretary of the Council. Recommendations of all Committees and Subcommittees of the Council shall be submitted to the Executive Council for ratification. The Chairman may request any member of the faculty or staff, Physical Training Instructor (PTI) or student to attend the meeting of the Council by special invitation. The Executive Council shall have the following committees for discharging its various functions:\na) Sports and Games Committee b) Social and Cultural Committee c) Technology Committee\nThe Executive Council shall also organize various Societies and Clubs listed in Appendix-C. The executive Council may also create other Committees, Societies or Clubs for fostering extra-curricular and co-curricular activities among the students.", "page": "Constitution"}, {"chunk_id": "490d20d2", "title": "9(a) Sports & Games Committee", "text": "There shall be a Sports and Games Committee to coordinate the activities of all Subcommittees under this group and to draw up the programme of activities for the year on the basis of proposals submitted by its Subcommittees, The Committee shall recommend to the Executive Council composition of teams for the events and the various awards of the Gymkhana in the sphere of Sports & Games.\nThe following shall constitute the membership of this Committee :\ni) Two faculty members(Rector’s nominee) One of them will be the Chairman of the Committee ii) Honorary Treasurer of the Gymkhana iii) Staff Advisors to the various Subcommittees iv) Sports Officer-in-Charge v) Two General Secretaries(Sports & Games) vi) Secretaries of the Subcommittees(Sports & Games) vii) One student Advisor for Sports and Games (Ex-officio from the Executive Council)\nThe concerned PTIs shall be permanent invitees to meetings of the Committee. One of the General Secretaries shall act as the Secretary of the Sports and Games Committee.\nThe Sports and Games Committee shall have eleven Sub-committees for the discharge of specific functions as outlined in 7 (iv).\nThe following shall be the members of each Subcommittee\ni) One of the General Secretaries (Chairman) ii) Secretary of the Subcommittee(Convener) iii) One Student Representative from each Hall of Residence iv) Sports Officer-in-Charge (Ex-officio) v) PG Representative ( Sports and Games)", "page": "Constitution"}, {"chunk_id": "7d794608", "title": "9(b) Social & Cultural Committee", "text": "There shall be a Social & Cultural Committee to coordinate the activities of all Subcommittees under this group and to draw up the program of activities for the year on the basis of the proposals submitted by the Subcommittees. The Committee shall recommend to the Executive Council, external participation and composition of teams for the events, and the various awards of the Gymkhana in the sphere of Social and Cultural activities.\nThe following shall constitute the membership of this Committee:\ni) Two faculty members (Rector’s nominees) (One of them will be the Chairman of the Committee) ii) Honorary Treasurer of the Gymkhana iii) Staff Advisors to the various Subcommittees iv) Sports Officer v) Two General Secretaries(Social & Cultural) vi) Secretaries of the Subcommittees(Social & Cultural) vii) One Student Adviser(Ex-officio from the Executive Council)\nThe concerned PTIs shall be permanent invitees to meetings of the Committee. One of the general Secretaries shall act as the secretary of the Social and Cultural Committee.\nThe Social and Cultural Committee shall have six Subcommittees for the discharge of specific functions as outlined in 7(v).\nThe following shall be the membership of each Subcommittee:\ni) One of the General Secretaries(Chairman) ii) Secretary of the Subcommittee(Convener) iii) One Student Representative from each Hall of Residence iv) P.T.I.-in-Charge- Ex-officio v) Captain Group Leader of concerned activity.", "page": "Constitution"}, {"chunk_id": "079f52b0", "title": "9(c) Technology Committee", "text": "There shall be a Technology Committee to co-ordinate the Technology General Championship. It shall draw up the program of activities for the year on the basis of proposals submitted by the members of the Committee. The Committee shall recommend to the Executive Council, composition of teams for the events and various awards of the Gymkhana in the sphere of Technology activities.\nThe following shall constitute the membership of this Committee:\n(i) Two faculty members (Rector’s nominees) (One of them will be the chairman of the committee) (ii) Honorary Treasurer of the Gymkhana (iii) Sports Officer-in-charge (iv) Two General Secretaries (Technology) (one of them will be the secretary) (v) One student representative from each hall of Residence. (vi) One student Advisor for Technology (Ex-officio from the Executive Council) (vii) PG Representative (Technology) The Technology Committee shall have three Sub-committees for the discharge of specific functions as outlined in 7 (vi). The following shall be the members of each Subcommittee vi) One of the General Secretaries (Chairman) vii) Secretary of the Subcommittee(Convener) viii) One Student Representative from each Hall of Residence ix) Sports Officer-in-Charge (Ex-officio) x) PG Representative ( Sports and Games)", "page": "Constitution"}, {"chunk_id": "22bf39eb", "title": "9. (d) Details of Subcommittee Meetings", "text": "1. The Secretary of the Subcommittee shall call the meeting in consultation with the General Secretary with 2 days notice. 60 percent of members shall form the quorum for the meeting.\n2. Any sub committee meeting held without the presence of any one of the General Secretaries of Sports and Games will be considered null.\n3. Only 1 student representatives from each hall will be allowed in the sub committee meetings.\n4. Any hall of residence failing to attend a Sub Committee meeting will have to abide by all the decisions taken in that Sub Committee meeting.\n5. If a hall of residence does not report on time for a sub-committee meeting, then reminder will be given to the Hall President or the Second Senate Member. If they fail to do the needful within 24 hours, no further requests will be entertained.\n6. Any hall of residence attending a sub-committee and agreeing to participate, have to participate in the events or else debarring rules (mentioned in the respective rule-books) will be put to work against them.\n7. Any inter hall event can be postponed until further notice only with absolute consensus from all the members present in the subcommittee meeting followed by approval of the President.\n8. The subcommittee shall frame rules, finalize the judges/officials for the event and discuss all other matters relevant to the event.\n9. All decisions (other than postponement of events) of the subcommittee shall be approved by the subcommittee by a 2/3rd majority of the halls present.\n10. In case of a deadlock the decision of the President TSG shall be final and binding.", "page": "Constitution"}, {"chunk_id": "646a3d80", "title": "10. Purchase Committee", "text": "All purchases to be made by the Gymkhana should be approved by the Purchase Committee. The Committee shall consist of – i. Honorary Treasurer of the Gymkhana (Chairman) ii. Vice-President (Secretary) iii. Concerned Rector Nominees iv. Sports Officer-In-Charge v. Concerned General Secretaries.\nThe concerned Staff Advisor and the SO/PTI shall be permanent invitees to the meetings of the Committee.\nPurchase procedures shall be strictly as per the Institute rules.", "page": "Constitution"}, {"chunk_id": "6ac4cd8e", "title": "11. Standing Appeals Committee", "text": "Appeals arising out of any technical dispute during the Inter Hall, Open IIT and other in-house competitions held shall be referred to the Standing Appeals Committee. The Committee shall consist of:\ni) Vice- President (Chairman) ii) General Secretaries concerned(one of them will be the convener) iii) Secretary concerned iv) Rector Nominees concerned v) Sports Officer-in-charge vi) P.T.I. concerned The decision of the Appeals Committee shall be final and shall be reported to the President. A member, who is a party to the dispute, may attend the meeting only as an observer.\nIn Sports and Games events, the decision of the Jury of Appeals Committee (if any) shall be final and binding.", "page": "Constitution"}, {"chunk_id": "29edbca2", "title": "12. Students’ Court", "text": "Cases of severe breach of conduct in connection with events conducted by the Technology Students’ Gymkhana and severe violation of the Constitution by an Office-bearer/individual/hall shall be referred to the President of the Technology Students’ Gymkhana who may refer the case to a bench of the Students’ Court.\nThe composition of the Students’ Court shall be as follows: i) President (Chairman) ii) Concerned Rector Nominees iii) Sports Officer in Charge iv) Vice President v) Standing panel of nominees of the Students’ Senate\nWhile the emphasis and endeavor of the Students’ Court would be on reconciliation rather than punishment, the court may recommend suitable punishments to be awarded by the President after giving a hearing to the parties concerned. In extraordinary cases, the President may refer a case to the Rector for appropriate action.", "page": "Constitution"}, {"chunk_id": "2c3afc01", "title": "Possible Sanctions", "text": "Below is a list of the sanctions available to the Students’ Court: 1. Disciplinary Warning 2. Suspension from a particular event for a particular time period. This can be awarded to a hall as well as an individual. 3. Restrictions on further participation 4. Fines 5. Restitution 6. Community Service 7. Impeachment (in cases where the offender is a Gymkhana Office bearer) The offender has the right to appeal against the action(s) taken by the Students’ Court on him/her. He/she must do so by submitting a written application to the President within 24 hours after the decision is taken.\nThe decision of Impeachment has to be reported to the General Body by means of a notice stating clearly the reasons of Impeachment. The Impeachment of the Vice President and the General Secretaries stands void unless approved by the Dean (S/A) as well as the Rector.", "page": "Constitution"}, {"chunk_id": "2cf8c872", "title": "President", "text": "i. The President shall normally preside over the meetings of the General Body, the Forum, and the Executive Council. He shall have full administrative powers over the Gymkhana affairs and shall control and operate all funds of the Gymkhana.\nii. The President shall be the patron and the guardian of the Gymkhana Constitution. It is his responsibility to oversee that the constitution is being upheld in letter and spirit.\niii. In emergent cases, the President shall take decisions(s) on the recommendations the Vice President and/or the Secretary concerned and these shall be ratified by the committee post-facto.\niv. In case no member of the Gymkhana is elected to an office and in case an elected office falls vacant due to the resignation or absence of an office-bearer, the President shall nominate a member to the post concerned or he may assign the responsibility to any elected office bearer.\nv. The President shall appoint a member of the academic staff as Election Officer to conduct the general elections of the Gymkhana for each session.\nvi. The President, in consultation with the concerned members of the Executive Council shall appoint the governors of all Gymkhana Clubs and Societies except Robotics Society where the President shall consult with the governors of the previous year and the associated faculty members of KRAIG.\nvii. The President is the Chairman of Technology Aquatic Society.\nviii. The President shall be the supervisory authority in both the fests.\nix. In the temporary absence of the President, one of the senior members of the Executive Council shall, with the approval of the Rector, officiate for the President.", "page": "Constitution"}, {"chunk_id": "def9cbb2", "title": "Honorary Treasurer", "text": "The Hony. Treasurer shall look after the proper maintenance of Gymkhana accounts and be the custodian of funds and records of the Gymkhana.\ni. He shall also hold the Imprest Fund for meeting the day-do-day expenses. ii. He shall be a member of executive council Sports and Games Committee, Social and Cultural Committee, Technology Committee and Technology Aquatics Society. iii. He shall be the chairman of the Purchase Committee.", "page": "Constitution"}, {"chunk_id": "99b0503c", "title": "Rector’s Nominees", "text": "The Rector’s Nominees will assist the President in the smooth functioning and organization of various activities.\ni. They shall chair the meetings of the Sports and Games Committee, and the Social and Cultural Committees.\nii. They shall be members of concerned purchase committee.", "page": "Constitution"}, {"chunk_id": "e5e4b887", "title": "Vice President", "text": "i. The Vice President shall be a student member of the Gymkhana and elected by the General Body. ii. The Vice President shall co-ordinate the activities of the different committees and sub-committees of the Gymkhana and shall chair the meetings of the Academic Committee, the Students’ Senate and the Standing Appeals Committee. iii. He shall be a member of Purchase committee and Technology Aquatics Society. iv. He will also preside over the proceedings of the Students’ Court. v. He shall also carry out such other functions as may be delegated to him by the President. vi. He shall be supervisory authority in the both the fests, Kshitij and Spring fest. vii. He along with the Steering Committee members and General secretaries shall report to steering committee Chairman and Co-Chairman from time to time. viii. He shall be in charge of fest security. ix. Along with President and Treasurer of the Gymkhana it is the responsibility of the Vice President to meet the audit observations expeditiously. x. He shall represent the general body at the institute senate, Institute Standing Disciplinary Committee, B C Roy Management Committee, Consumer Establishment and Licensing Committee and Student Brotherhood Fund and all other such committees and organizations where these students interest are involved.", "page": "Constitution"}, {"chunk_id": "83aaef87", "title": "General Secretaries", "text": "i. There shall be six General Secretaries elected by the General Body:\na) Two General Secretaries for the Social and Cultural Committee b) Two for the Sports and Games Committee c) Two for the Technology Committee. ii. The General Secretaries shall coordinate the activities of the various subcommittees and shall jointly be responsible for the day to day running of the Gymkhana activities. iii. They shall preside over the subcommittee meetings. iv. The General Secretaries (Social and Cultural) and General Secretaries (Technology) shall be respectively the executive heads of Spring Fest and Kshitij. v. They shall carry out such functions as assigned to them by the President and the Vice President.", "page": "Constitution"}, {"chunk_id": "0483f502", "title": "Secretaries", "text": "The Secretaries of the various subcommittees shall be responsible for the development and the smooth running of the activities of their respective subcommittees. The other members of the subcommittee shall assist the Secretary in the day-to-day activities.", "page": "Constitution"}, {"chunk_id": "a487eb85", "title": "Staff Advisors", "text": "For each of the subcommittees, the President may nominate one or more members of the Staff to act as advisers. The budget and other important decisions of the subcommittee shall have the approval of the staff advisers.", "page": "Constitution"}, {"chunk_id": "68d6c73a", "title": "Representatives to the Institute Senate", "text": "There shall be four student representatives to the Institute Senate namely, Vice President, Undergraduate, Postgraduate, and research scholar representatives.", "page": "Constitution"}, {"chunk_id": "fcbb08b2", "title": "Undergraduate representative", "text": "a) He shall represent the undergraduate students’ interest at the institute senate. b) He shall be a member institute standing Disciplinary committee. c) He shall be the secretary of the students’ Senate and shall be responsible for convening all its meetings and maintaining a proper record of the agenda and decisions. d) He shall be a member of Student Forum", "page": "Constitution"}, {"chunk_id": "3d716f72", "title": "Postgraduate Representative", "text": "a) He shall represent the Postgraduate students’ interest at the institute senate. b) He shall be a member institute standing Disciplinary committee. c) He shall be the secretary of the Student Forum and shall be responsible for convening all its meetings and maintaining a proper record of the agenda and decisions. d) He shall be member of Student Senate. In absence of undergraduate representative, he shall also act as the secretary of student senate. e) He shall be directly responsible to ensure the participation and involvement of the PG representatives to the various committee and fests of Gymkhana. f) His prime responsibility is to inculcate awareness and increase participation in gymkhana events amongst PG students.", "page": "Constitution"}, {"chunk_id": "822bd32c", "title": "Research Scholar Representative", "text": "a) He shall represent the Research Scholar students’ interest at the institute senate. b) He shall be a member institute standing Disciplinary committee. c) He shall be the secretary of the Student Forum and shall be responsible for convening all its meetings and maintaining a proper record of the agenda and decisions. d) He shall be member of Student Senate. In absence of undergraduate representative, he shall also act as the secretary of student senate.", "page": "Constitution"}, {"chunk_id": "00269d8f", "title": "Post Graduate Representatives (to the Gymkhana)", "text": "a) The PG representative shall assist the General Secretaries in conducting the respective General Championships. b) They shall further try to inculcate awareness and increase participation in Gymkhana events amongst PG Students. c) There shall be one PG representative, each, for social and cultural, Sports and Games and Technology. They shall be elected by the Students’ Forum.", "page": "Constitution"}, {"chunk_id": "11a58b98", "title": "Sitting Panel of Members on the Students’ Court", "text": "An eight member standing panel for the Students’ Court will be nominated by the President from a list of senior students nominated by the Students’ Senate. Their primary duty is to be present whenever summoned by the President and give their opinion on the matter in front the Court.", "page": "Constitution"}, {"chunk_id": "a226f827", "title": "Audit Board", "text": "A three member Audit Board shall be nominated by the Rector, the Assistant Registrar (Audit), being an Ex-officio member.", "page": "Constitution"}, {"chunk_id": "771bf505", "title": "Election", "text": "1. The President shall appoint a member of the academic staff as Election Officer to conduct the general elections of the Gymkhana for each session. The Election Officer shall be responsible for proper conduct of the Election. He may take the assistance of members of the staff as when required for the smooth conduct of the elections. He shall frame the rules of elections with the approval of the Executive Council. He may declare the provisional results immediately after the counting of votes and shall submit the results of the election to the President for ratification. The decision of the Election Officer in all matters arising in connection with the election shall be final and binding.\n2. Any member of the Technology Students’ Gymkhana, who meets the eligibility criteria given below and unless specifically disqualified, is eligible to stand for the posts in the Technology Students’ Gymkhana. The elections, if required, will be contested on a non-sectarian and apolitical basis. Use of any religious or political symbols is strictly prohibited. All office bearers shall be elected by secret ballot.\n3. All bonafide members of the TSG, unless specifically disqualified, shall have voting rights. In the event of a student having withdrawn his/her name from the Institute rolls for a full academic year, he/she shall forfeit his/her voting right for the corresponding period. A student who has been debarred from attending the Institute shall not be allowed to take part in the election for that particular period. A student found guilty by the Institute Disciplinary Committee/Examination Malpractice Prevention Committee shall not be allowed to contest the election.\n4. The President shall nominate an office bearer in case no member is elected to the office or in cases when an office may fall vacant.", "page": "Constitution"}, {"chunk_id": "e106df53", "title": "Eligibility Criteria", "text": "1. Vice President: Minimum experience of three academic years in IIT Kharagpur. 2. General Secretary: Minimum experience of 2 academic years in IIT Kharagpur. 3. Secretary: Minimum experience of 1 academic year in IIT Kharagpur.", "page": "Constitution"}, {"chunk_id": "054a1552", "title": "APPENDIX – C", "text": "a. TECHNOLOGY LITERARY SOCIETY : The TLS shall be responsible for the publication of Alankar. It shall be an annual journal published under the auspices of the TSG and its object shall be to encourage students to take an active interest in journalism. Its publication shall be coordinated by the Secretary, Journal Sub-committee. The Governing Body of the journal shall consist of THREE student Editors per section nominated by the President, in consultation with the concerned student members of the Executive Council. The editors shall be responsible for the journalistic contents of the Alankar, which shall have the approval of a Rector’s Nominee(s) (Social and Cultural). The Secretary shall look after the administrative aspects of the publication. Members of the Governing Body shall also attend the subcommittee meetings.\nb. TECHNOLOGY DRAMATICS SOCIETIES : The TDS shall endeavor to encourage the production of plays, writing of scripts and allied activities among the students. Its activities shall be coordinated by the Secretary, Dramatics Subcommittee. The TDS shall have FOUR sections: English (ETDS), Hindi (HTDS) and Bengali (BTDS) and Telugu(TTDS). Each of the sections shall be run by a Governing Body which shall consist of three student governors nominated by the President in consultation with the concerned members of the Executive Council. The Dramatics Secretary along with the concerned Governors shall be responsible for the overall functioning of the Dramatics societies. The Governors shall be mainly responsible for the direction and production while the Secretary will be responsible for arranging the required infrastructure.\nMembers of the Governing Bodies shall also attend the subcommittee meetings.\nc. TECHNOLOGY MUSIC SOCIETY (TMS): The TMS shall have two sections Eastern (ETMS) and Western (WTMS).\nThe TMS shall organize various musical functions for the Gymkhana and help the members interested in learning music. The Governing Body of each section of the TMS shall consist of THREE governors nominated by the President in consultation with the concerned members of the Executive Council. The Secretary, Entertainment Subcommittee, along with the Governors shall be responsible for the overall functioning of the TMS. The activities of the TMS shall be coordinated by the Governors. The Secretary, Entertainment Subcommittee shall be responsible for arranging the required infrastructure. The Governors shall attend the sub-committee meetings.\nd. Robotics Society: The Robotics Society shall be responsible for promoting activities related to robotics design among students. It shall conduct workshops for the students and conduct Robotics events under Technology students Gymkhana.\nThe activities of the Robotics society shall be coordinated by THREE Governors, who shall be nominated by the President in consultation with the governors of the previous year and associated faculty members of KRAIG.\ne. Technology Aquatics Society: The TAS shall be responsible for maintenance and upkeep of the swimming pool. It shall be funded from the membership fees collected by the society. It shall have a Vice Chairman, who will be a faculty member nominated by the President in consultation with the concerned members of the Executive Council. The following shall be composition of the TAS.\ni) President (Chairman) ii) Vice Chairman iii) Hony. Treasurer of the Gymkhana iv) Sports Officer-in-Charge v) General Secretaries (Sports and Games), one of them shall be Secretary. vi) Secretary, Aquatic Sub-committee vii) Physical Education viii) Student Advisor (Sports and Games)\nThe Rector’s Nominees (Sports and Games) and representatives from TEAK, IITEU and IITEA shall be permanent invitees to the meetings of the TAS.\nf. QUIZ CLUB : The Quiz Club shall be managed by the General Secretary (technology) and shall promote quizzing culture in the Institute on behalf of Gymkhana. It shall also decide about quiz team members for participation in National and International quiz competitions. It shall be coordinated by General Secretary (Technology) and THREE Governors/Members nominated to the club by the President in consultation with concerned student members of the Executive Council.\ng. Yoga and Health Club: It shall be coordinated by the Governors of the club, who shall be nominated by the President in consultation with the concerned student members of the Executive council. Its aim is to encourage practice of yoga by the students in each hall. Its aim is to encourage practice of yoga by the students in each hall. It will also submit proposals for organizing workshops and seminars on yoga and health care for the benefit of the students to the President.", "page": "Constitution"}, {"chunk_id": "bdc42a53", "title": "Flag", "text": "a) The flag of the Gymkhana shall be made of either silk or khadi. b) The flag shall be rectangular in shape and the ratio of the flag length to its breadth shall be 3 : 2. c) The flag shall be composed of two equal parts. The upper half of the flag shall be of navy blue and the lower half shall be of gold colour. d) The crest of the Gymkhana shall be inscribed at the center of the flag in a suitable combination of navy blue and gold shades. e) The words “TECHNOLOGY STUDENTS’ GYMKHANA, I.I.T., KHARAGPUR ” shall be inscribed on the flag below the crest.\nCrest : The crest of the Gymkhana shall be the approved crest of the Institute. Gymkhana Tie : The official Gymkhana Tie shall be as approved. Gymkhana Blazer : The Gymkhana Blazer shall be of navy blue colour with the Gymkhana crest inscribed on the left. Common Dress : For ceremonial functions, the approved common dress for the members of the Gymkhana shall be as follows : For Gentlemen : White canvas or black shoes, white trousers, white shirt, Gymkhana blazer with Gymkhana crest and Gymkhana tie. For Ladies : White canvas or black shoes, white salwar kameez with blue dupatta, Gymkhana blazer.\nSports Uniform : The sports uniform for the Gymkhana shall be of the following description :\na) The body of the uniform shall incorporate the TSG color-navy blue and golden yellow and shall be bear the Institute crest inscribed in gold or any other suitable colour on the left side of the chest.\nb) For any game or sport the uniform may be suitably modified to suit the convenience of the particular game or sport.", "page": "Constitution"}, {"chunk_id": "bab4fa6f", "title": "APPENDIX-E", "text": "The Technology Students’ Gymkhana organizes two festivals in the academic year-\n1. SPRING FEST- the socio-cultural festival. 2. KSHITIJ- the techno-management festival. i. The President shall be the Patron of both the fests. He shall be updated of the developments periodically by the Chairman, the Vice- President and the General Secretaries. ii. The President in consultation with the Vice President and the respective General Secretaries shall nominate from among the faculty members the following: - Chairman, Steering Committee - Kshitij - Chairman, Steering Committee - Spring Fest - 2 Co-Chairmen, Steering Committee - Kshitij - 2 Co-Chairmen, Steering Committee - Spring Fest\niii. The President, Chairman, co-Chairmen, Vice-President and the General Secretaries shall form the signatory authorities of the fests.\niv. The two fests shall be organized by the Vice-President and the respective General secretaries who shall be aided by a Core Committee.\nv. The Core Committee shall comprise of the Vice-President, the 2 General Secretaries, the Steering Committee Members, the Core Team Heads and the Core Team members.\nvi. The Core Committee (Except for Members) must be formed within 14 days after the declaration of the Gymkhana election results.\nvii. Except the VP, no student shall be a member of the Core team of both the fests.", "page": "Constitution"}, {"chunk_id": "3516bac1", "title": "Primary Responsibilities", "text": "The primary responsibilities of the various designations are enlisted below.", "page": "Constitution"}, {"chunk_id": "575a9344", "title": "VICE- PRESIDENT", "text": "i. The Vice-President shall be a supervisory authority in both the fests. ii. He along with the Steering Committee Members and the General Secretaries shall report to the Steering Committee Chairman and Co-Chairmen from time to time iii. He shall be the In-Charge of fest security.", "page": "Constitution"}, {"chunk_id": "4ffa5cbb", "title": "GENERAL SECRETARIES", "text": "i. The General Secretaries shall be the executive heads of the respective fests. ii. All matters pertaining to fests such as event management, publicity, sponsorship and finance shall be coordinated by the General Secretaries, aided and advised by the respective Core Team Heads. iii. The General Secretaries shall report to the Steering Committee regularly about the progress of work. iv. They shall submit a detailed report on the fest to the president by March 15 of the current year.", "page": "Constitution"}, {"chunk_id": "9106ddde", "title": "STEERING COMMITTEE", "text": "i. The Steering Committee Members shall be nominated by the President of the recommendation of the Vice President and the General Secretaries concerned. ii. The General Secretaries of the previous year shall be ex-officio members of Steering Committee. iii. Steering Committee Members shall be responsible for advising and reviewing the decisions taken by the General Secretaries and Heads. iv. The number of Steering Committee Members shall not exceed 15. v. In addition there shall be at least one Steering Committee Member in Kshitij from Vinod Gupta School of Management. vi. The President, in consultation with the Vice-President and the General Secretaries concerned shall nominate one Post Graduate Representatives for each festival.\n- Eligibility Criteria- 1. He/She should have been a Core Team Head of the respective fests.", "page": "Constitution"}, {"chunk_id": "3f8256c9", "title": "CORE TEAM HEADS", "text": "i. The Heads shall be nominated by the General Secretaries after consulting with the Steering Committee Members. ii. The working of the Heads shall be coordinated by the General Secretaries. iii. The heads shall be in charge of any one of the following: Event Management/Action, Publicity and Sponsorship, Finance. In Kshitij, there will be one Core Team Head in charge of Media and Public Relations. iv. All Hall of residence with eligible people shall have at least one Core Team Head. v. Number of Heads shall not exceed 15. vi. In addition there shall be two heads from VGSOM in Kshitij. They need not fulfill the necessary criterion given below.\n- Eligibility Criteria 1. Heads should have completed at least 2 academic years in IIT Kharagpur.", "page": "Constitution"}, {"chunk_id": "6c0199fe", "title": "MEMBERS", "text": "i. The Members shall work under the Heads and General Secretaries. ii. They shall be nominated by the General Secretaries in consultation with the Core Team Heads.\n- Eligibility Criteria 1. Members should have completed at least 1 academic year in IIT Kharagpur.", "page": "Constitution"}, {"chunk_id": "6517b29a", "title": "Eligibility Criteria", "text": "Minimum experience of two academic years in IIT Kharagpur.", "page": "Constitution"}, {"chunk_id": "d1f36573", "title": "Selection Procedure", "text": "The Technology Coordinator will be appointed after the elections and before the end of the corresponding spring semester by the elected VicePresident, the immediate previous Vice-President and the immediate previous Technology Coordinator. He will serve until the appointment of a Technology Coordinator after the next elections.", "page": "Constitution"}, {"chunk_id": "877eb683", "title": "Roles", "text": "i) Administration of all Gymkhana electronic mail. ii) Maintenance of the Gymkhana website. iii) The Technology Coordinator along with the Vice-President will maintain exclusive access to all Gymkhana electronic properties and will leave the authority to delegate access to the Gymkhana electronic mail. iv) The Vice-President , along with the Technology Coordinator may nominate a maximum of 2 Technology Assistant Coordinators to assist the Technology Coordinator.", "page": "Constitution"}, {"chunk_id": "ca80996c", "title": "2. PUBLIC RELATIONS CHAIR:", "text": "A public relations chair shall be appointed by the President in consultation with the Vice President, immediate previous Vice President and the immediate previous Public Relations Chairman on the basis of an interview.", "page": "Constitution"}, {"chunk_id": "828c659b", "title": "Eligibility", "text": "To be eligible for the office, a person should have a minimum of 2 years academic experience in IIT Kharagpur.", "page": "Constitution"}, {"chunk_id": "7097650f", "title": "Selection Procedure", "text": "The Public Relations Chair (PRC) will be appointed after the elections and before the end of the corresponding spring semester by the elected VicePresident, the immediate previous Vice-President and the immediate previous PRC. He will serve until the appointment of a Public Relations Chair after the next elections.", "page": "Constitution"}, {"chunk_id": "dc0aa649", "title": "Functions", "text": "i. Distribution of information relating to general students’ activities, Gymkhana activities.\nii. Ensuring wide publicity for events/programs/competitions conducted by bodies outside the purview of IIT Kharagpur.\niii. Familiarization of various extra-academic activities within IIT Kharagpur among the first year students.\niv. The Public Relations Chair may also take feedback from the students on various issues related to Gymkhana. This includes circulation of minutes of meeting organized by students’ senate , students’ forum, committees, sub committee and students’ forum.", "page": "Constitution"}, {"chunk_id": "9d597eab", "title": "ANNEXURE – 1", "text": "GYMKHANA FUND RULES GOVERNING FINANCE, BUDGET, ACCOUNTS AND AUDIT\n1.0 Finance : The fund of the Gymkhana shall comprise : a) The fees paid annually by the students of the Institute as the Gymkhana fee at the rate fixed form time to time. b) Adequate Annual contribution by the Institute. c) Any other approved contribution.\n1.1 All fees payable by the students in respect of the Gymkhana shall be collected centrally by the cashier of the Institute. A separate account shall be opened in the name of the “Technology Students’ Gymkhana.” Intimation as regards the amounts credited to the Bank account shall be sent by the Institute Cahier to the Hony. Treasurer of the Gymkhana on each occasion.\nSimilarly, the Institute contributions payable to the Gymkhana Fund shall also be credited to the Bank account referred as above, under intimation to the Hony. Treasurer of the Gymkhana. A formal acknowledgement of the money so transferred to the Gymkhana Bank account shall be made by the President of the Gymkhana.\n1.2 Any unspent balance left in the Gymkhana account at the close of a year carried forward to a reserve fund which may be utilized for Gymkhana activities in subsequent period with the approval of the Executive Council.\n1.3 Out of the fund as created above, an imprest amount as approved by the Rector from time to time, may be held by the Hony. Treasurer of the Gymkhana for meeting day to day expenses, as per rules of the Institute.\n1.4 Under provisions made in the Budget, as referred to elsewhere in these Rules, and with the approval of the President, an advance may be made from the Gymkhana fund for meeting expenses of special nature on occasions as may be required by any of the subcommittees of the Gymkhana. Final adjustments of such advances should be made, by presentation of fully vouchered bills as soon as possible and, in any case, within a period of 15 days from the date of drawal of the advance. Ordinarily a second advance will not be granted to the sub-section which has not completely accounted for the first advance.\n1.5 All purchases of the Gymkhana shall be made according to the Gymkhana rule made for the purpose.\n1.6 Travelling Allowance and other miscellaneous expenditure will be governed by the rules framed by the Ex-council from time to time.\n1.7 All condonation, write-off, etc. will be done by the President, at the recommendation of an expert committee and with the approval of the Rector.\n2. BUDGET : A detailed estimate of annual receipts and expenditure pertaining to the Gymkhana under its different subsections shall be drawn up by the outgoing Executive Council well before the commencement of the Academic year to which the estimate relates. This estimate, which is to be known as the Budget Estimate shall be submitted to the Rector for his consideration and approval. No expenditure against the provisions made threin can normally be incurred unless the Budget Estimate is approved by the Rector.\n2.1 The Budget Estimates, referred to in Section 2 above shall be scrutinized after six months’ working and, if necessary, Revised Budget Estimate shall be drawn up by the Executive Council in office at the time and submitted to the Rector for his consideration and approval.\n2.2 No expenditure which is not provided for in the Budget Estimates or Revised Budget Estimates, referred to above shall be incurred nor shall the limits of expenditure as provided for therein under any head exceed without the specific approval of the Rector.\n3. ACCOUNTS : The financial year for the Gymkhana fund shall correspond to the Academic year of the Institute. All fees and contributions for he year shall be paid within the financial year.\n3.1 Drawals from the Bank account are to be made by means of cheques only. The cheques shall be signed by the President of the Gymkhana and countersigned by the Registrar.\n3.2 Two kinds of Cash Books shall be maintained by the Treasurer of the Gymkhana, viz., (a) a main cash book to account for all deposit and drawals from the Bank account and to record all items of expenditure paid by cheques and (b) a petty cash book to record drawal of the Imprest money, as referred to in para 1.3 above and all expenses incurred therefrom. c) All entries in the Cash Book shall be authenticated by the Treasurer of the Gymkhana. A monthly reconciliation shall be effected between the balance reflected in the Main Cash Book, referred to above, with the Bank Pass Book or the statement of balance furnished by the Bank.\n3.3 Proper books of account should be maintained as follows : a. Centralised Bill Register b. Appropriation Register c. Advance Register d. Investment Register e. Stock Register f. General Ledger\n3.4 The President shall present an Annual Statement of account of receipts and expenditure of the Gymkhana Fund to the Audit Board.\n4. AUDIT : The audit of the bills of the Technology Students’ Gymkhana shall be done as per the guidelines given below.\n4.1 CONCURRENT AUDIT: The concurrent audit of all bills for which cheque are being drawn shall be carried out by a Part Time Auditor. The remuneration for the Auditor will be approved by the President of the Technology Students’ Gymkhan, as per Institute norms. Observations on concurrent audit as may be made by the Auditor shall be sent to the President of the Gymkhana for necessary action.\n4.2 ANNUAL AUDIT : The Annual Audit of the Technology Students’ Gymkhana shall be carried out by an AUDIT BOARD to be constituted by the Rector on the recommendation of the President. The honorarium for the members of the Audit Board shall be as approved by the Rector on the recommendation of the President. Observations raised by the Audit Board on annual audit shall also be sent to the President of the Gymkhana for action. A statement of these observations together with a copy of the annual statement of accounts shall be placed before the Rector. 4.3 It will be the responsibility of the President of the Gymkhana to meet the Audit observations expeditiously.", "page": "Constitution"}, {"chunk_id": "e4ef33e2", "title": "ANNEXURE- II", "text": "Awards and Prizes of the Gymkhana :\n1. The Gymkhana shall make the following Individual awards annually :\na) BHANDARKAR CUP was donated in 1952 by Sri R.S.Bhandarkar who was associated with the Institute in its early years in his capacity as the Assistant Educational Advisor, Govt. of India, Eastern Region. The cup is a rolling trophy awarded annually to the Best Outgoing Allrounder who has performed with distinction, particularly in sports.\nb) SRIMATI CHANDRAMANI CUP was donated in 1971 by Prof. K.G.Chandramani of the Mechanical Engineering Department in memory of his mother Smt. Cheti Chandramani. It is a rolling trophy awarded annually to the Best Outgoing All rounder who has performed with distinction particularly in social and cultural activities.\nc) PROF.G.S SANYAL CUP was donated in 1971 by Prof G.S. Sanyal who has been associated with the institute since 1954. It will be a rolling trophy awarded annually to the Best Outgoing All-rounder who has performed with distinction particularly in social and cultural activities.\nd) ASHOKE MUKHERJEE CUP is a rolling trophy awarded annually to an outgoing student who has made outstanding voluntary contribution to the Gymkhana.\ne) ALUMNI CUP: It is a rolling trophy awarded annually to two students who have performed with distinction in Sports & Games and Social & Cultural activities throughout the year, respectively.\nf) INSTITUTE ORDER OF MERIT (Social and Cultural)\ng) HONORABLE MENTION (Social & Cultural)\nh) INSTITUTE BLUE (Sports)\ni) HONORABLE MENTION (Sports)\nj) INSTITUTE ORDER OF MERIT (Technology)\nk) HONORABLE MENTION (Technology)\n2. Technology Students’ Gymkhana shall award number of Running Trophies annually both for Sports, Technology and Social & Cultural Activities.\n3. Any student awarded punishment by the Standing Disciplinary Committee of the Institute /Examination Malpractice Prevention Committee of the institute shall not be eligible for Gymkhana awards.", "page": "Constitution"}, {"chunk_id": "9bb1c84b", "title": "References", "text": "File:Gymkhana Constitution.pdf", "page": "Constitution"}]