[{"chunk_id": "284df02f", "title": "Counselling Center", "text": "A Counselling centre has been setup in place to help students cope up with their day-to-day problems, and assist students coping with depression or stress to have a better outlook at life. It is established for the following reasons:\n• Get Unstuck - Counselling helps students discuss and understand their problems to help create different strategies.\n• Figure out problems - Counselling can help students understand the different sides of their problems.\n• Develop a more positive, hopeful outlook - To help students understand the impact tough situations have had on their feelings and develop strategies to develop a more hopeful perspective.\n• Learn more about habits that lead to problems - provide a safe space to learn more about overcoming these habits by using strategies that have been shown to help others in similar situations.\n• Regain a sense of control and pleasure in life - Seeking help from professional experienced helpers may help you feel you are helping yourself, by taking steps to improve your life and influence your life situation.\n• Discover personal strengths - To help you learn more about yourself by helping you see and understand your strengths and learning how to use those strengths to grow in other areas.\n• Succeed - Counselling can help you set goals for college and your future. It can also help you develop strategies to attain your goals.", "page": "Counselling Center"}, {"chunk_id": "99555756", "title": "Help a friend", "text": "You can help a friend by getting an appointment for them in case they exhibit any of the following behaviours:\n• A change in their behaviour\n• Sudden irritation, fearful, suspicious or restlessness.\n• A change in appetite, sleeping pattern, or signs of withdrawal.\n• Not attending tests or exams.", "page": "Counselling Center"}, {"chunk_id": "5ed8be2a", "title": "Connect", "text": "An appointment can be made in these ways:\n• via Email - [email protected]\n• via Phone - 03222 – 281175 , 03222 – 281173 , 03222 – 221174,03222 – 281108\n• Visit physically and make an appointment\nThe counselling centre is open from 10 am to 6 pm on Monday, Wednesday and Friday; and from 11 am to 7 pm on Tuesday and Thursday. It stays closed on Saturday and Sunday. You can reschedule an appointment in case you're not able to visit at the scheduled time. You can get more information on their website .", "page": "Counselling Center"}, {"chunk_id": "38e72e17", "title": "Services", "text": "• Individual Consultation\n• Crisis Intervention\n• Group Counselling\n• Psychiatrist Services", "page": "Counselling Center"}]