[{"chunk_id": "d5eef185", "title": "Courier services in the campus", "text": "There are many courier service insides the campus. One may come across the need to avail courier facilities in Kharagpur due to the weight-restraints on flights, or carry sports goods or other instance.", "page": "Courier services in the campus"}, {"chunk_id": "50e1abee", "title": "Sending package from the campus", "text": "There are following courier services in Kharagpur:\n• India Post : It is located near the sbi office, next to the main gate of IITKGP. Though they usually dont provide you with boxes to pack your stuff\n• DTDC : It is located behind HMC office. It has good fast services, provide with packing material though costlier than Indian post\n• Blue Dart : It is located near CCD, next to Baskin Robbins.\n• First Flight : It is located in Tech market. It has good cost value for sending sports goods. Be careful with the prices though, the guy who runs the shop often overquotes prices and doesn't fill them into the booking slip when you book a package.\n• DTDC - Moving and Large Goods : Situated next to Amul Ice Cream shop opposite the gate to Jnan Ghosh Stadium. This shop doesn't have a proper board and can be hard to locate, ask the people around for help. This is particularly useful when you are graduating from college and want to ship your over-sized bags / cartons of books or clothes back home. The rates are reasonable (~Rs. 25 per kg) and the staff are very helpful with packing. They will safely pack your suitcase / carton and ship it. Average time for reaching the destination is about 10 days for metro cities, and 15-20 days for towns and villages. Items are shipped on trucks.", "page": "Courier services in the campus"}, {"chunk_id": "d44266e1", "title": "Receiving packages in the campus", "text": "All the courier services deliver your package inside the campus, alternatively you can also collect it from their respective offices", "page": "Courier services in the campus"}]