[{"chunk_id": "796ce95e", "title": "Cryogenic Engineering", "text": "File:Cryogenic.jpg Cryogenic Dept\nCryogenic Engineering Centre came into being in 1976 on the recommendation of Nayudumma Committee for the advancement of cryogenics and cryogenic engineering. This is a multi disciplinary unit comprising of Physics, Mechanical Engineering, and Chemical Engineering. It was established to generate expert manpower in this niche area of science and technology through teaching and research. The Centre conducts doctoral programs besides offering M.Tech. and M.S. courses in Cryogenic Engineering. Itoffers several electives related to cryogenics at the B.Tech. level. The Centre conducts continuing educational programs at the national and international level for industry professional, other college teachers and students. Being a center of excellence, sponsored research and consultancy remain at the core of activities in the center. Major research areas pursued at the center include Superconductivity and superconducting devices, Vacuum Technology, Gas Separation and Purification, Refrigeration and Liquefaction of Gases, Cryogenic Food Processing, Natural Gas and Hydrogen Energy, Air Separation Technology, Cryogenic Process Engineering, Nitrogen Liquefiers, Cryogenic Instrumentation etc. A distinct indicator of the research activities at the Centre is the good number of publications. Besides these, research facilities and cryogen-production facilities have been substantially modernized through significant bi-nation collaboration under Indo-FRG Cooperation in Cryogenic Engineering.The Centre maintains an uninterrupted production of liquid-nitrogen and caters to the whole institute and its neighborhood.\nProf. Parthasarathi Ghosh is the current Head of the Centre. [ 1 ]", "page": "Cryogenic Engineering"}, {"chunk_id": "77d8b72b", "title": "Research Areas", "text": "• CFD of cryogenic fluid transfer systems\n• Cryogenic refrigeration\n• Cryogenic refrigeration and liquefaction\n• Cryogenic rocket propulsion\n• Cryogenic rotating equipments\n• Cryosorption Storage of Hydrogen\n• Heat Exchanges: PlateFin, Minichannel\n• Heat Transfer in Metal Foam\n• Large scale helium cryogenics\n• Low temperature processes and equipment\n• Perforated plate matrix heat exchanger\n• Solid Sorption Cooling\n• Thermoacoustics engine", "page": "Cryogenic Engineering"}, {"chunk_id": "88c24e57", "title": "Research Laboratories", "text": "• Fist (High Field Low Temperature Facility)\n• Fist (Vacuum Hot Press)\n• Ln2 Production And Distribution\n• Pg First Year Lab\n• Pg Lab Superconductivity\n• Vacuum Technology\n• Workshop", "page": "Cryogenic Engineering"}, {"chunk_id": "2f04c32a", "title": "References", "text": "↑ http://www.iitkgp.ac.in/department/CR", "page": "Cryogenic Engineering"}]