[{"chunk_id": "info_e0ee27", "title": "CS11001: Programming And Data Structure - Quick Facts", "text": "CS11001\nCourse name | Programming And Data Structure\nOffered by | Computer Science & Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n177 264 274 239 149 166 6 EX A B C D P F | 177 | 177 | 264 | 264 | 274 | 274 | 239 | 239 | 149 | 149 | 166 | 166 | 6 | 6 | EX | A | B | C | D | P | F\n177 | 177 | 264 | 264 | 274 | 274 | 239 | 239 | 149 | 149 | 166 | 166 | 6 | 6\n177\n264\n274\n239\n149\n166\n6\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "CS11001: Programming And Data Structure"}, {"chunk_id": "f5c921fc", "title": "Syllabus mentioned in ERP", "text": "Introduction to digital computers; introduction to programming â variables, assignments; expressions; input/output; conditionals and branching; iteration; functions; recursion; arrays; introduction to pointers; character strings; time and space requirements; searching and sorting; structures; introduction to data-procedure encapsulation; dynamic allocation; linked structures; introduction to data structures â stacks and queues. (A programming language like C/C++ may be used as a basis language. The same language must be used for the laboratory).", "page": "CS11001: Programming And Data Structure"}, {"chunk_id": "7e3b2e23", "title": "Concepts taught in class", "text": "It is basically equivalent to the C++ course taught in CBSE Class 11-12 with the implication that concepts related to Classes and Objects are not in C programming with some extra topics of Algorithm Analysis basics and Number Systems.\nRelative Grading\nWorksheet type papers\n2 class tests for TA marks", "page": "CS11001: Programming And Data Structure"}, {"chunk_id": "859264a0", "title": "Student Opinion", "text": "If you have studied any programming language like Java in ICSE and ISC, C++(Highest adavantage), Python and NetBeans in CBSE or anything else, then the basic concepts of programming like loops, conditionals, pointers, structures will remain the same. Only the syntactical part will change.\nIf you haven't, it is high time that you learn C programming in your vacations (Winter and Summer). The following channels may help you: https://www.youtube.com/watch?v=AWliApDc61w&list=PL2_aWCzGMAwLSqGsERZGXGkA5AfMhcknE , https://www.youtube.com/playlist?list=PLS8ACsmFCpmSZQv44y56AviLUbvyriVYh .\nThe course is high paced because it's quite natural that a 2 year course is compressed into a 40 hour lecture series.\nHowever , the question paper is not that easy (even for experienced students because of certain nitty-gritties involved). So practise as much as you can. And there is a PDS Doubt Session orgainised by SWG IIT Kharagpur. Do attend them.", "page": "CS11001: Programming And Data Structure"}, {"chunk_id": "e00c6e43", "title": "Classroom resources", "text": "The following link will lead you to past and current year slides and other resources, exam-dates, grades etc.\nhttp://cse.iitkgp.ac.in/pds/", "page": "CS11001: Programming And Data Structure"}, {"chunk_id": "4ad85195", "title": "Additional Resources", "text": "Instiinfo Repository", "page": "CS11001: Programming And Data Structure"}]