[{"chunk_id": "info_28fc5a", "title": "CS19001: Programming And Data Structure Lab. - Quick Facts", "text": "CS19001\nCourse name | Programming and Data Structure Lab.\nOffered by | Computer Science & Engineering\nCredits | 2\nL-T-P | 0-0-3\nPrevious Year Grade Distribution\n240 291 324 210 122 73 15 EX A B C D P F | 240 | 240 | 291 | 291 | 324 | 324 | 210 | 210 | 122 | 122 | 73 | 73 | 15 | 15 | EX | A | B | C | D | P | F\n240 | 240 | 291 | 291 | 324 | 324 | 210 | 210 | 122 | 122 | 73 | 73 | 15 | 15\n240\n291\n324\n210\n122\n73\n15\nEX | A | B | C | D | P | F\nSemester | {{{semester}}}", "page": "CS19001: Programming And Data Structure Lab."}, {"chunk_id": "6ae86cda", "title": "Syllabus mentioned in ERP", "text": "Suggested assignments to be conducted on a 3-hour slot. It will be conducted in tandem with the theory course so that the topics for problems given in the lab are already initiated in the theory class. The topics taught in the theory course should be appropriately sequenced for synchronization with the laboratory. A sample sequence of topics and lab classes for the topic are given below: 1.Familiarization of a computer and the environment and execution of sample programs 2.Expression evaluation 3.Conditionals and branching 4.Iteration 5.Functions 6.Recursion 7.Arrays 8.Structures 9.Linked lists 10.Data structures It is suggested that some problems related to continuous domain problems in engineering and their numerical solutions are given as laboratory assignments. It may be noted that some of basic numerical methods are taught in the Mathematics course. References 1.Brian W. Kernighan and Dennis M. Ritchie, The C Programming Language, Prentice Hall of India. 2.E. Balaguruswamy, Programming in ANSI C, Tata McGraw-Hill. 3.Byron Gottfried, Schaum s Outline of Programming with C, McGraw-Hill. 4.Seymour Lipschutz, Data Structures, Schaum s Outlines Series, Tata McGrawHill. 5.Ellis Horowitz, Satraj Sahni and Susan Anderson-Freed, Fundamentals of Data Structures in C, W. H. Freeman and Company. 6.R. G. Dromey, How to Solve it by Computer, Prentice-Hall of India. 7. http://www.facweb.iitkgp.ernet.in/~pds/notes/", "page": "CS19001: Programming And Data Structure Lab."}, {"chunk_id": "7fd3c293", "title": "Classroom resources", "text": "Instiinfo Repository", "page": "CS19001: Programming And Data Structure Lab."}]