[{"chunk_id": "info_dab085", "title": "CS21001: Discrete Structures - Quick Facts", "text": "CS21001\nCourse name | Discrete Structures\nOffered by | Computer Science & Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n15 28 22 20 15 5 EX A B C D P F | 15 | 15 | 28 | 28 | 22 | 22 | 20 | 20 | 15 | 15 | 5 | 5 | EX | A | B | C | D | P | F\n15 | 15 | 28 | 28 | 22 | 22 | 20 | 20 | 15 | 15 | 5 | 5\n15\n28\n22\n20\n15\n5\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "CS21001: Discrete Structures"}, {"chunk_id": "dcf94743", "title": "Syllabus mentioned in ERP", "text": "Propositional logic: Syntax, semantics, valid, satisfiable and unsatisfiable formulas, encoding and examining the validity of some logical arguments.Proof techniques: forward proof, proof by contradiction, contrapositive proofs, proof of necessity and sufficiency.Sets, relations and functions: Operations on sets, relations and functions, binary relations, partial ordering relations, equivalence relations, principles of mathematical induction.Size of a set: Finite and infinite sets, countable and uncountable sets, Cantos diagonal argument and the power set theorem, Schroeder-Bernstein theorem.Introduction to counting: Basic counting techniques - inclusion and exclusion, pigeon-hole principle, permutation, combination, summations. Introduction to recurrence relation and generating function.Algebraic structures and morphisms: Algebraic structures with one binary operation - semigroups, monoids and groups, congruence relation and quotient structures. Free and cyclic monoids and groups, permutation groups, substructures, normal subgroups. Algebraic structures with two binary operations - rings, integral domains and fields. Boolean algebra and Boolean ring.Introduction to graphs: Graphs and their basic properties- degree, path, cycle, subgraphs, isomorphism, Eulerian and Hamiltonian walks, graph coloring, planar graphs, trees.References1.Kenneth H. Rosen, Discrete Mathematics and its Applications, Tata McGraw-Hill.2.C. L. Liu, Elements of Discrete Mathematics, Tata McGraw-Hill.3.Norman L. Biggs, Discrete Mathematics, Oxford University Press.4.Kenneth Bogart, Clifford Stein and Robert L. Drysdale, Discrete Mathematics for Computer Science, Key College Publishing.5.Thomas Koshy, Discrete Mathematics with Applications, Elsevier.6.Ralph P. Grimaldi, Discrete and Combinatorial Mathematics, Pearson Education, Asia.", "page": "CS21001: Discrete Structures"}, {"chunk_id": "9c7f5322", "title": "How to Crack the Paper", "text": "If DRC is taking your course then don't miss out on the smaller topics like dearrangement, equivalence classes, relations. There will be more questions from these smaller topics than from major topics like pigeonhole and propositional logic.", "page": "CS21001: Discrete Structures"}, {"chunk_id": "9721087f", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NC441/444\nTuesday | NC441/444 | NC441/444\nWednesday\nThursday | NC441/444\nFriday", "page": "CS21001: Discrete Structures"}]