[{"chunk_id": "info_480fd3", "title": "CS21002: Switching Circuits And Logic Design - Quick Facts", "text": "CS21002\nCourse name | Switching Circuits And Logic Design\nOffered by | Computer Science & Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n14 24 22 28 8 11 2 EX A B C D P F | 14 | 14 | 24 | 24 | 22 | 22 | 28 | 28 | 8 | 8 | 11 | 11 | 2 | 2 | EX | A | B | C | D | P | F\n14 | 14 | 24 | 24 | 22 | 22 | 28 | 28 | 8 | 8 | 11 | 11 | 2 | 2\n14\n24\n22\n28\n8\n11\n2\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "CS21002: Switching Circuits And Logic Design"}, {"chunk_id": "264e803b", "title": "Syllabus mentioned in ERP", "text": "Switching Circuits: Logic families: TTL, nMOS, CMOS, dynamic CMOS and pass transistor logic (PTL) circuits, inverters and other logic gates, area, power and delay characteristics, concepts of fan-in, fan-out and noise margin. Switching theory: Boolean algebra, logic gates, and switching functions, truth tables and switching expressions, minimization of completely and incompletely specified switching functions, Karnaugh map and Quine-McCluskey method, multiple output minimization, representation and manipulation of functions using BDDs, two-level and multi-level logic circuit synthesis. Combinational logic circuits: Realization of Boolean functions using NAND/NOR gates, Decoders, multiplexers. logic design using ROMs, PLAs and FPGAs. Case studies. Sequential circuits: Clocks, flip-flops, latches, counters and shift registers, finite-state machine model, synthesis of synchronous sequential circuits, minimization and state assignment, asynchronous sequential circuit synthesis. ASM charts: Representation of sequential circuits using ASM charts, synthesis of output and next state functions, data path control path partition-based design.", "page": "CS21002: Switching Circuits And Logic Design"}, {"chunk_id": "715c4140", "title": "Additional Resources", "text": "Google Drive Materials", "page": "CS21002: Switching Circuits And Logic Design"}]