[{"chunk_id": "info_8eb6c1", "title": "CS29006: Software Engineering Laboratory - Quick Facts", "text": "CS29006\nCourse name | Software Engineering Laboratory\nOffered by | Computer Science & Engineering\nCredits | 2\nL-T-P | 0-0-3\nPrevious Year Grade Distribution\n13 62 21 6 2 2 4 EX A B C D P F | 13 | 13 | 62 | 62 | 21 | 21 | 6 | 6 | 2 | 2 | 2 | 2 | 4 | 4 | EX | A | B | C | D | P | F\n13 | 13 | 62 | 62 | 21 | 21 | 6 | 6 | 2 | 2 | 2 | 2 | 4 | 4\n13\n62\n21\n6\n2\n2\n4\nEX | A | B | C | D | P | F\nSemester | {{{semester}}}", "page": "CS29006: Software Engineering Laboratory"}, {"chunk_id": "6805c51f", "title": "Syllabus mentioned in ERP", "text": "Development of requirements specification, function oriented design using SA/SD, Object-oriented design using UML, test case design, implementation using Java and testing. Use of appropriate CASE tools and other tools such as configuration management tools, program analysis tools in the software life cycle. References 1.Rajib Mall, Fundamentals of Software Engineering, Prentice Hall India. 2.Pankaj Jalote, An integrated approach to Software Engineering, Springer/Narosa. 3.Roger S. Pressman, Software Engineering: A practitioner's approach, McGraw Hill. 4.Ian Sommerville, Software Engineering, Addison-Wesley.", "page": "CS29006: Software Engineering Laboratory"}, {"chunk_id": "d3382e4b", "title": "Concepts taught in class", "text": "The first half of the course, Java and OOP are taught, the second half requires students in pairs to work on a project made using software engineering concepts. The project carries at least 1/3rd weightage and usually, there is a lab test on Java Programming based on the Java concepts taught (simple but lengthy lab test). Attendance carries marks.", "page": "CS29006: Software Engineering Laboratory"}, {"chunk_id": "2fe7aff1", "title": "How to Crack the Paper", "text": "In the Java programming test, make sure to write comments in your code. You may go for an editor like VSCode which does the basic getter and setter commenting by itself. These comments carry 10-20% weightage of the class test. Make sure you are able to code basic java programming with speed, without referring to internet. Students are genrraly allwoed to access internet during the test. Make sure the UI is neatly designed, it carries a lot of weightage. Having more features, though simple is a big plus. Attend all the labs. Attendance carries marks about 20 percent.", "page": "CS29006: Software Engineering Laboratory"}]