[{"chunk_id": "info_5c58df", "title": "CS29003: Algorithms Laboratory - Quick Facts", "text": "CS29003\nCourse name | Algorithms Laboratory\nOffered by | Computer Science & Engineering\nCredits | 2\nL-T-P | 0-0-3\nPrevious Year Grade Distribution\n45 54 49 45 31 4 1 EX A B C D P F | 45 | 45 | 54 | 54 | 49 | 49 | 45 | 45 | 31 | 31 | 4 | 4 | 1 | 1 | EX | A | B | C | D | P | F\n45 | 45 | 54 | 54 | 49 | 49 | 45 | 45 | 31 | 31 | 4 | 4 | 1 | 1\n45\n54\n49\n45\n31\n4\n1\nEX | A | B | C | D | P | F\nSemester | {{{semester}}}", "page": "CS29003: Algorithms Laboratory"}, {"chunk_id": "34a64912", "title": "Syllabus mentioned in ERP", "text": "The laboratory component will emphasize two areas:Implementation of algorithms covered in class: This will involve running the algorithms under varying input sets and measuring running times, use of different data structures for the same algorithm (wherever applicable) to see its effect on time and space, comparison of different algorithms for the same problem etc.Design of Algorithms: This will involve design and implementation of algorithms for problems not covered in class but related to a topic covered in class. The exact set of algorithms to design and implement is to be decided by the instructor. In addition, there will be at least one significantly large design project involving some real world application. An efficient design of the project should require the use of multiple data structures and a combination of different algorithms/ techniques.References1.T. H. Cormen, C. L. Leiserson, R. L. Rivest, and C. Stein, Introduction to Algorithms, MIT Press.2.J. Kleinberg and E. Tardos, Algorithm Design, Addison-Wesley.3.Harry R. Lewis and Larry Denenberg, Data Structures and Their Algorithms, Harper Collins.4.A. Gibbons, Algorithmic Graph Theory, Cambridge University Press.5.Michael T. Goodrich and Roberto Tamassia, Algorithm Design: Foundations, Analysis, and Internet Examples, John Wiley.6.R. Sedgewick, Algorithms in C (Parts 1-5), Addison Wesley.7.M. H. Alsuwaiyel, Algorithm Design Techniques and Analysis, World Scientific.8.Gilles Brassard and Paul Bratley, Algorithmics : theory and practice, Prentice-Hall.9.Udi Manber, Introduction to Algorithms: A Creative Approach, Addison-Wesley.10.Sara Baase and Allen Van Gelder, Computer Algorithms: Introduction to Design and Analysis, Addison-Wesley.", "page": "CS29003: Algorithms Laboratory"}, {"chunk_id": "7209d612", "title": "Student Opinion", "text": "Every lab assignment but the first one will be graded and contribute to your total. Code data structures taught at least two times, if possible, try to solve previous year's assignments. While doing the assignment, if a part of your code doesn't work, then comment it out and submit it with the part of your code that works. TAs read the code you wrote and give you some marks accordingly. In case a part of your code fails for just one/two test cases only, submit it as it is, you may still score good marks on it, the output holds a certain weightage and you will be given marks only if it is correct, otherwise zero for that test case.", "page": "CS29003: Algorithms Laboratory"}, {"chunk_id": "8d87fb07", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday\nThursday | In Dept | In Dept | In Dept\nFriday", "page": "CS29003: Algorithms Laboratory"}]