[{"chunk_id": "info_c21806", "title": "CS31007: Computer Organization And Architecture - Quick Facts", "text": "CS31007\nCourse name | Computer Organization And Architecture\nOffered by | Computer Science & Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n5 20 24 31 4 18 5 EX A B C D P F | 5 | 5 | 20 | 20 | 24 | 24 | 31 | 31 | 4 | 4 | 18 | 18 | 5 | 5 | EX | A | B | C | D | P | F\n5 | 5 | 20 | 20 | 24 | 24 | 31 | 31 | 4 | 4 | 18 | 18 | 5 | 5\n5\n20\n24\n31\n4\n18\n5\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "CS31007: Computer Organization And Architecture"}, {"chunk_id": "30528dd3", "title": "Syllabus mentioned in ERP", "text": "Basic functional blocks of a computer: CPU, memory, input-output subsystems, control unit. Instruction set architecture of a CPU - registers, instruction execution cycle, RTL interpretation of instructions, addressing modes, instruction set. Case study - instruction sets of some common CPUs.Data representation: signed number repre-sentation, fixed and floating point representations, character representation. Computer arithmetic - integer addition and subtraction, ripple carry adder, carry look-ahead adder, etc. multiplication - shift-and-add, Booth multiplier, carry save multiplier, etc. Division - restoring and non-restoring techniques, floating point arithmetic.CPU control unit design: hardwired and micro-programmed design approaches, Case study - design of a simple hypothetical CPU.Memory system design: semiconductor memory technologies, memory organization.Peripheral devices and their characteristics: Input-output subsystems, I/O transfers program controlled, interrupt driven and DMA, privileged and non-privileged instructions, software interrupts and exceptions. Programs and processes - role of interrupts in process state transitions.Performance enhancement techniques:Pipelining: Basic concepts of pipelining, throughput and speedup, pipeline hazards.Memory organization: Memory interleaving, concept of hierarchical memory organization, cache memory, cache size vs. block size, mapping functions, replacement algorithms, write policies.", "page": "CS31007: Computer Organization And Architecture"}, {"chunk_id": "8c578b39", "title": "Additional Resources", "text": "Class Test-1\nMid sem\nEnd Sem", "page": "CS31007: Computer Organization And Architecture"}, {"chunk_id": "e998e71d", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NC232\nTuesday | NC232 | NC232\nWednesday\nThursday | NC232\nFriday", "page": "CS31007: Computer Organization And Architecture"}]