[{"chunk_id": "info_f01b14", "title": "CS40030: Multimedia Applications - Quick Facts", "text": "CS40030\nCourse name | Multimedia Applications\nOffered by | Computer Science & Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | Spring", "page": "CS40030: Multimedia Applications"}, {"chunk_id": "c9e29bf3", "title": "Syllabus mentioned in ERP", "text": "Introduction to Multimedia System: Architecture and components, Multimedia distributed processing model, Synchronization, Orchestration and Quality of Service (QOS) architecture.Audio and Speech: Data acquisition, Sampling and Quantization, Human Speech production mechanism, Digital model of speech production, Analysis and synthesis, Psycho-acoustics, low bit rate speech compression, MPEG audio compression.Images and Video: Image acquisition and representation, Composite video signal NTSC, PAL and SECAM video standards, Bilevel image compression standards: ITU (formerly CCITT) Group III and IV standards, JPEG image compression standards, MPEG video compression standards.Multimedia Communication: Fundamentals of data communication and networking, Bandwidth requirements of different media, Real time con-straints: Audio latency, Video data rate, multimedia over LAN and WAN, Multimedia conferencing.Hypermedia presentation: Authoring and Publishing, Linear and nonlinear presentation, Structuring Information, Different approaches of authoring hypermedia documents, Hyper-media data models and standards.Multimedia Information Systems: Operating system support for continuous media applications: limitations is usual OS, New OS support, Media stream protocol, file system support for continuous media, data models for multimedia and hypermedia information, content based retrieval of unstructured data.References1.Ralf Steinmetz and Klara Nahrstedt, Multimedia Systems, Springer.2.J. D. Gibson, Multimedia Communications: Directions and Innovations, Springer.3.K. Sayood, Introduction to Data Compression, Morgan-Kaufmann.4.A. Puri and T. Chen, Multimedia Systems, Standards, and Networks, Marcel Dekker.5.Iain E.G. Richardson, H.264 and MPEG-4 Video Compression, John Wiley.6.Borivoje Furht, Handbook of Multimedia Computing, CRC Press.", "page": "CS40030: Multimedia Applications"}]