[{"chunk_id": "info_f2e86c", "title": "CS40023: Advanced Computer Architecture - Quick Facts", "text": "CS40023\nCourse name | Advanced Computer Architecture\nOffered by | Computer Science & Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | Autumn", "page": "CS40023: Advanced Computer Architecture"}, {"chunk_id": "8dfb915d", "title": "Syllabus mentioned in ERP", "text": "Overview of von Neumann architecture: Instruction set architecture; The Arithmetic and Logic Unit, The Control Unit, Memory and I/O devices and their interfacing to the CPU; Measuring and reporting performance; CISC and RISC processors.Pipelining: Basic concepts of pipelining, data hazards, control hazards, and structural hazards; Techniques for overcoming or reducing the effects of various hazards.Hierarchical Memory Technology: Inclusion, Coherence and locality properties; Cache memory organizations, Techniques for reducing cache misses; Virtual memory organization, mapping and management techniques, memory replacement policies.Instruction-level parallelism: Concepts of instruction-level parallelism (ILP), Techniques for increasing ILP; Superscalar, super-pipelined and VLIW processor architectures; Vector and symbolic processors; Case studies of contemporary microprocessorsMultiprocessor Architecture: Taxonomy of parallel architectures; Centralized shared-memory architecture, synchronization, memory consistency, interconnection networks; Distributed shared-memory architecture, Cluster computers.Non von Neumann Architectures: Data flow Computers, Reduction computer architectures, Systolic Architectures.References1.John L. Hennessy and David A. Patterson, Computer Architecture: A Quantitative Approach, Morgan Kaufmann.2.John Paul Shen and Mikko H. Lipasti, Modern Processor Design: Fundamentals of Superscalar Processors, Tata McGraw-Hill.3.M. J. Flynn, Computer Architecture: Pipelined and Parallel Processor Design, Narosa Publishing House.4.Kai Hwang, Advanced Computer Architecture: Parallelism, Scalability, Programmability, McGraw-Hill.", "page": "CS40023: Advanced Computer Architecture"}]