[{"chunk_id": "info_6e5dce", "title": "CS40017: Object Oriented System Design - Quick Facts", "text": "CS40017\nCourse name | Object Oriented System Design\nOffered by | Computer Science & Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | Autumn", "page": "CS40017: Object Oriented System Design"}, {"chunk_id": "6e4db048", "title": "Syllabus mentioned in ERP", "text": "This course will cover object-oriented approach to modeling, problem solving, requirement analysis, system design, system implementation, database design, system engineering and software engineering.Fundamental concepts of object oriented programming: Introduction to the principles of object-oriented programming (classes, objects, messages, encapsulation, inheritance, polymorphism, exception handling, and object-oriented containers).Object design implementation in a programming language, e.g., C or Java.Object oriented analysis, modeling and design. UML may be introduced. Use cases, use case driven analysis.Structural modeling: classes, relationships, interfaces, class diagrams, and object diagrams, in UML.Behavioral/Functional modeling: use case diagrams, sequence diagrams, in UML.Dynamic modeling: State chartsArchitectural modelingAnalysis patterns, Design patterns.Distributed object model: CORBA and COM / DCOMObject oriented database systems: Object oriented data model, query languages, storage organization and indexing techniques; object relational databases.References1.Bertrand Meyer, Object Oriented Software Construction, Prentice-Hall.2.Grady Booch, Object Oriented Analysis and Design, AddisonWesley.3.Grady Booch, James Rumbaugh and Ivar Jacobson, Unified Modeling Language Guide, Addison-Wesley.4.Erich Gamma et al., Design Patterns: Elements of Reusable OO Software, Addison-Wesley.5.Michael L. Scott, Programming Language Pragmatics, Morgan-Kaufmann.6.Kim Bruce, Foundations of Object Oriented Languages, Prentice-Hall.7.Benjamin C. Pierce, Types and Programming Languages, Prentice-Hall.8.Bjarne Stroustrup, The Design and Evolution of C , Addison-Wesley.9.Bill Venners, Inside the JAVA 2 Virtual Machine, McGraw Hill.10.James E. Smith and Ravi Nair, Virtual Machines, Elsevier/MorganKaufmann.11.Saba Zamir, Handbook of Object Technology, CRC Press.", "page": "CS40017: Object Oriented System Design"}]