[{"chunk_id": "info_b7caed", "title": "CS43002: Database Management Systems - Quick Facts", "text": "CS43002\nCourse name | Database Management Systems\nOffered by | Computer Science & Engineering\nCredits | 5\nL-T-P | 3-0-3\nPrevious Year Grade Distribution\n16 19 26 23 9 3 3 EX A B C D P F | 16 | 16 | 19 | 19 | 26 | 26 | 23 | 23 | 9 | 9 | 3 | 3 | 3 | 3 | EX | A | B | C | D | P | F\n16 | 16 | 19 | 19 | 26 | 26 | 23 | 23 | 9 | 9 | 3 | 3 | 3 | 3\n16\n19\n26\n23\n9\n3\n3\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "CS43002: Database Management Systems"}, {"chunk_id": "046a128f", "title": "Syllabus mentioned in ERP", "text": "Database system architecture: Data Abstraction, Data Independence, Data Definition and Data Manipulation Languages.Data models: Entity-relationship, network, relational and object oriented data models, integrity constraints and data manipulation operations.Relational query languages: Relational algebra, tuple and domain relational calculus, SQL and QBE.Relational database design: Domain and data dependency, Armstrongs axioms, normal forms, dependency preservation, lossless design.Query processing and optimization: Evaluation of relational algebra expressions, query equivalence, join strategies, query optimization algorithms.Storage strategies: Indices, B-trees, hashing.Transaction processing: Recovery and concurrency control, locking and timestamp based schedulers, multiversion and optimistic Concurrency Control schemes.Advanced topics: Object-oriented and object relational databases, logical databases, web databases, distributed databases, data warehousing and data mining.Laboratory: Database schema design, database creation, SQL programming and report generation using a commercial RDBMS like ORACLE/ SYBASE/DB2/SQL-Server/INFORMIX. Stud-ents are to be exposed to front end development tools, ODBC and CORBA calls from application Programs, internet based access to databases and database administration.References1.Abraham Silberschatz, Henry Korth, and S. Sudarshan, Database System Concepts, McGrawHill.2.Raghu Ramakrishnan, Database Management Systems, WCB/McGraw-Hill.3.Bipin Desai, An Introduction to Database Systems, Galgotia.4.J. D. Ullman, Principles of Database Systems, Galgotia.5.R. Elmasri and S. Navathe, Fundamentals of Database Systems8, Addison-Wesley.6.Serge Abiteboul, Richard Hull and Victor Vianu, Foundations of Databases. Addison-Wesley.", "page": "CS43002: Database Management Systems"}, {"chunk_id": "634a7b49", "title": "Spring 2016", "text": "Taught by Prof. Pabitra Mitra and Prof. Partha P Chakrabarti This is a 5-credit course so consists of a Lab component along witht the Theory classes. The option to take this course comes first in sixth semester for Computer Science students, of which most of them enroll (96+ in a batch of 110). The lab component consists of 2 individual assignments and 2 group assignments, which are a great learning experience where you create something of potential value. The exams are relatively easy to score and given the scores, the number of Ex's and A's are not few. The exams mostly require to write boolean equations or draw decision trees. No theoritical answers. Kaustubhhiware ( talk )", "page": "CS43002: Database Management Systems"}, {"chunk_id": "069734a3", "title": "Additional Resources", "text": "Class Test - 1\nMid-Sem\nMid-Sem_solutions", "page": "CS43002: Database Management Systems"}]