[{"chunk_id": "info_a18c34", "title": "CS60094: Computational Number Theory - Quick Facts", "text": "CS60094\nCourse name | Computational Number Theory\nOffered by | Computer Science & Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n6 5 7 6 1 1 EX A B C D P F | 6 | 6 | 5 | 5 | 7 | 7 | 6 | 6 | 1 | 1 | 1 | 1 | EX | A | B | C | D | P | F\n6 | 6 | 5 | 5 | 7 | 7 | 6 | 6 | 1 | 1 | 1 | 1\n6\n5\n7\n6\n1\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "CS60094: Computational Number Theory"}, {"chunk_id": "438c6b18", "title": "Syllabus mentioned in ERP", "text": "Algorithms for integer arithmetic: Divisibility, gcd, modular arithmetic, modular exponentiation, Montgomery arithmetic, congruence, Chinese remainder theorem, Hensel lifting, orders and primitive roots, quadratic residues, integer and modular square roots, prime number theorem, continued fractions and rational approximations. Representation of finite fields: Prime and extension fields, representation of extension fields, polynomial basis, primitive elements, normal basis, optimal normal basis, irreducible polynomials. Algorithms for polynomials: Root-finding and factorization, Lenstra-LenstraLovasz algorithm, polynomials over finite fields. Elliptic curves: The elliptic curve group, elliptic curves over finite fields, Schoof s point counting algorithm. Primality testing algorithms: Fermat test, Miller-Rabin test, Solovay-Strassen test, AKS test. Integer factoring algorithms: Trial division, Pollard rho method, p-1 method, CFRAC method, quadratic sieve method, elliptic curve method. Computing discrete logarithms over finite fields: Baby-stepgiant-step method, Pollard rho method, Pohlig-Hellman method, index calculus methods, linear sieve method, Coppersmith s algorithm.", "page": "CS60094: Computational Number Theory"}, {"chunk_id": "ca0e456c", "title": "Applications", "text": "Algebraic coding theory, cryptography.", "page": "CS60094: Computational Number Theory"}, {"chunk_id": "aff72278", "title": "References", "text": "1.Victor Shoup, A Computational Introduction to Number Theory and Algebra, Cambridge University Press.\n2.Maurice Mignotte, Mathematics for Computer Algebra, Springer-Verlag.\n3.Ivan Niven, Herbert S. Zuckerman and H. L. Montgomery, An Introduction to the Theory of Numbers, John Wiley.\n4.Joachim von zur Gathen and Juergen Gerhard, Modern Computer Algebra, Cambridge University Press.\n5.Rudolf Lidl and Harald Niederreiter, Introduction to Finite Fields and their Applications, Cambridge University Press.\n6.Alfred J. Menezes, editor, Applications of Finite Fields, Kluwer Academic Publishers.\n7.Joseph H. Silverman and John Tate, Rational Points on Elliptic Curves, Springer International Edition.\n8.D. R. Hankerson, A. J. Menezes and S. A. Vanstone, Guide to Elliptic Curve Cryptography, Springer-Verlag.\n9.A. Das and C. E. Veni Madhavan, Public-key Cryptography: Theory and practice, Pearson Education Asia.\n10.Henri Cohen, A Course in Computational Algebraic Number Theory, Springer-Verlag.", "page": "CS60094: Computational Number Theory"}]