[{"chunk_id": "info_0d44a9", "title": "CS60003: High Performance In Computer Architecture - Quick Facts", "text": "CS60003\nCourse name | High Performance In Computer Architecture\nOffered by | Computer Science & Engineering\nCredits | 4\nL-T-P | 4-0-0\nPrevious Year Grade Distribution\n13 9 10 3 7 3 EX A B C D P F | 13 | 13 | 9 | 9 | 10 | 10 | 3 | 3 | 7 | 7 | 3 | 3 | EX | A | B | C | D | P | F\n13 | 13 | 9 | 9 | 10 | 10 | 3 | 3 | 7 | 7 | 3 | 3\n13\n9\n10\n3\n7\n3\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "CS60003: High Performance In Computer Architecture"}, {"chunk_id": "c677c94e", "title": "Syllabus mentioned in ERP", "text": "Introduction: review of basic computer architecture, quantitative techniques in computer design, measuring and reporting performance. CISC and RISC processors. Pipelining: Basic concepts, instruction and arithmetic pipeline, data hazards, control hazards, and structural hazards, techniques for handling hazards. Exception handling. Pipeline optimization techniques. Compiler techniques for improving performance. Hierarchical memory technology: Inclusion, Coherence and locality properties; Cache memory organizations, Techniques for reducing cache misses; Virtual memory organization, mapping and management techniques, memory replacement policies. Instruction-level parallelism: basic concepts, techniques for increasing ILP, superscalar, super-pipelined and VLIW processor architectures. Array and vector processors. Multiprocessor architecture: taxonomy of parallel architectures. Centralized shared-memory architecture: synchronization, memory consistency, interconnection networks. Distributed shared-memory architecture. Cluster computers. Non von Neumann architectures: data flow computers, reduction computer architectures, systolic architectures.References1.John L. Hennessy and David A. Patterson, Computer Architecture: A Quantitative Approach, Morgan Kaufmann.2.John Paul Shen and Mikko H. Lipasti, Modern Processor Design: Fundamentals of Superscalar Processors, Tata McGraw-Hill.3.M. J. Flynn, Computer Architecture: Pipelined and Parallel Processor Design, Narosa Publishing House.4.Kai Hwang, Advanced Computer Architecture: Parallelism, Scalability, Programmability, McGraw-Hill.", "page": "CS60003: High Performance In Computer Architecture"}]