[{"chunk_id": "info_80b5d4", "title": "CS60004 : Hardware Security - Quick Facts", "text": "CS60004\nCourse name | Hardware Security\nOffered by | Computer Science & Engineering\nCredits | 3\nL-T-P | 3-0-0\nProfessor(s) | Sarani Bhattacharya\nPrevious Year Grade Distribution\n7 8 14 8 3 EX A B C D P F | 7 | 7 | 8 | 8 | 14 | 14 | 8 | 8 | 3 | 3 | EX | A | B | C | D | P | F\n7 | 7 | 8 | 8 | 14 | 14 | 8 | 8 | 3 | 3\n7\n8\n14\n8\n3\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "CS60004 : Hardware Security"}, {"chunk_id": "05abc734", "title": "Syllabus mentioned in ERP", "text": "Overview of Different Issues of Hardware Security\nPreliminaries: Algebra of Finite Fields, Basics of the Mathematical Theory of Public Key Cryptography, Basics of Digital Design on Field-programmable Gate Array (FPGA), Classification using Support Vector Machines (SVMs)\nUseful Hardware Security Primitives: Cryptographic Hardware and their Implementation, Optimization of Cryptographic Hardware on FPGA, Physically Unclonable Functions (PUFs), PUF Implementations, PUF Quality Evaluation, Design Techniques to Increase PUF Response Quality\nSide-channel Attacks on Cryptographic Hardware: Basic Idea, Current-measurement based Side-channel Attacks (Case Study: Kocher's Attack on DES), Design Techniques to Prevent Side-channel Attacks, Improved Side-channel Attack Algorithms (Template Attack, etc.), Cache Attacks\nTestability and Verification of Cryptographic Hardware: Fault-tolerance of Cryptographic Hardware, Fault Attacks, Verification of Finite-field Arithmetic Circuits\nModern IC Design and Manufacturing Practices and Their Implications: Hardware Intellectual Property (IP) Piracy and IC Piracy, Design Techniques to Prevent IP and IC Piracy, Using PUFs to prevent Hardware Piracy, Model Building Attacks on PUFs (Case Study: SVM Modeling of Arbiter PUFs, Genetic Programming based Modeling of Ring Oscillator PUF)\nHardware Trojans: Hardware Trojan Nomenclature and Operating Modes, Countermeasures Such as Design and Manufacturing Techniques to Prevent/Detect Hardware Trojans, Logic Testing and Side-channel Analysis based Techniques for Trojan Detection, Techniques to Increase Testing Sensitivity Infrastructure Security: Impact of Hardware Security Compromise on Public Infrastructure, Defense Techniques (Case Study: Smart-Grid Security)\nNote : The actual curriculum may vary depending on the professor teaching the course.", "page": "CS60004 : Hardware Security"}, {"chunk_id": "54b4db69", "title": "Student Opinion", "text": "Attending the classes regularly will surely help. A great NPTEL playlist is available that covers most of the major topics.", "page": "CS60004 : Hardware Security"}, {"chunk_id": "dd1cd535", "title": "Spring 2023", "text": "Taught by Prof. Sarani Bhattacharya. This is a 3-credit course with no lab component. However, some additional classes were organised to give a hands-on experience. A smaller number of students are enrolled in the course majorly PG and RS with a few UG students. The grading is based on mid-semester, and end-semester examinations, along with 1 assignment (pre-midsem) and a term project (post-endsem). The exams are relatively easy to score with great focus on the fundamental concepts.", "page": "CS60004 : Hardware Security"}, {"chunk_id": "cbf2ef4d", "title": "Additional Resources", "text": "Debdeep Mukhopadhyay and Rajat Subhra Chakraborty, \"Hardware Security: Design, Threats, and Safeguards\", CRC Press", "page": "CS60004 : Hardware Security"}]