[{"chunk_id": "info_db8cf5", "title": "CS60050: Machine Learning - Quick Facts", "text": "CS60050\nCourse name | Machine Learning\nOffered by | Computer Science & Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n32 46 47 31 20 7 1 EX A B C D P F | 32 | 32 | 46 | 46 | 47 | 47 | 31 | 31 | 20 | 20 | 7 | 7 | 1 | 1 | EX | A | B | C | D | P | F\n32 | 32 | 46 | 46 | 47 | 47 | 31 | 31 | 20 | 20 | 7 | 7 | 1 | 1\n32\n46\n47\n31\n20\n7\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "CS60050: Machine Learning"}, {"chunk_id": "1a4509ab", "title": "Syllabus mentioned in ERP", "text": "The concept learning task. General-to-specific ordering of hypotheses. Version spaces. Inductive bias. Decision Tree Learning. Rule Learning: Propositional and First-Order, Over-fitting, Cross-Validation. Experimental Evaluation of Learning Algorithms Instance-Based Learning: k-Nearest neighbor algorithm, Radial basis functions. Case-based learning. Computational Learning Theory: probably approximately correct (PAC) learning. Sample complexity. Computational complexity of training. Vapnik-Chervonenkis dimension. Artificial Neural Networks: Linear threshold units, Perceptrons, Multilayer networks and backpropagation, recurrent networks. Probabilistic Machine Learning Maximum Likelihood Estimation, MAP, Bayes Classifiers Naive Bayes. Bayes optimal classifiers. Minimum description length principle. Bayesian Networks, Inference in Bayesian Networks, Bayes Net Structure Learning Unlabelled data: EM, preventing overfitting, cotraining Gaussian Mixture Models, K-means and Hierarchical Clustering, Clustering and Unsupervised Learning, Hidden Markov Models, Reinforcement Learning Support Vector Machines Ensemble learning: boosting, bagging.", "page": "CS60050: Machine Learning"}, {"chunk_id": "4d1a1406", "title": "Additional Resources", "text": "Mid-sem\nMid-sem_solutions", "page": "CS60050: Machine Learning"}, {"chunk_id": "fb6dc74d", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | NC244\nThursday | NC244\nFriday | NC244", "page": "CS60050: Machine Learning"}]