[{"chunk_id": "info_dbfb5f", "title": "CY11001: Chemistry - Quick Facts", "text": "CY11001\nCourse name | Chemistry\nOffered by | Chemistry\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n132 258 309 229 166 150 32 EX A B C D P F | 132 | 132 | 258 | 258 | 309 | 309 | 229 | 229 | 166 | 166 | 150 | 150 | 32 | 32 | EX | A | B | C | D | P | F\n132 | 132 | 258 | 258 | 309 | 309 | 229 | 229 | 166 | 166 | 150 | 150 | 32 | 32\n132\n258\n309\n229\n166\n150\n32\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "CY11001: Chemistry"}, {"chunk_id": "63a206ae", "title": "Syllabus mentioned in ERP", "text": "Prerequisites: None Course Contents Theory Component: Thermodynamics of Chemical Processes: Concept of entropy, Chemical potential, Equilibrium conditions for closed systems, Phase and reaction equilibria, Maxwell relations, Real gas and real solution. Electrochemical Systems: Electrochemical cells and EMF, Applications of EMF measurements: Thermodynamic data, activity coefficients, solubility product and pH, corrosion. Kinetics of Chemical Reactions: Reversible, consecutive and parallel reactions, Steady state approximation, Chain reactions, Photochemical kinetics. Bonding Models in Inorganic Chemistry: Molecular orbital theory, Valence-bond theory, Crystal field theory. Fundamentals of Microwave, IR and UV-VIS Spectroscopy: Basic concepts of spectroscopy, Selection rule, Determination of molecular structure. Coordination Chemistry: Coordination numbers, Chelate effect, Coordination complexes and application, Bio-inorganic chemistry: Metal ions in Biological systems, environmental aspects of Metals, NOx, CO, CO2. Organic Reaction Mechanism: Mechanisms of selected organic, bio-organic, polymerization and catalytic reactions. Stereochemistry of Carbon Compounds: Selected Organic Compounds: Natural products and Biomolecules (Amino acids/nucleic acids/proteins). Laboratory Component: Suggested Experiments : 1.Surface tension and parachor 2.Measurement of the coefficient of viscosity : CMC of a surfactant 3.Conductometric titration 4.pH-metric/potentiometric titration 5.Solubility product 6.Kinetics of ester hydrolysis 7.Estimation of Fe2+ 8.EDTA titration 9.Estimation of base content and acid content of commercially available antacid and vitamin C respectively 10.Synthesis of Mohr’s salt 11.Synthesis of aspirin 12.Demonstration of a few important physico-chemical processes. (e.g. Gel electrophoresis, Oscillatory reactions)", "page": "CY11001: Chemistry"}, {"chunk_id": "59d345b7", "title": "Concepts taught in class", "text": "The course is divided into 3 parts: Physical, Inorganic,Organic. Physical chemistry is taught before midsem and doesnt come in the endsem exam. The rest 2 comes in endsem.\nRelative grading.\nAs per session 2017-18:", "page": "CY11001: Chemistry"}, {"chunk_id": "c88569fb", "title": "Physical Chemistry Syllabus:", "text": "1. Thermodynamics 2. Electrochemistry (may be excluded depending upon time left; excluded in Spring Sem) 3. Kinetics (may be excluded depending upon time left; excluded in this entire session)", "page": "CY11001: Chemistry"}, {"chunk_id": "4cc3e6d9", "title": "Inorganic Chemistry Syllabus:", "text": "1. Atomic Orbitals and Molecular Orbital Theory 2. Coordination Complexes: Crystal Field Theory and Ligands 3. Chelate effect 4. Redox Reactions 5. Organometallics", "page": "CY11001: Chemistry"}, {"chunk_id": "3e06ee69", "title": "Organic Chemistry Syllabus:", "text": "1. Stereochemistry 2. Conformational Chemistry 3. Pericyclic Reactions 4. Nucleophilic Substitution of saturated C (SN1, SN2) , Elimination (E1,E2, E1CB)", "page": "CY11001: Chemistry"}, {"chunk_id": "b6e7211a", "title": "Student Opinion", "text": "BOOKLET TYPE QUESTION CUM ANSWER SCRIPT: Enough space is provided so don't be worried except if you have the habit of cutting the entire answer and doing it again and again.\nMajority of the course content is quite simple as it has been covered in IITJEE syllabus. Some topics and modules are completely new. However the approach is quite different from JEE and looks at the subject in a very different perspective. The basic and complete syllabus is defined by the slides provided by the Profs and is your main study materials. Do attend classes if attendance is taken especially Organic and Inorganic because the questions asked in exams are quite different and requires the skills and concepts taught in class.\nPrevious years practice papers are a must as questions are repeated quite often but don't expect anything about the paper as it might turn the other way round which had happened in Autumn Sem where quite lengthy and involving numericals were asked which required application of multiple formulae and concepts. No theory based descriptive questions are asked except 1-2 from Inorganic section.\nOnline and offline class tests will be taken: 6 marks Physical, 7+7 marks for Inorganic and Organic.\nMust attend tutorials of Organic (you will realise the reason quite soon :) )", "page": "CY11001: Chemistry"}, {"chunk_id": "d3e86f83", "title": "Additional Resources", "text": "Instiinfo Repository", "page": "CY11001: Chemistry"}]