[{"chunk_id": "info_c1b9dd", "title": "CY20103: Organic Chemistry I - Quick Facts", "text": "CY20103\nCourse name | Organic Chemistry I\nOffered by | Chemistry\nCredits | 2\nL-T-P | 2-0-0\nPrevious Year Grade Distribution\n11 4 5 EX A B C D P F | 11 | 11 | 4 | 4 | 5 | 5 | EX | A | B | C | D | P | F\n11 | 11 | 4 | 4 | 5 | 5\n11\n4\n5\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "CY20103: Organic Chemistry I"}, {"chunk_id": "1acf7b39", "title": "Syllabus mentioned in ERP", "text": "Prerequisite : CY11001 Brief discussion on the strengths of organic acids and bases. Electrophilic & Nucleophilic substitution reactions in aromatic systems: Electrophilic attack on benzene and C6H5Y-nitration, halogenation, sulphonation, Friedel Crafts reactions, Electronic effect of Y, Kinetic vs. thermodynamic control, important reactions of phenols, aromatic amino compounds and naphthalene. Nucleophilic attack on aromatic species: substitution of hydrogen, substitution of atoms other than hydrogen, substitution via aryne intermediates. Synthesis and reaction of heteroaromatic compounds- furan, pyrrole, thiophen and pyridine. Electrophilic and nucleophilic addition reaction to C=C: Electrophilic addition reactions via halonium & carbocation intermediate, hydroboration, regio- & stereochemistry, Oxidation reactions- hydroxylation, ozonolysis, electrophilic addition to conjugated dienes, Elimination reaction: 1,2-elimination via E1, E1cB, E2 mechanism, stereoselectivity in E2 reaction, Saytzeff vs. Hoffmann elimination, elimination vs. substitution, other 1,2-elimination, 1,1-elimination, pyrolytic syn-elimination. Books: A Guidebook to Mechanism in Organic Chemistry by Peter Sykes Organic Chemistry, Vol. 1 by I. L. Finar", "page": "CY20103: Organic Chemistry I"}, {"chunk_id": "d8eb39a0", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday | C205 | C205\nWednesday\nThursday\nFriday", "page": "CY20103: Organic Chemistry I"}]