[{"chunk_id": "info_481b04", "title": "CY41014: Principles Of Organometallics And Bioinorgnic Chemistry - Quick Facts", "text": "CY41014\nCourse name | Principles Of Organometallics And Bioinorgnic Chemistry\nOffered by | Chemistry\nCredits | 4\nL-T-P | 4-0-0\nPrevious Year Grade Distribution\n4 15 14 8 4 5 1 EX A B C D P F | 4 | 4 | 15 | 15 | 14 | 14 | 8 | 8 | 4 | 4 | 5 | 5 | 1 | 1 | EX | A | B | C | D | P | F\n4 | 4 | 15 | 15 | 14 | 14 | 8 | 8 | 4 | 4 | 5 | 5 | 1 | 1\n4\n15\n14\n8\n4\n5\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "CY41014: Principles Of Organometallics And Bioinorgnic Chemistry"}, {"chunk_id": "f7f30216", "title": "Syllabus mentioned in ERP", "text": "CY40110 Principles of Organometallic and Bioinorganic Chemistry (4-0-0 : 4 credits) Prerequisite : CY40101 Organometallic chemistry: Bonding models in sigma and pi-complexes. 18-electron formalism and isolobal principle. Basic concepts guiding the synthesis and stability of Li, Mg, B, Si organometallic compounds. Wades/Mingos/Jemmis rule. Basic concepts guiding the synthesis and stability of transition metal alkyls, carbonyls, alkenes, alkynes, arenes, allyls, carbenes, and metallocenes. Basic organometallic reactions: oxidative-addition, reductive elimination, transmetallation, insertion, nucleophilic attach on coordinated ligand. Typical examples of fluxional organometallics. Bioinorganic Chemistry: The biochemistry of iron and copper: Dioxygen binding, transport and utilization in hemoglobin, hemocyanin and hemerythrin. Biological and synthetic dioxygen carriers. Metal-sulfide proteins: Ferredoxin and nitrogenases. Metalloporphyrins and Respiration: Cytochromes. Electron transfer reactions. Metalloenzymes: Carbonic anhydrase, carboxypeptidase and vitamin B12. Books: Inorganic Chemistry by J.E. Huheey The Organometallic Chemistry of The Transition Metals, by R.H. Crabtree Principles & Applications of Organo-transition Metal Chemistry, by J.P. Collman, L.S. Hegedus, J.R. Norton, R.G. Finke Bioinorganic Chemistry by Lippard, and Bartini", "page": "CY41014: Principles Of Organometallics And Bioinorgnic Chemistry"}]