[{"chunk_id": "info_4bf4cf", "title": "CY41016: Analytical And Environmental Chemistry - Quick Facts", "text": "CY41016\nCourse name | Analytical And Environmental Chemistry\nOffered by | Chemistry\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n5 17 21 15 6 3 EX A B C D P F | 5 | 5 | 17 | 17 | 21 | 21 | 15 | 15 | 6 | 6 | 3 | 3 | EX | A | B | C | D | P | F\n5 | 5 | 17 | 17 | 21 | 21 | 15 | 15 | 6 | 6 | 3 | 3\n5\n17\n21\n15\n6\n3\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "CY41016: Analytical And Environmental Chemistry"}, {"chunk_id": "41a960c2", "title": "Syllabus mentioned in ERP", "text": "Introductory Topics: Development of Analytical Chemistry, Analytical Terms, Precision and Accuracy, Figures of Merit. Measurement Fundamentals: Signal-to-Noise Ratio, Origin of Instrument Noise, Quantifying Measurements and Extracting Information. Atomic Spectroscopy: Principles, Flame Emission Spectroscopy, Atomic Absorption Spectroscopy, X-Ray Fluorescence. Introduction to Chromatographic Separations: Classification, Chromatographic Parameters, Resolution, Band Broadening. Liquid Chromatography: HPLC Instrumentation, Adsorption Chromatography, Partition Chromatography, Other Types of Liquid Chromatography. Gas Chromatography: Basic Description, Classification of GC Methods, Stationary Phase, Carrier Gas, Detectors, Temperature Programming. Thermal & surface techniques: TG, DTA/DSC, Auger, XPS, SEM/TEM Analysis of Water, Air, and Soil: Significance of various parameters. Environmental sampling. Current trends in the analysis of metal ions and organic pollutants in water, air and soil. Laws, and standards on environmental pollution, and abatement. Book: Skoog and Leary, \"Principles of Instrumental Analysis\"; Skoog, West, and Holler, “Analytical Chemistry an Introduction”; Bailey, Clark, Ferris, Krause, and Strong, “Chemistry of Environment”;Research and review articles.", "page": "CY41016: Analytical And Environmental Chemistry"}]