[{"chunk_id": "info_adef9c", "title": "CY49008: Advanced Physical Chemistry Lab. - Quick Facts", "text": "CY49008\nCourse name | Advanced Physical Chemistry Lab.\nOffered by | Chemistry\nCredits | 4\nL-T-P | 0-0-6\nPrevious Year Grade Distribution\n17 18 3 EX A B C D P F | 17 | 17 | 18 | 18 | 3 | 3 | EX | A | B | C | D | P | F\n17 | 17 | 18 | 18 | 3 | 3\n17\n18\n3\nEX | A | B | C | D | P | F\nSemester | {{{semester}}}", "page": "CY49008: Advanced Physical Chemistry Lab."}, {"chunk_id": "02657516", "title": "Syllabus mentioned in ERP", "text": "Prerequisite:Nil Charge transfer complex formation between anthracene and picric acid, To study the formation of charge transfer complex between 1,2,4,5 Tetramethylbenzene and Tetracyano ethylene in various solvents, Study of a oscillatory reaction by EMF and absorbance measurement, To study the mutarotation of D-Glucose at different pH, Determination of partition coefficient of iodine between water and CCl4 / Equilibrium constant for tri-iodide formation;To study the fluorescence quenching of Anthracene by CCl4 in n-hexane and ethanol, Determination of Critical micellar concentration of Sodium Docecyl Sulphate (SDS) in water and in presence of salt by surface tension, conductance and stokes shift method, Comparative study of Twisted Intramolecular Charge Transfer (TICT) of 4-N, NDimethylamineobenzoinitrile (DMABN) in different solvent by Fluorescence Spectroscopy, Determination of activation energy and entropy of activation for acid catalyzed ester hydrolysis, Swelling studies of polyelectrolyte gels in medium of different pH, Synthesis and characterization of copolymer(s) of styrene and methylmethacrylate by radical polymerization, Determination of activation energy in the bromide-bromate clock reaction, Kinetics of salt effect and ionic strength (persulfate-iodine reaction), Spectroscopic determination of the size of CdS-nanoparticles; Determination of unit cell dimensions and density of some binary compounds of cubic systems by X Ray diffraction; Determination of percent crystallinity, crystalline melting point, and enthalpy of melting of a crystalline polymer by combined X- Ray diffraction - differential scanning calorimetry; determination of order of reaction and activation energy of the solid-state decomposition of CaCO3 by thermogravimetry, determination of pKa of phenol in the excited state using spectroscopic method.", "page": "CY49008: Advanced Physical Chemistry Lab."}]