[{"chunk_id": "info_b1d258", "title": "CY61046: Physical Methods In Inorganic Chemistry - Quick Facts", "text": "CY61046\nCourse name | Physical Methods In Inorganic Chemistry\nOffered by | Chemistry\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | Spring", "page": "CY61046: Physical Methods In Inorganic Chemistry"}, {"chunk_id": "c44854cb", "title": "Syllabus mentioned in ERP", "text": "Prerequisite : NilInfrared and Raman SpectroscopyReview of basics, applications of IR and Raman in inorganic systems â metal coordinated sulphate, dioxygen, carboxylate, aminoacids, perchlorates, nitrites, nitrates, thiocyanate and isocyanate. Mass Spectrometry: Principles and presentation of spectra â molecular fragmentation â ion reactions â Inorganic applications.NMR SpectroscopyReview of basics, applications of multinuclear nmr in inorganic compounds â Examples from 1H, 11B, 13C, 19F, 31P, 51V, 77Se, 95Mo, 119Sn, 199Pt. Study of fluxional behavior of molecules â an elementary treatment of second order spectra â examples â NMR of paramagnetic molecules â Lanthanide shift reagentsMagnetic propertiesMagnetic moments and their applications to the elucidation of the structures of inorganic compounds â temperature independent paramagnetism. Magnetic properties of lanthanides and actinides. Spin crossover in coordination compounds.EPR spectroscopyTheory of EPR spectroscopy - Spin densities and McConnell relationship âApplications of ESR to some simple systems such as CH3, p-benzosemiquinone, Xe 2 -Factors affecting the magnitude of g and A in metal species - Zero field splitting and Kramers degeneracy â Spectra of VO(II), Mn(II), Fe(II), Co(II), Ni(II) and Cu(II) complexes â Applications of EPR to a few biological molecules containing Cu(II) and Fe(III) ions.Mossbauer SpectroscopyIsomer shifts â Magnetic interactions â Mossbauer emission spectroscopy âapplications to iron and tin compounds.Textbooks and Reference Books1. R.S. Drago, âPhysical Methods in Inorganic Chemistryâ, 3rd Ed., Wiley EasternCompany.2. F.A. Cotton and G.Wilkinson, âAdvanced Inorganic Chemistryâ, 3rd ed., Wiley-Eastern Company, New Delhi 1990.4. Lewis and Wilkins, âModern Coordination Chemistryâ.5. E.A.V.Ebsworth, âStructural Methods in Inorganic Chemistryâ, 3rd ed., ELBS, Great Britain, 1987.", "page": "CY61046: Physical Methods In Inorganic Chemistry"}]