[{"chunk_id": "info_503ae9", "title": "Data Analytics (GC) - Quick Facts", "text": "Data Analytics (GC)\nGC Type | Technology\nCup | Strategy Cup\nEvent Type | Team\nPoints | 50", "page": "Data Analytics (GC)"}, {"chunk_id": "e8c0ff43", "title": "Data Analytics (GC)", "text": "In the Data Analytics General Championship event each participating hall has to analyze a given data set to solve the corresponding problem statement. Data Analytics as a GC event was started in 2014. Participating halls have to submit their results and a report within the deadline, which is usually ten days after the day on which problem statement is given.", "page": "Data Analytics (GC)"}, {"chunk_id": "fca65871", "title": "2015-2016", "text": "This edition of the Data Analytics General Championship saw a lot of controversy.\nThe first problem statement was released on 10th January 2016. The problem statement came from a company called Abzooba and had three sub-parts. The first one was to create a recommender system from a data of search query by a user on an e-commerce, the resulting product shown and the feedback given by the user. The second problem statement was to rank a set of documents based on a search query. The third was a link to a problem on Kaggle, which had already been closed and its solutions were available. The first problem came with a small dataset of 81 entries and there was no data given for the second one. The sub committee meeting unanimously decided to scrape the third problem statement. Since getting people to do grunt work is not a hard task some halls pointed out that the first and second problem statement can be solved by manually ranking document and giving the feedback on the queries. The committee decided to have a Skype meeting with the problems setters and simultaneously pursue other companies for additional problem statements. The VoIP meeting never happened and there was some confusion regarding fact if the sub problem statement one has been scrapped. The next subcommittee meeting, after a long debate decided to scrape both the remaining problem statements. After this, Gymkhana representatives contacted the next company on the priority list ‘Absolute Data’ with some guidelines decided by all the halls to avoid the complications in the Problem Statement but due to large no. of guidelines, company was not able to give the Problem Statement in required time scale. Meanwhile, Gymkhana told that they already had a Problem Statement from Abzooba which came for Open IIT and it was closed till now. Then after waiting for 3 days, on 18th January all halls decided to release the Problem Statement from Abzooba. This time problem statement (Predicting Demographic Information of a Facebook User with Specified Degree of Uncertainty) was very good but again the only problem was no data. Each hall sent some queries regarding problem statement and we got the reply this time but it was too vague to work on. The company refused to sent any data. Again, all halls agreed to scrap the problem statement.\nThe next problem statement came from a company called Quanta, it was expected that Quanta will give a \"good\" problem statement because it was the problem setter for the event of 2014-2015. The problem statement was to rate the vendors of Flipkart or Amazon. In further clarifications the company clarified that they have no data, no judging criteria, no testing data or accuracy criteria. They said the submissions will be judged only on the \"soundness\" of the model given in the submitted report.", "page": "Data Analytics (GC)"}, {"chunk_id": "2aff55a8", "title": "2014-2015: Electricity Theft Detection", "text": "The problem statement for 2014 was to detect possible fraudulent customers given the data collected by a power distribution company. The given data included:\n• Usage Data: The billing details having the monthly usage in units and the bill generated for each consumer.\n• Technical Data: Information about different types of transformers and the meters.\n• Hourly Load Data: information on hour-wise load data on the meters and metrics like transformer ratio and meter factor.\n• Customer Data: Information on the consumers’ address, the transformer and meter details he is connected to. It also gives an idea of the sanctioned load on his meter. A few indicators of customer profile are also provided.\n• Complaint Data: The complaint details provided information on complaints filed by consumers. It contained the date of the complaint, the reason for the complaint, and the consumer who came up with the complaint.\n• Customer Payment Data: Information on the payment dates and payment amounts for customers. It also provided information about the reason/type of payment and the mode of payment.\n• Vigilance Data: It provided information on the vigilance carried out every month. It contained details about the customer, meter type and the type of theft the violators have resorted to.", "page": "Data Analytics (GC)"}, {"chunk_id": "228e92c8", "title": "2015-2016 [ 1 ]", "text": "Position | Team | Name(s)\nGold | Chi-Square Analytics | Utkarsh Bajpai, Vinayak Bajaj, Ashish Yadav, Shyam Swaroop, Harsh Khetan, Ramakrishna Ratnam, Vedant Jambhulkar, Mahendra Kumar, Aditya Harbhajanka, Anil Jangid,\nSilver | Data Sapiens | Abhishek Sultania, Kanishak Goyal, Kartikeya Verma, Aquib Jawed, Naman Mitruka, Anjay Kumar,\nBronze | Forecasters | Anuj Gopal, Anurag Chandrakar, Ashwini Navsagre, Swati Saini", "page": "Data Analytics (GC)"}, {"chunk_id": "42e80bb6", "title": "2014-2015 [ 2 ]", "text": "Position | Name(s)\nGold | Purella Vivek Aditya (CS '15)\nSilver | Adithya Chowdary Boppana, Vamsi Mohan, Vinay Kumar Bollam, Pathri Lenin Kumar\nBronze | Bijay Kumar Soren (IM '17), Saurav Sahu (EE '15) , Nikunj Sharma (EE '14), Abhinav Agarwalla (MA '18)", "page": "Data Analytics (GC)"}, {"chunk_id": "de1f24fc", "title": "References", "text": "↑ \"Open IIT Data Analytics 2015 results post by Tech IIT KGP\" . Retrieved 22 October 2015 . ↑ \"Result post by Gymkhana Page\" . Retrieved 22 October 2015 .", "page": "Data Analytics (GC)"}]