[{"chunk_id": "43b9ad82", "title": "Department of Mechanical Engennering", "text": "The Department of Mechanical Engeneering, IIT Kharagpur, right from the inception in 1951 has been offering undergraduate and advanced studies in the three broad fields of applied mechanics and engineering design, thermal sciences and energy systems, and manufacturing processes and systems. The current areas include Bond graph and Computer Aided Design techniques, Computer Aided Manufacturing, Flexible Manufacturing Systems and Robotics, Intelligent Machines and Systems, Solid Modelling and Computer Graphics, Application of Neural Networks, Systems Dynamic Simulation, Precision Engineering Heating Ventilation and Air Conditioning systems, Combustion Modelling and Jet Impingement Heat Transfer. The sponsored projects include developing Monodispersable Aerosols, Building Automation, Machining of Advanced Materials, Environmental Friendly Grinding of Titanium Alloys using Cryogenic Cooling, Development of Industrial Robots, Laser Material Processing Technology, Developing Software or Dynamic Analysis and Condition Monitoring of Rotor etc.", "page": "Department of Mechanical Engennering"}, {"chunk_id": "18cf79ea", "title": "Courses offered in Mechanical Engineering", "text": "• B.Tech.- Mechanical Engg.\n• B.Tech.- Manufacturing Science & Engg.\n• Dual Degree - Mechanical Engg. / Manufacturing Science and Engg.\n• Dual Degree - Mechanical Engg. / Thermal Science and Engg.\n• Dual Degree - Mechanical Engg. / Mechanical Systems Design\n• Dual Degree - Mechanical Engg. / Mechanical Systems, Dynamics & Control\n• Dual Degree - Manufacturing Sc. & Engg./ Industrial Engg. & Management\n• Dual Degree - Mechanical Engg. / MBA\n• Dual Degree - Manufacturing Sc. & Engg./ MBA\n• M. Tech. - Manufacturing Science & Engg.\n• M. Tech. - Thermal Science and Engg.\n• M. Tech. - Mechanical Systems Design\n• M. Tech. - Mechanical Systems Dynamics & Control.", "page": "Department of Mechanical Engennering"}]