[{"chunk_id": "c0e05bb7", "title": "Department change", "text": "IIT Kharagpur allows a limited number of undergraduate students to change their department at the end of their first academic year. This is done on the basis of a student's CGPA after 2 semesters. There are various limitations and regulations around department changes. For example, no department can exceed its normal capacity by more than 10%. For a thorough understanding, please read the complete regulations. [ 1 ]", "page": "Department change"}, {"chunk_id": "c0919737", "title": "Yearly statistics", "text": "You can refer to Awaaz 's coverage for Department change.", "page": "Department change"}, {"chunk_id": "701eceed", "title": "July, 2014", "text": "This is the department-wise cut-off for the students who joined the institute in 2013. [ 2 ]", "page": "Department change"}, {"chunk_id": "e6d1163d", "title": "July, 2015", "text": "This is the department-wise cut-off for the students who joined the institute in 2014. [ 3 ]\nHere is a list of students who were alloted branch change.", "page": "Department change"}, {"chunk_id": "2eabc50c", "title": "July 2016", "text": "Here is a list of students who were alloted branch change.", "page": "Department change"}, {"chunk_id": "8e5c3ba4", "title": "July 2020", "text": "Here is a list of students who were allotted branch change during the academic year 2019-2020.", "page": "Department change"}, {"chunk_id": "4cf3cca7", "title": "Rules", "text": "For more information about various students' subjective experiences and advice about a department change, please read the discussion page .\n• A student admitted to a particular branch of the B.Tech. (Hons.), B.Arch. (Hons.)** or Integrated M.Sc. Course will normally continue studying in that branch till completion.\n• However, in special cases the Institute may permit a student, admitted through JEE, to change from one branch of studies to another after the first two semesters. Such changes will be permitted, strictly in accordance with the provisions laid down here in after.\n• No student of B. Arch. (Hons.) course is allowed to change his/her branch of study and at the same time no student from other branches of study is allowed to take up B. Arch. (Hons.) course.\n• Only those students will be eligible for consideration for a change of branch after the Second (Spring) Semester, who have – Completed all the credits prescribed in the first two semesters of their studies, in their first attempt, without having had to pass any course requirement in the supplementary examination and/or summer quarter. Obtained a CGPA not lower than 8.5 , at the end of the Second (Spring) Semester.\n• Application for a change of branch must be made by intending eligible students in the form prescribed for this purpose. The Deputy Registrar (Academic) will call for application sometime in the Spring Semester of each academic year and the completed forms must be submitted to him by the last date specified in his notification. Students admitted to 4-Year B.Tech. and 5-Year Integrated M.Sc. are eligible for consideration for a change of branch to any Engineering (4-Year or 5- Year Dual Degree) or a Science course. Students admitted to a 5-Year Dual Degree Programme are eligible for a change to another 5- Year Dual Degree Programme only.\n• Students may enlist up to ten choices of branch, in order of preference, to which they wish to change over. It will not be permissible to alter the choices after the application has been submitted.\n• Change of branch shall be made strictly on the basis of inter se merit of the applicants. For this purpose the CGPA obtained at the end of the Second (Spring Semester shall be considered. Ties will be broken by the JEE rank of the applicants. In making the change of branch, those applicants shall be first considered who have secured a rank within top 1% (one percent), rounded to the nearest integer, amongst all the first year students in terms of the CGPA scored at the end of the Second (Spring) Semester. Change of branch requested for by such applicants shall be made without any constraint. The remaining applicants may be allowed a change of branch, strictly in order of inter se merit, subject to the limitation that the actual number of students in the Third (Autumn) Semester, in the branch to which the transfer is to be made, does not exceed 110% of the sanctioned yearly intake for that branch, and at the same time a maximum 10% of students registered in a programme can go out from the programme due to branch change (rule related to the outflow of students from one department was rested in 2016). Note: The sanctioned yearly intake of a particular branch shall be the number sanctioned by the senate as the intake for that branch for the particular year of entry of the applicants. To compute the total number of students in the first year sum of the sanctioned yearly intake of all the branches will be taken. For the purpose of calculating the actual number of students in a particular branch, the number of students joining the branch under Clause 9(a) is to be included.\n• All changes of a branch made in accordance with the above rules will be effective from the Third (Autumn) Semester of the applicants concerned. No changes of branch shall be permitted hereafter.\n• All changes of branch will be final and binding on the applicants. No student will be permitted, under any circumstances, to refuse the change of branch offered.\n• Not withstanding the provisions of foregoing paragraphs, the senate may under very special circumstances, permit the transfer of a student from one branch to another in deviation of the above-mentioned rules. In each such case the special reasons for which the transfer is permitted must be recorded in the senate resolution. Such transfers, if any, will be over and above the regular transfers, and their number will not be counted in the computation of ‘Actual Number of Students’ in a given branch.", "page": "Department change"}, {"chunk_id": "7879878f", "title": "References", "text": "↑ \"UG Regulations March 2010\" (PDF) . IIT Kharagpur. pp. 3, 13, 14 . Retrieved Jan 31, 2012 . ↑ \"DepC list for 2014\" . Awaaz, IIT Kharagpur. ↑ \"DepC list for 2015\" . Awaaz, IIT Kharagpur.", "page": "Department change"}]