[{"chunk_id": "f3a3cdb8", "title": "Department of Rajendra Mishra School of Engineering Entrepreneurship", "text": "RMSoEE founded at Indian Institute of Technology (IIT) Kharagpur in the year 2010 aims to encourage entrepreneurial minds of the engineering students. It is a first school of its kind in India. The School imparts strong entrepreneurial culture and ecosystem for venture creation and early start-ups with an effort to integrate the practice and academic aspects of entrepreneurship in IIT Kharagpur. it is Supporting for world class research facilities and continues in hand learning system that build a self-motivated energetic young entrepreneur through connecting, enabling, and inspiring IIT Kharagpur students and alumni to create and scale innovative new ventures. It is opening opportunities to explore individual capability as an entrepreneur faculty, students, alumni, practitioners, and investors. The school offers 5-year integrated dual degree program with M. Tech in Engineering Entrepreneurship and B. Tech in an Engineering discipline. The B. Tech or Dual Degree M. Tech students of engineering departments opt for this program from their second year of study. They continue their B. Tech in their parent department while taking courses in entrepreneurship. Finally they earn their entrepreneurship specialization in their fifth year. The school is also offering Micro-specialization for all department students with four subjects from a basket of 11 subjects of different flavors. Spearheaded by a number of fellows from IIMs and doctorates from IITs amongst its faculty, the School runs a vibrant Doctoral/MS Program aimed to bridge the intellectual gaps in the relevant interdisciplinary studies related to innovation and entrepreneurship literature. It enriches the value of knowledge in the domain of management, technology intervention and transfer, and overall ecosystem development for innovation and entrepreneurship.\nProf. Partha Pratim Das is the current Head of the School . [ 1 ]", "page": "Department of Rajendra Mishra School of Engineering Entrepreneurship"}, {"chunk_id": "83126294", "title": "Research Areas", "text": "• Entrepreneurship\n• Health Care Management\n• Pesticidal bio-efficacy\n• Phytochemicals, Bio pesticides\n• Rural Technology Development", "page": "Department of Rajendra Mishra School of Engineering Entrepreneurship"}, {"chunk_id": "6c51c2f3", "title": "References", "text": "↑ http://www.iitkgp.ac.in/department/RJ", "page": "Department of Rajendra Mishra School of Engineering Entrepreneurship"}]