[{"chunk_id": "eacb64b6", "title": "Department of Metallurgical and Materials Engineering", "text": "The Department of Metallurgy And Material Sciences had its inception in 1956. Over the years, the department has developed excellent expertise in the areas of Extractive and Physical Metallurgy, Manufacturing Processes, Mechanical Behaviour of Materials, Nano-Science and Technology, Modelling and Simulation, Surface Engineering, Powder Metallurgy and Environmental Degradation of Materials. One of the very important dimensions of this department is its well equipped laboratory with sophisticated machines like High Resolution X-ray Diffractometers, Thermal Analyzers, Particle Size Analyzers, Digital Hardness Testers, Nano-indenter, Atomic Force Microscope, Universal Testing Machine, High-Temperature Tensile and Compressive Creep Testing Machines, Rotating Bending Fatigue Testing Machine, Vacuum Induction Melting Furnace, High Energy Ball Mills, Plasma Ion Implanter, Erosion Rig, Potentiostats, Slow Strain Rate Testing Machine, Programmable Furnaces, Optical microscopes with Image Analyzer, Scanning Electron Microscope, Transmission Electron Microscope, and High Resolution Transmission Electron Microscope. The sponsored projects undertaken by the department are in the areas of Nanostructured materials, Interstitial-free and Micro Alloyed Steels, Composites, Intermetallics, Biomaterials, Lithium Ion Battery, Ultrahigh temperature ceramics, Fatigue, Creep and Fracture Mechanics, Structural Integrity Analysis of Irradiated Nuclear Material, Surface Engineering of Metals and Alloys, Oxidation and Environmental Degradation, Solidification Processing, Genetic Algorithm, Process Simulation and Modelling, and Evaluation of Ternary Alloy Phase Diagrams.", "page": "Department of Metallurgical and Materials Engineering"}, {"chunk_id": "05d620ab", "title": "Courses offered in Metallurgical and Materials Engineering", "text": "• B.Tech.- Metallurgical and Materials Engg.\n• Dual Degree - Metallurgical & Materials Engg. / Metallurgical Engg.\n• Dual Degree - Metallurgical & Materials Engg. / MBA\n• M. Tech. - Metallurgical & Materials Engg.\nComposit -Annual Fest of Department Of Metallurgy And Material Sciences\nCOMPOSIT is the annual fest of the department of Metallurgical and Materials Engineering, IIT Kharagpur. The event spans three days of intense contests, spectacular presentations and nerve-breaking quizzes. Since its inception in 1994 , COMPOSIT provides an ideal platform for young metallurgists from all over the country to showcase their talent . On top of the events , eminent personalities and IIT professors deliver guest lectures . Workshops and Panel Discussions are organised. It provides students an opportunity of a lifetime to interact with the stalwarts in their field. As the years have rolled on , COMPOSIT has seen a huge increase in the number of participation and footfall of students from different parts of the country. Lastly, to conclude the fest , a cultural night is organised where popular bands like Somlata and Aces have performed in the past editions , leaving the participants with moments to cherish for a lifetime .", "page": "Department of Metallurgical and Materials Engineering"}]