[{"chunk_id": "196e5ff2", "title": "Department of civil engeneering", "text": "Being one of the oldest with its beginning in 1951, the Department of Civil Engeneering, IIT Kharagpur has been involved in areas of Soil Mechanics, Transportation Engineering, Hydraulics and Structures and Environmental engineering. The sponsored projects and consultancies undertaken by the department include Disaster Mitigation & Management, Analysis, Evaluation and Design of Highway and Airport pavements, Non-destructive Evaluation and Restoration of various structures such as building and bridges, Process Modifications for pollution mitigation, Ground Improvement and Sediment Transport and Scour studies.\nCourses offered by Civil Engeneering Department\n• B.Tech.- Civil Engg.\n• Dual Degree - Civil Engg. / Hydraulic & Water Resources Engg.\n• Dual Degree - Civil Engg. / Transportation Engg.\n• Dual Degree - Civil Engg. / Geotechnical Engg.\n• Dual Degree - Civil Engg. / Structural Engg.\n• Dual Degree - Civil Engg. / Environmental Engg. & Management\n• Dual Degree - Civil Engg. / MBA\n• M. Tech. - Hydraulic & Water Resources Engg.\n• M. Tech. - Transportation Engg.\n• M. Tech. - Environmental Engg. & Management\n• M. Tech. - Geotechnical Engg.\n• M. Tech. - Structural Engg.\nMegalith - Annual Fest\nMegalith is the annual technical fest of the Department of Civil Engineering, Indian Institute of Technology, Kharagpur to be held from 26th to 28th February 2016 under the aegis of the Civil Engineering Society, IIT Kharagpur and the patronage of the Institution of Civil Engineers (UK), IIT Kharagpur chapter. Since its initiation in 2009, Megalith has conquered a huge success in the field of engineering and corporate sector and has grown as largest Civil Engineering Technical Fest of India. Megalith offers a diverse range of competitions, workshops and guest lectures. The sole objective of Megalith is to promote and encourage ideas and innovation in the field of civil engineering and it strives to present a platform to the civil engineering students to work and interact with several civil engineering aspects. Many new initiatives were successfully undertaken in Megalith 2015. Events like Model Exhibition and Rotolare were conducted for the first time and turned out to be a great success. We at Megalith, do not aim to just put up a fest, our vision is to reach every interested student, professor, personnel from the industry and bring them together, pool their resources together to bring up solutions to the most important challenge in India’s development – infrastructure. We focus to create a platform for the students to showcase their talent in civil engineering and help them shape a good career for themselves in this field, we envision a fest which is uniquely different from any other college fest of the kind, with a strong motive and purpose.", "page": "Department of civil engeneering"}]