[{"chunk_id": "837a598f", "title": "Department of Mining Engineering", "text": "The Department of Mining Engineering at Indian Institute of Technology was started in 1956, with the approval of the Planning Commission and the All-India Council of Technical Education (AICTE). The first batch of twenty B. Tech students graduated in 1961 and currently the sanctioned strength of the undergraduate program is 78 B. Tech students. The department has introduced a modern Mining Engineering curriculum in India, taking full advantage of the well-developed infrastructure for technical education at the institute. Over the years, the department has pioneered the offering of courses such as rock and geo-mechanics, mineral processing, numerical methods, geostatistics, GIS & remote sensing, GPS, reliability and quality engineering, safety engineering, environmental science and technology, industrial management, operations research, computer programming and network applications. The faculty is actively involved in sponsored research and industrial consultancy to maintain close relationships with the industry and to develop solutions for industrial problems. A number of continuing education programs for industry executives and teachers are offered on a regular basis. Facilities for research have been created over the years in the areas of fire and explosions, subsurface aerodynamics, experimental geomechanics, environmental quality assessment, mineral processing and numerical modeling. The tradition of inter-departmental research cooperation at IIT, Kharagpur significantly enriches the M. Tech. and Ph.D. programs of the department. This department has awarded more doctoral degrees in mining engineering than any other Institution in India. Quality facilities exist for computer-based investigations, and the students have access to a wide variety of engineering software, testing facilities, and analytical equipment available throughout the institute. The department strives to remain in the forefront of science and technology related to mining and natural resources engineering.\nProf. Khanindra Pathak is the current Head of the Department . [ 1 ]", "page": "Department of Mining Engineering"}, {"chunk_id": "6a134068", "title": "Research Areas", "text": "• Injury epidemiology\n• Occupational health and safety\n• operations research applications\n• Petroleum production engineering\n• Polymer synthesis\n• Safety data analytics\n• Whole-body vibration of machine operator", "page": "Department of Mining Engineering"}, {"chunk_id": "265558de", "title": "Research Laboratories", "text": "• Air Polutionlab\n• Bulk Material Handling\n• Clean Coal Technology Lab\n• Environment\n• Innovation Lab\n• Material Characterization Lab\n• Mine Monitoring And Instrumentation (Mmi)\n• Mine Planning And Design\n• Mineral Engineering\n• Mine Site Restoration Lab\n• Mining Machinery\n• Remote Sensing And Gis\n• Rescue And Disaster Management\n• Rock Excavation Engineering\n• Rock Mechanics Lab\n• Safety System Engineering\n• Surveying\n• Ventilation\n• Workshop", "page": "Department of Mining Engineering"}, {"chunk_id": "727b78fb", "title": "References", "text": "↑ http://www.iitkgp.ac.in/department/MI", "page": "Department of Mining Engineering"}]