[{"chunk_id": "849fa490", "title": "DOUBLE MAJOR", "text": "From https://www.iitkgp.ac.in/faq-ug ,\n\"A Double Major allows all eligible, undergraduate students to earn a second major in a branch that is different from the B.Tech(Hons.)/B.S.(Hons.) branch in which he/she takes admission. For example, a student who takes admission in B.Tech (Hons.) in Electrical Engineering can earn a Double Major, say, in Computer Science and Engineering, or a student who takes admission in B.S(Hons.) in Physics can earn a Double Major, say, in Electronics and Electrical Communications Engineering.\nAny academic unit including departments, centres and schools can offer the Double Major programs. In each academic year, the academic units can specify the maximum number of seats for Double Major program along with any other appropriate selection criteria. The minimum number of seats offered will be 10% of the sanctioned UG seat strength or 10 seats, whichever is minimum.\nThe total number of credits required for a secondary Double Major is 40-48, which includes:\n• At least 27 credits for theory\n• 3 credits for the project or substitute Depth Elective course\n• 8 credits for sessional subjects\nThe 40-48 credits for the Double Major must be separate and should not overlap with the 160-168 credits required for the B.Tech(Hons.)/ BS(Hons.) degree. Students can opt for a Double Major at the end of their 2nd semester. If there are vacant seats, applications may also be accepted at the end of the 3rd semester.\nEligibility Criteria:\n• A minimum CGPA of 7.0 without any backlog at the time of application.\n• Continuously maintaining a backlog-free status throughout the program.\n• Academic Units may also specify pre-requisites for Double Major.\nThe transcript and the degree certificate will clearly state that any extra semester(s) taken to complete the course are not due to any backlog. It will be phrased as 'B.Tech(Hons.)/BS(Hons.) in [PARENT ACADEMIC STREAM] and Major in [SECONDARY ACADEMIC STREAM] (with Specialization, if applicable in [SPECIALIZATION]).'\nThe subjects for double major will be normally scheduled along with other regular subjects. The institute may consider reserving special timetable slots and offering summer courses to accommodate Double Major students.\"", "page": "DOUBLE MAJOR"}]