[{"chunk_id": "info_cf9cb4", "title": "EC21101: Basic Electronics - Quick Facts", "text": "EC21101\nCourse name | Basic Electronics\nOffered by | Electronics & Electrical Communication Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n79 144 172 169 185 108 11 EX A B C D P F | 79 | 79 | 144 | 144 | 172 | 172 | 169 | 169 | 185 | 185 | 108 | 108 | 11 | 11 | EX | A | B | C | D | P | F\n79 | 79 | 144 | 144 | 172 | 172 | 169 | 169 | 185 | 185 | 108 | 108 | 11 | 11\n79\n144\n172\n169\n185\n108\n11\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "EC21101: Basic Electronics"}, {"chunk_id": "0b81e8fe", "title": "Syllabus mentioned in ERP", "text": "Introduction: Electronic system as a conglomeration of several subsystems, such as transducer, amplifier, filter, oscillator, data converter, display device, power supply etc., examples of typical electronic systems (mobile phone, portable CD player etc.), basic concept of signal, noise, etc. Semiconductor devices: Diode, BJT, MOSFET, their structures and principle of operations. Amplifiers: Functionality, specifications (voltage gain, current gain, input resistance, output resistance, dynamic range, bandwidth, linearity, power efficiency etc.), effect of cascading, various applications and typical circuits. Filters: Low pass, high pass, band pass and band stop filters, single and higher order passive filter topologies (RC and LC), specifications (cutoff frequency, roll off, etc.). Feedback: Basic concept of negative and positive feedback, application of negative feedback in amplifiers, effect on gain, bandwidth, input resistance, output resistance and desensitivity to parameter variations. Oscillators: Barkhausen criterion, sinusoidal and non-sinusoidal oscillators, applications and typical circuits. Operational amplifier: Differential mode of operation, common mode rejection, typical op-amp specifications (open loop gain, differential input resistance, unity gainbandwidth etc.), inverting amplifier, non-inverting amplifier, integrator, differentiator, summing amplifier etc., concept of active filters. Power electronics: Half wave and full wave rectification, filtering, regulation with zener diode and linear regulators, , switched mode power supply. Digital electronics: Review of Boolean algebra and signed number representation schemes in binary, implementation of Boolean functions using various logic gates, concept of combinatorial and sequential circuits, registers and counters from functional viewpoint, concept of programmable processors and microcontrollers. Introduction to analog-to-digital and digital-to-analog data converters, their speed and resolution, basic concept of aliasing in the sampling process.", "page": "EC21101: Basic Electronics"}, {"chunk_id": "1cad8ff7", "title": "Additional Resources", "text": "14ME Batch Course Repository", "page": "EC21101: Basic Electronics"}, {"chunk_id": "65813b06", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NR321\nTuesday\nWednesday | NR321 | NR321\nThursday | NR321\nFriday", "page": "EC21101: Basic Electronics"}]