[{"chunk_id": "info_1636a2", "title": "EC21008: Analog Electronic Circuits - Quick Facts", "text": "EC21008\nCourse name | Analog Electronic Circuits\nOffered by | Electronics & Electrical Communication Engineering\nCredits | 4\nL-T-P | 3-1-0\nProfessor(s) | Tarun Kanti Bhattacharya; Bibhudatta Sahoo\nPrevious Year Grade Distribution\n32 43 48 47 32 26 9 EX A B C D P F | 32 | 32 | 43 | 43 | 48 | 48 | 47 | 47 | 32 | 32 | 26 | 26 | 9 | 9 | EX | A | B | C | D | P | F\n32 | 32 | 43 | 43 | 48 | 48 | 47 | 47 | 32 | 32 | 26 | 26 | 9 | 9\n32\n43\n48\n47\n32\n26\n9\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "EC21008: Analog Electronic Circuits"}, {"chunk_id": "72a7ab65", "title": "Syllabus mentioned in ERP", "text": "Pre-requisites: EC21001 or EC21003Introduction: Scope and applications of analog electronic circuits. Amplifier models: Voltage amplifier, current amplifier, transconductance amplifier and transresistance amplifier. Biasing schemes for BJT and FET amplifiers, bias stability, various configurations (such as CE/CS, CB/CG, CC/CD) and their features, small signal analysis, low frequency transistor models, estimation of voltage gain, input resistance, output resistance etc., design procedure for particular specifications, low frequency analysis of multistage amplifiers. High frequency transistor models, frequency responseof single stage and multistage amplifiers, cascode amplifier. Various classes of operation (Class A, B, AB, C etc.), their power efficiency and linearity issues. Feedback topologies: Voltage series, current series, voltage shunt, current shunt, effect of feedback on gain, bandwidth etc., calculation with practical circuits, concept of stability, gain margin and phase margin. Oscillators: Review of the basic concept, Barkhausen criterion, RC oscillators (phase shift, Wien bridge etc.), LC oscillators (Hartley, Collpit, Clapp etc.), non-sinusoidal oscillators. Current mirror: Basic topology and its variants, V-I characteristics, output resistance and minimum sustainable voltage (VON), maximum usable load. Differential amplifier: Basic structure and principle of operation, calculation of differential gain, common mode gain, CMRR and ICMR. OP-AMP design: design of differential amplifier for a given specification, design of gain stages and output stages, compensation. OPAMP applications: review of inverting and non-inverting amplifiers, integrator and differentiator, summing amplifier, precision rectifier, Schmitt trigger and its applications. Active filters: Low pass, high pass, bandpass and bandstop, design guidelines. Digital-to-analog converters (DAC): Weighted resistor, R-2R ladder, resistor string etc. Analog-to-digital converters (ADC): Single slope, dual slope, successive approximation, flash etc. Switched capacitor circuits: Basic concept, practical configurations, application in amplifier, integrator, ADC etc. Other semiconductor devices: UJT, SCR, diac, triac etc., device characteristics and application circuits. Case study: practical circuits of typical electronic systems", "page": "EC21008: Analog Electronic Circuits"}, {"chunk_id": "9d21a723", "title": "How to Crack the Paper", "text": "Attend all classes of the professor who has been allotted to you in ERP and not the other section.\nDifferent sections have different papers.\nAttendance, tutorials and practise is the key.", "page": "EC21008: Analog Electronic Circuits"}, {"chunk_id": "72234ea9", "title": "Classroom resources", "text": "Vandit Sharma Notes: https://drive.google.com/drive/folders/1-2ljq1kcbtdBwWFouikH1Smi8n4bPzc5 (THESE ARE THE NOTES OF Prof TKB Lectures. Contents vary across sections)", "page": "EC21008: Analog Electronic Circuits"}, {"chunk_id": "771471d9", "title": "Additional Resources", "text": "https://drive.google.com/drive/folders/1F4vvSrB_G5iZRlxV6a9yOhhRoern8Hpw\nhttps://www.pdfdrive.com/behzad-razavi-fundamentals-of-microelectronics-e41823219.html", "page": "EC21008: Analog Electronic Circuits"}]