[{"chunk_id": "info_572249", "title": "EC29003: Introduction To Electronics Lab. - Quick Facts", "text": "EC29003\nCourse name | Introduction to Electronics Lab.\nOffered by | Electronics & Electrical Communication Engineering\nCredits | 2\nL-T-P | 0-0-3\nPrevious Year Grade Distribution\n31 107 117 45 22 15 EX A B C D P F | 31 | 31 | 107 | 107 | 117 | 117 | 45 | 45 | 22 | 22 | 15 | 15 | EX | A | B | C | D | P | F\n31 | 31 | 107 | 107 | 117 | 117 | 45 | 45 | 22 | 22 | 15 | 15\n31\n107\n117\n45\n22\n15\nEX | A | B | C | D | P | F\nSemester | {{{semester}}}", "page": "EC29003: Introduction To Electronics Lab."}, {"chunk_id": "a246640b", "title": "Syllabus mentioned in ERP", "text": "1. Familiarization with electronic components and usage of multimeter 2. Familiarization with oscilloscope, signal generator and further usage of multimeters 3. Frequency-response and square-wave testing of R-C, C-R and R-L networks 4. Studies on Voltage Rectifiers 5. Studies on Common-Emitter amplifiers 6. Studies on analog circuits using OP-AMP 7. Studies on logic gates", "page": "EC29003: Introduction To Electronics Lab."}, {"chunk_id": "98edde5f", "title": "How to Crack the Paper", "text": "The examination consists of three parts:", "page": "EC29003: Introduction To Electronics Lab."}, {"chunk_id": "43017e49", "title": "Viva-Voice (Nature and Time of Taking and Format varies) :", "text": "General questions from the lab are asked such as how to use the multimeter to measure capacitance. Each group's viva can go on to roughly 15 minutes and questions are mostly asked on different topic to each member of the group. The questions are according to experiments and, in worst cases, there could be cross questioning from the experiment your partner is being asked from. Below are some example questions:\n• What is a low pass filter and a high pass filter?\n• Draw the circuit for high pass filter with RC and RL components? Also draw the graph for it's characteristics.\n• What is 3dB cutoff frequency? Write the equation.\n• Draw the adder circuit.\n• Draw the circuit for inverting Op-Amp configuration.\nProf Gaurab Dutta :\nHe will give a sheet with 2 questions written on it. You have to solve the question. In case there is some error or anomaly in your answer, he will start asking you stuff. If everything is correct, not a single word conversation will take place.\nQuestions:\n• A 4 quadrant table was given with one axis as V(CE) and other V(BE) for an npn BJT. Write the regions of operation in each quadrant\n• Detailed graph of NPN BJT output characteristics (Early Effect was to be mentioned too)\n• Working of Zener diode\n• Working of Full wave (centre-tap and bridge) rectifier", "page": "EC29003: Introduction To Electronics Lab."}, {"chunk_id": "bea3bbfc", "title": "CIC Lab Test (Common for All):", "text": "A lab test is done in CIC soon after the viva for all the students taking the course. The test consisted of 25 questions (Autumn 2018) of normal difficulty and were doable with just reading the lab manual and understanding the concepts.", "page": "EC29003: Introduction To Electronics Lab."}, {"chunk_id": "2da75702", "title": "Lab Test (Common for All):", "text": "In the lab test, one member from each group is called first with the lab manual, and they are asked to perform some part of an experiment. It is followed by the same procedure for the next member. The student is supposed to perform some part(s) of the experiment and the following is provided:\n- Detailed objective for each part (NO PROCEDURE IS PROVIDED). E.g. Find signal handling capacity for the given circuit when load resistance is infinite and resistance across emitter is bypassed (from CE Amplifier experiment).\n- A diagram (specifically of the parts to be performed) of the circuit is provided.", "page": "EC29003: Introduction To Electronics Lab."}, {"chunk_id": "6f29a95f", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday | In Dept,In Deptt. | In Dept,In Deptt. | In Dept,In Deptt.\nWednesday | In Dept,In Deptt. | In Dept,In Deptt. | In Dept,In Deptt. | In Dept,In Deptt.\nThursday\nFriday | In Dept,In Deptt. | In Dept,In Deptt. | In Dept,In Deptt.", "page": "EC29003: Introduction To Electronics Lab."}]