[{"chunk_id": "info_0e751e", "title": "EC31001: Analog Communication - Quick Facts", "text": "EC31001\nCourse name | Analog Communication\nOffered by | Electronics & Electrical Communication Engineering\nCredits | 4\nL-T-P | 3-1-0\nProfessor(s) | Arijit De\nPrevious Year Grade Distribution\n12 17 14 21 27 37 EX A B C D P F | 12 | 12 | 17 | 17 | 14 | 14 | 21 | 21 | 27 | 27 | 37 | 37 | EX | A | B | C | D | P | F\n12 | 12 | 17 | 17 | 14 | 14 | 21 | 21 | 27 | 27 | 37 | 37\n12\n17\n14\n21\n27\n37\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "EC31001: Analog Communication"}, {"chunk_id": "6d875fa6", "title": "Syllabus mentioned in ERP", "text": "Pre-requisites: EC21004 or EE (Signals and Networks) Representation of signals and systems in a communication system: Discrete and continuous spectra of signals, concepts of modulation and frequency translation, lowpass and bandpass signals and channels, concept of complex envelope, Hilbert transform and phase shifting; Continuous wave (CW) modulation: AM, DSB/SC, SSB, VSB, methods of generation; Demodulation techniques of CW modulation: coherent and noncoherent; Nonlinear modulation techniques: FM and PM, narrowband FM, wideband FM, methods of generation; FM spectrum; Demodulation techniques for FM; Frequency Division Multiplexing (FDM); Radio transmitters and receivers; Sampling a signal by periodic pulse stream: spectra of ideally sampled signal, Nyquist sampling theorem, flat-top sampling, sampling of bandpass signals, examples of sampling circuits; PAM, PWM, PPM, PFM â spectra, generation and demodulation schemes; Time-division multiplexing; Performance of analog modulation schemes in AWGN : CNR, post-demodulation SNR and figure of merit for AM, DSB/SC, SSB, FM, threshold effect in FM, pre-emphasis and de-emphasis in FM, FMFB. Noise in receivers; Noise figures; Radio link design.", "page": "EC31001: Analog Communication"}, {"chunk_id": "1c9d72d1", "title": "Student Opinion", "text": "A good course with a bad teacher I suppose.", "page": "EC31001: Analog Communication"}, {"chunk_id": "4726e46c", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | V4\nThursday | V4\nFriday | V4 | V4", "page": "EC31001: Analog Communication"}]