[{"chunk_id": "db53f8f7", "title": "EC60007: Computational Neuroscience", "text": "Title: Computational Neuroscience\nTeacher: Sharba Bandyopadhyay, E&ECE\nCredits: 3 (3-0-0)\nObjectives: The objectives of the course is to expose engineers and scientists to the field of theoretical neuroscience that involves how actual biological neurons perform computations in the mammalian brain. Current understanding of the biophysics of computation is completely different from the field of artificial neural networks. The course covers the very basics of the biology involved in neuronal processing up to understanding how neurons encode sensory information and how such information is decoded in the brain. Further the course covers phenomena of learning and plasticity of neuronal circuits. Overall the course will equip students to provide different ways of solving problems related to learning using biologically plausible solutions and also allow interested candidates to take up research in neuroscience, a highly interdisciplinary field and contribute in areas of brain machine interface, neural prosthetics, biological sensors and many others.\nText Book Theoretical Neuroscience - Computational and Mathematical Modeling of Neural Systems by Peter Dayan and L.F. Abbott\nReference Books Biophysics of Computation by Christof Koch Ion Channels of Excitable Membranes by Hille Methods in Neuronal Modeling by Segev Principles of Neural Science by Kandel and Schwartz Neuronal Dynamics by Gerstner\nIntended as an elective course for: 4th year BTech, 4th & 5th year BTech/MTech BSc/MSc Dual degree, 1st year MTech/MSc students from the Departments of E&ECE, CSE, EE, Physics, Maths, BioTech, SMST etc.\nPrerequisites: None\nSection 1: Single Neuron Modeling Ion flux in membranes, Nernst Planck Equation, Ion-Channels, Excitable membranes, Spiking, Hodgkin Huxley models, Integrate and Fire Neurons\nSection 2: Neural Encoding and Decoding Spike train statistics, Receptive fields, Linear and Nonlinear models of Receptive fields, Applications of Information Theory in neural coding and decoding\nSection 3: Plasticity: Adaptation and Learning Synapses: structure and function, plasticity, Spike Timing Dependent Plasticity (STDP), Learning rules, Supervised and Unsupervised Learning, Classical conditioning, Reinforcement Learning\nAlso see - EC60004: NEURONAL CODING OF SENSORY INFORMATION - Metakgp Wiki (Spring Semester)", "page": "EC60007: Computational Neuroscience"}, {"chunk_id": "5caf80e2", "title": "Resources", "text": "Course Website - https://informationprocessinglab.weebly.com/ec60007-computational-neuroscience.html\nProject Solutions - Resource-1(neat and organised) , Resource-2 . Note - Doing project on own helps to learn concepts better. Use these resources only in case of emergency or when desperate.\nvideo lectures - NPTEL Note - the video lectures are taught by the same professor.", "page": "EC60007: Computational Neuroscience"}, {"chunk_id": "044ec9f0", "title": "Student Opinion", "text": "One heck of a course to learn about human brain. The course starts with understanding brain at neuronal level and moves to understanding firing patterns. Professor does an amazing job in explaining things from scratch, assuming no prerequisites. Even basics of MATLAB can be picked up after taking the course. Students without much mathematical background can also complete the course by putting enough time and effort. Take this course if you are interested to learn about workings of human brain. But expect most of the stuff will be mathematical and computational, rather than biological.\nRegarding load, since the projects are exhaustive, they consume a lot of time.", "page": "EC60007: Computational Neuroscience"}, {"chunk_id": "579719f4", "title": "Time Table", "text": "This course has empty slot in ERP - Classes are to be conducted after 6 PM on weekdays and classes can also be on weekends. Generally, two 1.5-hour duration classes are held during the weekdays to cover the core content of the course and one 1-hour class during the weekends to cover required mathematical background.\nWEDNESDAY - 6:30pm to 8:00pm\nTHURSDAY - 7:00pm to 8:30pm", "page": "EC60007: Computational Neuroscience"}]