[{"chunk_id": "info_cadda9", "title": "EE19001: Electrical Technology Lab - Quick Facts", "text": "EE19001\nCourse name | Electrical Technology Laboratory\nOffered by | Electrical Engineering\nCredits | 2\nL-T-P | 0-0-3\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | Spring", "page": "EE19001: Electrical Technology Lab"}, {"chunk_id": "3026a0f8", "title": "Syllabus mentioned in ERP", "text": "Laboratory Component: Suggested Experiments\n• To measure the armature and field resistance of a DC machine.\n• To calibrate a test (moving iron) ammeter and a (dynamometer) Wattmeter with respect to standard (DC PMMC) ammeter and voltmeters.\n• Verification of circuit theorems – Thevenin’s and superposition theorems (with DC sources only).\n• Measurement of current, voltage and power in R-L-C series circuit exited by single phase) AC supply.\n• Open circuit and short circuit tests on a single phase transformer.\n• Connection and starting of a three phase induction motor using direct on line (DOL) or star – delta starter.\n• Connection and measurement of power consumption of a fluorescent lamp and voltage – current characteristics of incandescent lamps.\n• Determination of open circuit characteristics (OCC) or a DC generator.\n• Two wattmeter method of measuring power in three phase circuit (resistive load only)", "page": "EE19001: Electrical Technology Lab"}, {"chunk_id": "5f7f88d8", "title": "Concepts taught in class", "text": "Lab experiments:\n1.Characteristics of Fluorescent and Incandescent Lamp http://www.ee.iitkgp.ac.in/TeachingLabs/ElectricalTech/ET_LAB/Expt_1.pdf\n2.Verification of Network Theorems http://www.ee.iitkgp.ac.in/TeachingLabs/ElectricalTech/ET_LAB/et2.pdf\n3.R-L-C Series Circuit http://www.ee.iitkgp.ac.in/TeachingLabs/ElectricalTech/ET_LAB/et3.pdf\n4.Three phase power measurement by two Wattmeter method http://www.ee.iitkgp.ac.in/TeachingLabs/ElectricalTech/ET_LAB/et4.pdf\n5.Open-Circuit and Short-Circuit Test of Single Phase Transformer http://www.ee.iitkgp.ac.in/TeachingLabs/ElectricalTech/ET_LAB/et6.pdf\n6.Load test of Three Phase Induction Motor http://www.ee.iitkgp.ac.in/TeachingLabs/ElectricalTech/ET_LAB/et8.pdf", "page": "EE19001: Electrical Technology Lab"}, {"chunk_id": "19b49375", "title": "Student Opinion", "text": "Although its a lab course, the lab class is held in alternation (every alternate week) with the EE11001 Tutorial 3 hour class (accounts for 40% grade of your total lab grade)- https://wiki.metakgp.org/w/EE11001:_Electrical_Technology . Although this lab course has no final practical lab test, there are certain features that make this lab a hard nut to crack as only 3-4 students per section get Ex (the number depends on your professor taking the lab).\nYou will be guided by the TAs about the experiement, however you have to setup the entire circuit on your own (TAs and Lab assistants can only help you with some connections). You have to take the readings in the fair PT sheets on the spot and get it signed by the TA then and there. Officially, you have to get the circuit diagram signed by the TA before starting the experiment. Since the TAs check your regular practical assignment, they look for the signatures and do penalise you for their absence.\nHowever the best plan for this lab assignment is as follows: 1.Get sufficient PT sheets for all 6 assignments in the beginning of the semester from TechMarket. 2.Write the Aim, Apparatus Used (from circuit diagram), Theory (from Internet or book 1-2 pages), related circuit diagram, Observation tables (leave them blank and keep sufficient space for them),Result page (with expt data portions empty) and the discussion questions along with answers(you can get them on http://notehub.in/ ). No need to write procedure. 3.Do these in your free and peace time and you will reap it's benefits very soon. 4.However bring only the circuit diagram and observation sheets of that particular day's experiment only. 5.Further details regarding format and submission will be explained by your Prof on the first lab day.\nYour lab professor will have no role to play in this lab except your final viva. Depending on the kind of professor you have, the pattern of the test will vary. You may have a complete oral viva or a written-cum-oral viva. And in most cases, the viva goes on for 2-3 weeks. So you might get to know some of the questions from yours friends as they might be repeated quite often. Same goes for the written. The best material to prepare for these Lab Vivas is the book Thareja. If possible read those extra portion which is not in your theory sylabus but might be asked in labs like working principle of various instruments,related calculations and some other extra stuff. But stress on the basic syllabus more strongly.\nFor better idea do go through this page: https://wiki.metakgp.org/w/Electrical_Technology_Viva_Questions", "page": "EE19001: Electrical Technology Lab"}, {"chunk_id": "a5eab098", "title": "Additional Resources", "text": "Instiinfo Repository", "page": "EE19001: Electrical Technology Lab"}]