[{"chunk_id": "info_66238a", "title": "EE30008: Advance Electrical Machines - Quick Facts", "text": "EE30008\nCourse name | Advance Electrical Machines\nOffered by | Electrical Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | Autumn", "page": "EE30008: Advance Electrical Machines"}, {"chunk_id": "ebbee590", "title": "Syllabus mentioned in ERP", "text": "pre requisite: EE21002Transformer: Three winding transformer; Unbalanced operation of three phase transformer; Switching-in transients and mechanical forces.Electromechanical energy conversion: Field energy- energy and co-energy; Torque/force in a singly excited and multiple excited electromechanical systems and applications, AC windings.Circuit analysis of electrical machines: Development of circuit models from dc machine and synchronous machine. Impedance matrix; instantaneous and phasor variables; real-coil and pseudostationary coil, expressions for torque and power, transformation of variables with power invariance, examples; general two-axis machine. Extension of twoaxis models to different machines.D.C machines: Flux and mmf waves; Commutation and armature reaction; Dynamic equations, block diagrams and transfer functions.Induction machines: Deep-bar and double-cage construction; Machine equations in stationary reference frame (d-q axis model), dynamic and steady state performance, behavior under asymmetrical supply voltages.Synchronous machines: Winding inductances; Machine equations in rotor reference frame (d-q axis model); Sudden three phase short circuit and transient circuit model; Steady state operation; Synchronous machine dynamics.Reluctance Machines: Synchronous reluctance, stepping motors and switched reluctance machines, principles of operation and models for operating characteristics. Steady-state and dynamic performance.PM machines: Permanent magnet material, Basic analysis of magnetic circuit with permanent magnets, Steady-state and dynamic performance of PM synchronous machines and Brushless DC machines.", "page": "EE30008: Advance Electrical Machines"}]