[{"chunk_id": "info_fb1d2e", "title": "EE31009: Control System Engineering - Quick Facts", "text": "EE31009\nCourse name | CONTROL SYSTEM ENGINEERING\nOffered by | Electrical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n6 27 42 39 63 21 47 EX A B C D P F | 6 | 6 | 27 | 27 | 42 | 42 | 39 | 39 | 63 | 63 | 21 | 21 | 47 | 47 | EX | A | B | C | D | P | F\n6 | 6 | 27 | 27 | 42 | 42 | 39 | 39 | 63 | 63 | 21 | 21 | 47 | 47\n6\n27\n42\n39\n63\n21\n47\nEX | A | B | C | D | P | F\nSemester | {{{semester}}}", "page": "EE31009: Control System Engineering"}, {"chunk_id": "a8437cda", "title": "Syllabus mentioned in ERP", "text": "Control Systems Engineering\n1. Introduction and Overview: What is control; Meaning of the terms reference input, control input, disturbance input and controlledoutput; Tracking and the disturbance rejection problems; Manual vs. automatic control; Feedback and feed forward control.\n2. Modelling: Impulse response and convolution integral for LTI systems; I/O relation in Laplace domain and Transfer function; Block-diagram (and Signal-flow-graph) representation of systems and their reduction to get T/F; Normalized T/F; Some examples.Concept of states; State-space modelling of general systems; Operating points and linearization about the same; State-space to transfer function transformation and the reverse (i.e., realization) problem for LTI systems; Examples of incremental transfer function.\n3. Characterization of plants: Asymptotic and BIBO stability; Significance of poles and eigenvalues; Internal stability; Routh-Hurwitz test.Time-domain impulse- and stepresponses of 1- and 2-pole systems; Settling time, over-shoot etc. in terms of damping coefficient and natural frequency; Effect of zero near the origin (and in rhp). Definition and significance of Frequencyresponse;Relation between time- and frequency-response features (of 2-pole plants); Nyquist and Bode plots; Examples.\n4. Analysis of effects of feedback: Stability analysis of C/L systems from O/L Nyquist and Bode plots;O/L plant types and C/L steady-state errors for step and ramp inputs; C/L rootloci for variation of loop gain (or other parameter); Sensitivity transfer functions (S and T) and their significance; Measure of loop robustness in terms of the peaks of S and T.\n5. Compensation techniques: Performance goals - Steady state, transient and robustness specifications; Timedomain vs. frequency-domain design approaches; PID, Lag-lead, and Poleplacement design techniques; 2 degree-of-freedom control.6. Sampled-data systems: Overview of computer controlled systems; z- transform for discrete time signals and systems; Examples of z-domain transfer functions; Stability and response; Frequency spectrum and Sampling theorem; Aliasing effect and its remedy; Controller design via digital-redesign/root-locus.", "page": "EE31009: Control System Engineering"}, {"chunk_id": "2757b055", "title": "How to Crack the Paper", "text": "Completely solve previous year question papers set by the same Prof., learn all the definitions, memorise each and every corner of the class notes.", "page": "EE31009: Control System Engineering"}, {"chunk_id": "15317823", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | V2\nThursday | V2\nFriday | V2 | V2", "page": "EE31009: Control System Engineering"}]