[{"chunk_id": "info_965e87", "title": "EE39009: Control And Instrumentation Lab. - Quick Facts", "text": "EE39009\nCourse name | CONTROL AND INSTRUMENTATION LAB.\nOffered by | Electrical Engineering\nCredits | 2\nL-T-P | 0-0-3\nPrevious Year Grade Distribution\n11 51 50 13 6 1 EX A B C D P F | 11 | 11 | 51 | 51 | 50 | 50 | 13 | 13 | 6 | 6 | 1 | 1 | EX | A | B | C | D | P | F\n11 | 11 | 51 | 51 | 50 | 50 | 13 | 13 | 6 | 6 | 1 | 1\n11\n51\n50\n13\n6\n1\nEX | A | B | C | D | P | F\nSemester | {{{semester}}}", "page": "EE39009: Control And Instrumentation Lab."}, {"chunk_id": "13f8b0d6", "title": "Syllabus mentioned in ERP", "text": "1:- To obtain the torque-speed Characteristics of a separately excited D.C machine and its parameters, and hence determine the transfer function of a D.C Machine.2:- To obtain the torque-speed characteristics of a 2-phase ac servo motor and hence determine the incremental transfer function at different operating conditions. 3:- To obtain (i) the velocity/transportation lag of a process (ii) closed loop system response using Proportional (P) and two step control strategies (with and without overlapping).4:- To obtain (i) the transfer function of each block of the plant (or process) from its step response (ii) system response with P, PI and PID control actions and observe the effects of external disturbances on the performance of the system. 5:- To obtain (i) position and speed control of a D.C Motor with /with velocity feedback.6:- To obtain (i) the response of digital servo system using PID control law, and (ii) develop control models through SIMULINK program and test them out on the digital servo hardware.7:- To regulate the outlet water temperature of Process Control System using (i) on/off controller (ii) industrial controllers (P, PI, PID controllers).8:- To obtain a mathematical model of liquid level system and control the water level in tank-2 using different control laws.9:- To obtain the Galvanometer constants and its response in time domain and frequency domain respectively. 10:- To run the digital pendulum system in (i) the crane (ii) the swing-up and upright stabilization modes and investigate the effects of inverted pendulum system behavior with the changes in control parameters.11:- To obtain (i) the behavior of a dynamic system and its stability analysis using MATLAB program (ii) response of a simple D.C drive system with load torque using Simulink software.12:- To obtain (i) the parameters of an oven and hence find its the transfer function (ii) the time response of thermal system using on/off (or relay) and P, PI, PID controllers (selecting controller parameters using Ziegler and Nichols tuning technique).", "page": "EE39009: Control And Instrumentation Lab."}, {"chunk_id": "078982ad", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | Control Lab | Control Lab | Control Lab\nTuesday | Control Lab | Control Lab | Control Lab\nWednesday | Control Lab | Control Lab | Control Lab | Control Lab\nThursday\nFriday | Control Lab | Control Lab | Control Lab", "page": "EE39009: Control And Instrumentation Lab."}]