[{"chunk_id": "info_d1f177", "title": "EE41001: Industrial Instrumentation - Quick Facts", "text": "EE41001\nCourse name | Industrial Instrumentation\nOffered by | Electrical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n3 10 12 22 13 14 3 EX A B C D P F | 3 | 3 | 10 | 10 | 12 | 12 | 22 | 22 | 13 | 13 | 14 | 14 | 3 | 3 | EX | A | B | C | D | P | F\n3 | 3 | 10 | 10 | 12 | 12 | 22 | 22 | 13 | 13 | 14 | 14 | 3 | 3\n3\n10\n12\n22\n13\n14\n3\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "EE41001: Industrial Instrumentation"}, {"chunk_id": "d9c8093a", "title": "Syllabus mentioned in ERP", "text": "Introduction to Instrumentation system, Static and Dynamic characteristics of Instrument. Displacement and proximity gauges. Linear Variable Differential Transformer (LVDT). Measurement Temperature, Flow and Pressure. Temperature: Thermocouple, Resistance Temperature Detector (RTD), Thermistor, Radiation Pyrometer. Flow: Differential Pressure flowmeter, Variable area flowmeter, Variable reluctance transducer, Turbine flowmeter, Ultrasonic flowmeter (Both transit time and Doppler Shift), electromagnetic flowmeter and Mass flow meter. Pressure: Elastic transducers( Bourdon Gauge, Bellow and Diaphragm Gauge). Low pressure measurement: McLeod and ionization gauge. Measurement of level: Capacitance based and Float based method. Measurement of strain: Strain Gauge, unbalanced Wheatstone bridge, Load cell, Torque Cell. pH probe and viscosity measurement. Basics of Data transmission: Synchro and Servo motor. IEEE-488 bus, RS 232 and RS 485 interface. Pneumatic and Hydraulic Instrumentation system.", "page": "EE41001: Industrial Instrumentation"}, {"chunk_id": "96cfc480", "title": "Student Opinion", "text": "The subject is lot fucked up please be careful and study it the professor is a asshole the questions in exam are too tough 85% of the class have below 35 marks by midsem end sem has weightage of 35 Marks please be careful with the topic the grading is absolute", "page": "EE41001: Industrial Instrumentation"}, {"chunk_id": "22396818", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | NC332\nThursday | NC332\nFriday | NC332 | NC332", "page": "EE41001: Industrial Instrumentation"}]