[{"chunk_id": "info_e7f449", "title": "EE60108: Adaptive And Array Signal Processing - Quick Facts", "text": "EE60108\nCourse name | ADAPTIVE AND ARRAY SIGNAL PROCESSING\nOffered by | Electrical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | {{{semester}}}", "page": "EE60108: Adaptive And Array Signal Processing"}, {"chunk_id": "399ebf53", "title": "Syllabus mentioned in ERP", "text": "Overview, Objective and Contents:Overview: Sensors Array and Adaptive Signal Processing is an emerging discipline thathas been defined as the study, invention and implementation of structures and algorithmsto improve the communication, understanding and management of information in theform of digital signal in the sensor networks. This paradigm emphasizes on theintegration of data, knowledge, and tools necessary for efficient knowledge discovery inthe decision-making process associated with information extraction and computationalintelligence. It can be found at the heart of many electronic signal processing systemsdesigned to extract information. These systems include Radar, Sonar, Speech, ImageAnalysis, Biomedicine, Control, Communications and Seismology. It is therefore animportant goal to develop this subject addressing the requirements and to train thestudents in understanding the above-specified applications for development of efficientdecision-making system having better signal handling capabilities.Objective:• To develop an in-depth understanding with the basic theoretical knowledge andpractical experience from the area of embedded systems.• To know the various statistical techniques for processing and visualization of digitalinformation on the MATLAB.Contents:Course Content LectureAdaptive Systems and adaptive linear combiner, input signals and weightvectors, Performance function, MMSE -- 3 hourMethod of Steepest Descent and LMS adaptive filters, Stability andRobustness of LMS filter, Normalised LMS filter, Tracking performance. -- 6 hourMVDR spectrum estimation Recursive least square adaptive filters, SquareRootAdaptive filters,QR-RLS algorithm, Tracking performance -- 6 hourIIR Adaptive filters: Output Error method and Equation error methodBlind Deconvolution, Bussgang Algorithm --5 hourApplications: Adaptive modeling in FIR digital Filter Synthesis, Adaptivemodeling of a multipath communication channel and Adaptive interferencecancellation -- 5 hourSensor Array Processing:Array Fundamentals, Conventional Spatial Filtering, BeamformerClassification, Data Independent Beamforming, Optimum BeamformingMultiplesidelobe canceller, SNR maximization -- 6 hourDirection-ofarrival estimation: Subspace-based methods-Signal and Noisesubspace methods: Search-based method, Algebraic method (MinimumVariance, AR, Subspace fitting, MUSIC) --5 hourArray processing for mobile communications: Vector channel models,Performance consideration: Effect of Signal Mismatch, Bandwidth, Correlatedarrivals, MMSE beamformer, Peak-to-Average power ratio reduction, Analysisof adaptive Beamformer8 hourConclusions, Feedback, Expectations 1Recommended Text Books/Reference Books:Adaptive Filter Theory By Simon Haykin, W. C. Stirling, ISBN-13: 81-7808-565-8, PearsonEducation, 2005.Adaptive Signal Processing by B. Widrow and S. D. Stearns, ISBN 978-81-317-0532-2,Dorling Kindersley (India) Pvt. Ltd. 2009Statistical and Adaptive Signal Processing: By D. G. Manolakis and V. K. Ingle and S. M.Kogan, Artech House ISBN: 1-58053-6107.", "page": "EE60108: Adaptive And Array Signal Processing"}]