[{"chunk_id": "info_d02be3", "title": "EE60101: Advanced Sensing Techniques - Quick Facts", "text": "EE60101\nCourse name | Advanced Sensing Techniques\nOffered by | Electrical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n1 4 5 9 9 1 EX A B C D P F | 1 | 1 | 4 | 4 | 5 | 5 | 9 | 9 | 9 | 9 | 1 | 1 | EX | A | B | C | D | P | F\n1 | 1 | 4 | 4 | 5 | 5 | 9 | 9 | 9 | 9 | 1 | 1\n1\n4\n5\n9\n9\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "EE60101: Advanced Sensing Techniques"}, {"chunk_id": "c78e67b9", "title": "Syllabus mentioned in ERP", "text": "IntroductionDifferent Phases of automation. Importance of sensor/smart sensor inautomation. Features of Advanced sensing techniques.Sensor classifications according to the energy domains.Introduction of advanced sensing materials.Properties (physical, electrical, chemical, biological) of materialswhich makes it suitable for sensing in different domain.Design and modelingDesign and modeling issue in advanced sensing techniqueIntroduction of different mathematical tools used in sensor designStudy of analytical design from given specification, conformalmapping, Optimization techniques used in sensor design. Numericaldesign such as FEM, FDM, etc.Study of Tomography and Concept of Feed back in sensingFabrication and packagingIntroduction to MEMS sensor. Comparison between MEMS andMacro sensor.Fabrication and packaging issue in sensor designThick film and thin film techniquePhysical sensorsHall Effect sensors, Eddy current sensors, magneto resistive andmagneto strictive detectors,Accelerometers: Capacitive, Piezoelectric, Piezoresistive, ThermalHumidity and moisture sensorProximity detectors using polarized light,Semiconductor gas sensorSemiconductor gas sensorFluidic and Micro-fluidic sensorsChemical sensorChemical sensor characteristics, specific difficulties related tochemical sensor, Classification of Chemical sensing mechanismStudy of chemical sensor based on the principle direct sensingtechniques such as Metal oxide chemical sensor, electrochemicalsensors, potentiometric sensors, conductive sensors, amperometricsensors, enhanced catalytic gas sensors, engyme sensorsStudy of chemical sensors in indirect mode such as thermal sensor,optical chemical sensor, biochemical sensor, enzyme sensorSensor arrayIntroduction to the concept of Lab on chip/senor platform technologyThe role of PCA, LDA, Neural network in designing sensor arrayStudy of temperature cycle mode of sensing to obtain virtual sensorarrayCase study of a gas sensing platform, liquid sensing", "page": "EE60101: Advanced Sensing Techniques"}]