[{"chunk_id": "info_e09644", "title": "EE60062: Digital Image Processing - Quick Facts", "text": "EE60062\nCourse name | Digital Image Processing\nOffered by | Electrical Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n1 1 3 1 EX A B C D P F | 1 | 1 | 1 | 1 | 3 | 3 | 1 | 1 | EX | A | B | C | D | P | F\n1 | 1 | 1 | 1 | 3 | 3 | 1 | 1\n1\n1\n3\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "EE60062: Digital Image Processing"}, {"chunk_id": "16acb09b", "title": "Syllabus mentioned in ERP", "text": "Introduction: Digital image, steps of digital image processing systems, elements of visual perception, connectivity and relations between pixels. Simple operations - arithmetic, logical, geometric operations. Mathematical preliminaries- 2D LTI systems, 2D convolution, correlation, 2D random sequence, 2D spectrum. Image Transforms: 2D orthogonal and unitary transforms- properties and examples. 2D DFT, FFT, DCT, Hadamard transform, Haar Transform, Slant transform, KL Transform- properties and examples. Image Enhancement: point processing, spatial filtering-in space and frequency, Nonlinear filtering, Color image processing fundamentals. Image Restoration: Image observation and degradation model, circulant and block circulant matrices and its application in degradation model, Algebraic approach to restoration, Inverse by Wiener filtering, Generalized inverse- SVD and iterative methods, blind deconvolution, image reconstruction from projections. Image compression: redundancy and compression models ; loss less and lossy. Loss less- variable-length, Huffman, Arithmetic coding, bit-plane coding, Loss less predictive coding, lossy Transform (DCT) based coding, JPEG standard, sub band coding. Image segmentation: Edge detection, line detection, curve detection, Edge linking and boundary extraction, boundary representation, region representation and segmentation, morphology-dilation, erosion, opening and closing. Image understanding and recognition: Matching by templates, classifiers-models, statistical, neural network based, matching shapes by contour and texture. Applications: Automatic visual system in part inspection, forensic and security system, entertainment- multimedia, scientific and medical investigation", "page": "EE60062: Digital Image Processing"}, {"chunk_id": "a6d8c852", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | N232\nThursday | N232\nFriday | N232 | N232", "page": "EE60062: Digital Image Processing"}]