[{"chunk_id": "info_9939af", "title": "EE60011: Control Theory - Quick Facts", "text": "EE60011\nCourse name | Control Theory\nOffered by | Electrical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n2 1 2 2 EX A B C D P F | 2 | 2 | 1 | 1 | 2 | 2 | 2 | 2 | EX | A | B | C | D | P | F\n2 | 2 | 1 | 1 | 2 | 2 | 2 | 2\n2\n1\n2\n2\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "EE60011: Control Theory"}, {"chunk_id": "ccab38cd", "title": "Syllabus mentioned in ERP", "text": "Introductory matrix algebra and linear vector space. State space representation of systems. Linearization. Solution of state equations. Evaluation of state transition matrix (STM). Simulation of state equation using MATLAB SIMULINK program. Similarity transformation and invariance of system properties due to similarity transformations. Minimal realization of SISO, SIMO, MISO transfer function. Discretization of a continuous time state space model. Convert state space model to transfer function model using Fadeeva algorithm. Fundamental theorem of feedback control. Controllability and Controllable canonical form. Pole assignment by state feedback using Ackermann’s formula, controllable canonical form and numerically stable method based on controllable Hessenberg form. Eigenstructure assignment problem. Linear Quadratic Regulator (LQR) problem and solution of algebraic Riccati equation using eigenvalue and eigenvector methods, iterative method, and numerically stable algorithm. Controller design using output feedback. Observability and observable canonical forms. Design of full order observer using Ackermann’s formula, observable canonical form, observable Hessenberg canonical form, and Bass Gura algorithm. Duality. Observer based controller design. Reduced order observer design. Internal stability of a system. Stability in the sense of Lyapunov, asymptotic stability of linear time invariant continuous and discrete time systems. Solution of Lyapunov type equation. Model decomposition and Decoupling by state feedback. Disturbance rejection, sensitivity and complementary sensitivity functions, internal model control (IMC).", "page": "EE60011: Control Theory"}, {"chunk_id": "65af45f6", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NC234 | NC234\nTuesday | NC234 | NC234\nWednesday\nThursday\nFriday", "page": "EE60011: Control Theory"}]