[{"chunk_id": "info_a9b092", "title": "EE60032: Analog Signal Processing - Quick Facts", "text": "EE60032\nCourse name | Analog Signal Processing\nOffered by | Electrical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n3 13 14 11 10 5 3 EX A B C D P F | 3 | 3 | 13 | 13 | 14 | 14 | 11 | 11 | 10 | 10 | 5 | 5 | 3 | 3 | EX | A | B | C | D | P | F\n3 | 3 | 13 | 13 | 14 | 14 | 11 | 11 | 10 | 10 | 5 | 5 | 3 | 3\n3\n13\n14\n11\n10\n5\n3\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "EE60032: Analog Signal Processing"}, {"chunk_id": "df89f43b", "title": "Syllabus mentioned in ERP", "text": "Bipolar operational amplifiers. MOS diode, active resistor and current mirrors, CMOS amplifier and operational amplifier. Approximation functions: Butterworth, Chebyshev and Bessel approximations, Frequency transformation. Continuous time filter: Active filter; Second order filter: Single amplifier and multiple amplifier structures and filter parameter sensitivities. Cascade filter. Sampled data filter: Switched Capacitor filter; Switched capacitor integrator and filter. Filter transfer function in z-domain, Filter parameter sensitivities with respect to capacitor ratios. Mixed signal circuits: Introduction to Switched current filter, current cell. Simple second order structure. Analog multiplexer, Sample and Hold Circuits, aliasing error and anti-aliasing filter, Digital to analog converter (DAC), Analog to Digital Converter (ADC), flash, dual slope and multi slope ADC. Over sampling method for A/D and D/A conversion. Delta-Sigma data converter. Noise and noise reductions. Interference signals and their reduction: Capacitive, inductive coupling and ground loop interferences and its reduction. Logarithmic and exponential amplifiers, analog multipliers and divider, Voltage controlled oscillator, Phase locked loop. Waveform generator and Oscillator.", "page": "EE60032: Analog Signal Processing"}, {"chunk_id": "d1ac196e", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NC333\nTuesday | NC333 | NC333\nWednesday\nThursday | NC333\nFriday", "page": "EE60032: Analog Signal Processing"}]