[{"chunk_id": "info_0b521e", "title": "EE60014: Non-Linear Control - Quick Facts", "text": "EE60014\nCourse name | Non-Linear Control\nOffered by | Electrical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n1 1 EX A B C D P F | 1 | 1 | 1 | 1 | EX | A | B | C | D | P | F\n1 | 1 | 1 | 1\n1\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "EE60014: Non-Linear Control"}, {"chunk_id": "38e1cf0a", "title": "Syllabus mentioned in ERP", "text": "Linear versus nonlinear systems. Describing function analysis: Fundamentals, common nonlinearities (saturation, dead-zone, on-off non-linearity, backlash, hysteresis) and their describing functions. Describing function analysis of nonlinear systems. Reliability of describing method analysis. Compensation and design of nonlinear system using describing function method.Phase plane analysis: Phase portraits, Singular points characterization. Analysis of nonlinear systems using phase plane technique, Existence of limit cycles. Linearization: Exact linearization, input-state linearization, input-output linearization.Concept of stability, Stability in the sense of Lyapunov and absolute stability. Zero-input and BIBO stability. Second (or direct) method of Lyapunov stability theory for continuous and discrete time systems. Aizermans and Kalmans conjecture. Construction of Lyapunov function-Methods of Aizerman, Zubov; variable gradient method. Lure problem. Popovs stability criterion, generalized circle criterion, Kalman-Yakubovich-Popov Lemma. Popovs hyperstability theorem. Disturbance issues in nonlinear control, non-linear control system design problem. Concept of variable-structure controller and sliding control, reaching condition and reaching mode, implementation of switching control laws. Reduction of chattering in sliding and steady state mode. Some design examples of nonlinear systems such as the ball and beam, flight control, magnetic levitation and robotic manipulator etc.Approximate solution of nonlinear system using the perturbation method and averaging method.", "page": "EE60014: Non-Linear Control"}]