[{"chunk_id": "info_4170b7", "title": "EE60003: Machine Analysis - Quick Facts", "text": "EE60003\nCourse name | Machine Analysis\nOffered by | Electrical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n1 1 2 EX A B C D P F | 1 | 1 | 1 | 1 | 2 | 2 | EX | A | B | C | D | P | F\n1 | 1 | 1 | 1 | 2 | 2\n1\n1\n2\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "EE60003: Machine Analysis"}, {"chunk_id": "c22c8572", "title": "Syllabus mentioned in ERP", "text": "Course Name: Machine AnalysisCourse No.: EE60003L-T-P : 3-1-0Prerequisite: NoneModule-1(8 lectures): Introduction and review of electrical machines; Principles of electromagnetic energy conversion: General expression of stored magnetic energy, co-energy and force/torque, example using single and doubly excited system. Module-2(8 lectures): Calculation of air gap mmf and per phase machine inductance using physical machine data; Voltage and torque equation of dc machine, three phase symmetrical induction machine and salient pole synchronous machines in phase variable form. Module-3(8 lectures):Introduction to reference frame theory: static and rotating reference frames, transformation relationships, examples using static symmetrical three phase passive circuits.Module-4(8 lectures):Generalized theory of rotating electrical machine and Krons primitive machine; Modeling of D.C and 3-phase symmetrical induction and synchronous machines; voltage and torque equations, derivation of steady state phasor relationship from dynamic model. Module-5(5 lectures):Analysis and dynamic modeling of two phase asymmetrical induction machine and single phase induction machine.Module-6(5 lectures):Selected topics on special machines (PMSM, Stepper, SRM and Linear machines).", "page": "EE60003: Machine Analysis"}, {"chunk_id": "3fe5747a", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NEX201\nTuesday | NEX201 | NEX201\nWednesday\nThursday | NEX201\nFriday", "page": "EE60003: Machine Analysis"}]