[{"chunk_id": "info_8c1b75", "title": "EE60102: Statistical Signal Processing - Quick Facts", "text": "EE60102\nCourse name | Statistical Signal Processing\nOffered by | Electrical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n2 2 3 9 9 5 EX A B C D P F | 2 | 2 | 2 | 2 | 3 | 3 | 9 | 9 | 9 | 9 | 5 | 5 | EX | A | B | C | D | P | F\n2 | 2 | 2 | 2 | 3 | 3 | 9 | 9 | 9 | 9 | 5 | 5\n2\n2\n3\n9\n9\n5\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "EE60102: Statistical Signal Processing"}, {"chunk_id": "39202c71", "title": "Syllabus mentioned in ERP", "text": "Course Overview: Spectral estimation, Signal modeling, Adaptive filtering, Array ProcessingReview of Probability and Stochastic ProcessEstimation Theory: MVUE, Cramer-Rao Lower bound, Best Linear Unbiased Estimator, Maximum likelihood Estimator, General Bayesian EstimatorDetection Theory: Neyman Pearson Theorem, Receiver Operating Characteristics, Matched Filters, Composite Hypothesis TestingNonparametric Spectral Estimation: Estimation of power spectrum of stationary random signal using periodogram-various methodsJoint signal analysis and estimation of cross power spectrumLinear Signal Model:Synthesis of coloring filter and Analysis of whitening filter,Rational power spectra (AR, MA, ARMA), Relationship between filter parameters and autocorrelation sequences, Lattice-Ladder filter realizationParametric Spectral Estimation:Order selection criterion of AR model,Minimum-variance, Maximum entropy and Maximum likelihood spectrum estimationHarmonic models and frequency estimation techniquesHarmonic Decomposition, MUSIC algorithm, ESPRIT algorithmLinear Optimum Filter:Optimum FIR Filter, PCA of optimum linear estimator and its frequency domain interpretationForward and Backward Linear prediction and optimum reflection coefficientsOptimum causal and non-causal IIR Filters, Deconvolution and Signal restorationAlgorithms and Structure of Optimum Linear FiltersLevinson Recursion for optimum estimate, Order-recursive algorithms for optimum FIR filters and its lattice structures. Levinson and Durbin algorithmsTUTORIAL:Assignments and Tutorials on Digital Signal Processing Hardware:Architecture of TMS320C5x, TMS320C6x Processors, DSP development tool (CCS AND DSK), selection of DSP processors, Experiments with C5510 DSK, C6416DSK and C6713 DSK", "page": "EE60102: Statistical Signal Processing"}, {"chunk_id": "a9a73a52", "title": "Concepts taught in class", "text": "• Minimum Variance Unbiased Estimation\n• Cramer-Rao Lower Bound\n• Linear Models\n• General Minimum Variance Unbiased Estimators\n• Best Linear Unbiased Estimators\n• Maximum Likelihood Estimation\n• Method of Moments\n• General and Linear Bayesian Estimators\n• Kalman Filters", "page": "EE60102: Statistical Signal Processing"}, {"chunk_id": "df69d531", "title": "Spring 2017 | Anirban Mukherjee", "text": "This course is quite related to MA41108: Statistical Inference. Most of the course is based on Estimation theory and Prof. Anirban teaches it exactly as is from Steven Kay's SSP book. Estimation theory is mainly about inferering the parameters (population parameters) from a set of observable data and infering the parameters that influence their occuring. As the course under Anirban follows the book completely, it is really easy and straightforward to learn. SSP is a very fun course where one can expect to strengthen one's knowledge on Probablity and Signal Processing together. Prof. Anirban rarely talked about examples in real life where SSP can be of use, but the book does a very fine job in exposing the applications.\n-- Arun Patro (EE '18)", "page": "EE60102: Statistical Signal Processing"}, {"chunk_id": "b336ef82", "title": "How to Crack the Paper", "text": "The mid-semester paper is usually easy and covers simple concepts taught in class in the form of sums. There are a few derivation based questions in the paper as well which can be found in the example section of the chapters covered in the Steven M. Kay. It is advisable to go through the sums given in the class as assignment problems. It is also recommended to get hold of the previous year question paper from a senior as it is not available in the library website. Some problem patterns can be inferred from them, which helps in narrowing down the focus of preparation. The mid-semester paper is usually scoring.\nThere is a single class test held which has a weightage of 10 marks and the other 10 marks comes from the assignment submission. The class test is usually tricky which tests some basic concepts and the pattern of sums set are not available in the book. The end-semester paper consists of 6 questions of 10 marks each. Adequate time is available to complete the paper. Revising the assignment sums and previous year paper is useful. It is advisable to thoroughly revise the example sums from the Steven M. Kay for the portions which has been added new to the syllabus compared to previous years.", "page": "EE60102: Statistical Signal Processing"}, {"chunk_id": "29c63d0e", "title": "Additional Resources", "text": "• An Introduction to Statistical Signal Processing Volume I (Estimation Theory) by Steven M. Kay\n• An Introduction to Statistical Signal Processing Volume II (Decision Theory) by Steven M. Kay", "page": "EE60102: Statistical Signal Processing"}]