[{"chunk_id": "info_7ed4ec", "title": "EE60096: High Voltage Direct Current Transmission (Hvdc) And Flexible Alternating Current Transmission Systems (Facts) - Quick Facts", "text": "EE60096\nCourse name | High Voltage Direct Current Transmission (Hvdc) And Flexible Alternating Current Transmission Systems (Facts)\nOffered by | Electrical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n1 1 1 1 EX A B C D P F | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | EX | A | B | C | D | P | F\n1 | 1 | 1 | 1 | 1 | 1 | 1 | 1\n1\n1\n1\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "EE60096: High Voltage Direct Current Transmission (Hvdc) And Flexible Alternating Current Transmission Systems (Facts)"}, {"chunk_id": "5db459d9", "title": "Syllabus mentioned in ERP", "text": "A. HVDCâ¢Introduction to HVDC: Overview and advantages. â¢Basic power conversion principle, Rectifier and inverter operation, Commutation. â¢Control of HVDC for stable operation. â¢Harmonic Generation, analysis and elimination on DC systems. â¢Protection of HVDC system with focus on commutation failure. â¢Interaction with AC system. â¢New concepts: Voltage sourced converter based HVDC, Introduction to multilevel converters for high voltage power transmission system, Multi-terminal HVDC. B. FACTSâ¢Introduction to FACTS â Compensation of transmission systems.â¢Series and Shunt FACTS controllers - variable impedance type and switched converter type.â¢Unified Power Flow Controller and other types of FACTS devices.â¢Application of FACTS controllers in improvement of power system operation and stability.Suggested Reading/Text Books/Reference Books:(a)J. Arrillaga, High Voltage Direct Current Transmission, The Institution of Electrical Engineers, London, UK, 1998.(b)E. W. Kimbark, Direct Current Transmission, Wiley-Intersciece, 1971.(c)N. G. Hingorani, Understanding FACTS, IEEE Press, 2001.(d)E. Uhlmann, Power Transmission by Direct Current, Springer-Verlag.(e)K. R. Padiyar, HVDC Power Transmission Systems: Technology and System Interactions, New Age International (P) Limited, and Publishers.(f)Enrique Acha, Power electronic control in electrical systems, Newnes, 2002 - Technology", "page": "EE60096: High Voltage Direct Current Transmission (Hvdc) And Flexible Alternating Current Transmission Systems (Facts)"}]