[{"chunk_id": "info_390a70", "title": "EE61010: Railway Signalling And Telecommunication - Quick Facts", "text": "EE61010\nCourse name | RAILWAY SIGNALLING AND TELECOMMUNICATION\nOffered by | Electrical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | {{{semester}}}", "page": "EE61010: Railway Signalling And Telecommunication"}, {"chunk_id": "a3c9fd62", "title": "Syllabus mentioned in ERP", "text": "Objectives: The course offers a thorough understanding of theoretical knowledge and best practices in railway signaling and telecommunication including the concepts of railway signaling principles, safety and risk management; automatic train protection systems; signaling and layout designs; telecommunication systems and equipment including research.Credit: {(3-1-0) 4 credits}Syllabus: Part-1: Railway Signaling (16 Lecture Hours):•Stringline diagrams, train scheduling and train stopping distance calculations. •Concepts of temporal and spatial separation of trains to ensure safe and efficient use of equipment and infrastructure. •Train movement authority, track circuits and other train position monitoring systems•Train control systems include radio based, wayside signals, cab signal, positive train control, interlocking design, operation and control.Part-2: Telecommunications (30 Lecture Hours):•Overview of modern heterogeneous telecommunications infrastructure, layered architecture, LAN, MAN and WAN (03 Lecture Hours);•Telecommunications switching techniques (03 Lecture Hours);•Switching systems: non-blocking architectures, blocking probability, time-division switching, two-dimensional switching, Optical switching (03 Lecture Hours);•Signaling in telephone networks (03 Lecture Hours);•Switching in optical backbone networks (02 Lecture Hours);•Overview of land mobile communication systems (03 Lecture Hours); •Aspects of mobile propagation channels (02 Lecture Hours);•Signaling and connection to infrastructure networks (02 Lecture Hours); •Mobile radio transmitters, receivers and link design (03 Lecture Hours); •IP-based services over land mobile communication systems (03 Lecture Hours); •Examples of mobile communication systems and technology trends (03 Lecture Hours).Teachers: Indian Railway Adjunct Faculty , Prof. Saswat ChakrabortyReferences: 1. Telecommunication Switching Systems and Networks (2nd Ed) by T. Vishwanathan 2. Digital Telephony by John Bellamy 3. Wireless Communications by T. S. Rappaport.", "page": "EE61010: Railway Signalling And Telecommunication"}]