[{"chunk_id": "7579a47b", "title": "Electrical Technology Viva Questions", "text": "Electrical technology is one subject that haunts every chemsem faccha. Its dreaded claws almost never miss a direct one hit K.O on our C.G. Along with its best arsenal, comes the Grand Viva.\nThis page was created with an intention to do the same. Below are a collection of questions asked during the Grand Viva in Electrical Technology lab. The page is under construction and requires your support to achieve its full caliber.", "page": "Electrical Technology Viva Questions"}, {"chunk_id": "312e69b9", "title": "General Questions", "text": "These questions are commonly asked in almost every Grand Viva and you are expected to be well aware of them.\n# | Question | Relevant Link\n1 | [IMPORTANT] Circuit Diagrams of all of the experiments performed | Link to ET tutorials page\n2 | You might have guessed that all the graphs and instrument/apparatus characteristics are important. Do be aware of every single significance of the graph (Why certain peaks occur, why the falls occur, Why the slope is negative/positve etc) | Link to ET tutorials page\n3 | What does MI and MC stand for in types of Ammeter, Voltmeter etc? Why are the named this way? Explain their differences. | Link to answer\n4 | Normal questions on what the general parts of instruments are. This can cover the connection portion, internal working of a Wattmeter. The physical significance of lines that orginate from a DPST switch.", "page": "Electrical Technology Viva Questions"}, {"chunk_id": "14ff6854", "title": "Questions asked previously", "text": "# | Question | Answer | Professor | Year\n1 | What are the differences between MC and MI type instruments? | Link to answer | Dipankar Debnath | March 2018\n2 | Describe the working principle of a wattmeter. | Link to answer | Dipankar Debnath | March 2018\n3 | What is the role of Choke coil in lighting of the fluroscent lamp? | Link to answer | Dipankar Debnath | March 2018\n4 | What is the role of Choke coil on starter of the fluroscent lamp? | Link to answer | Dipankar Debnath | March 2018\n5 | How can you calculate the fuse rating that has to be used in a given circuit. | Dipankar Debnath | March 2018\n6 | An inductor is given to you, you have to find the value of the inductor. You have the freedom to design the circuit accordingly. All the ratings and values are to be decided by you | Dipankar Debnath | March 2018\n7 | Draw the circuit diagram of a practical transformer and explain all the components. | Link to answer | Dipankar Debnath | March 2018\n8 | Why is the Open Circuit test performed on the Low Voltage side? | Link to answer | Dipankar Debnath | March 2018\n9 | Why is the Short Circuit test performed on the High Voltage side? | Link to answer | Dipankar Debnath | March 2018\n10 | State the difference between linear and non-linear circuit. | Link to answer | Dipankar Debnath | March 2018\n11 | Explain the working of a wattmeter. | Link to answer | Dipankar Debnath | March 2018\n12 | What does the letters on the marking of a wattmeter refer to? | Link to answer | Dipankar Debnath | March 2018\n13 | How to calculate efficiency of an Induction motor | Link to answer | March 2018\n14 | Why use a Loading rheostat instead of a normal rheostat in induction motor experiment. | March 2018\n15 | What happens when a fuse burns out/A phase fails while running a three phase induction motor? | Link to answer | April 2018\n16 | Can a induction motor start if one of the three phases are absent? | Link to answer | April 2018\n* | This attached link covers general portion of single phasing which is a prof's favourite, not in theory, question. | Single Phasing | April 2018\n17 | Discuss the VI characteristics of a Carbon and a Tungsten lamp. (HINT: Carbon has negative _______ coefficient of _______) | Link to answer | April 2018\n18 | Why is the reading on the ammeter not same when repeating the readings from peak to zero value? | Link to answer | April 2018\n19 | Why is the reading on the ammeter not same when repeating the readings from peak to zero value? | Link to answer | April 2018\n20 | What is the unit for Efficacy? | Lumens/Watt | April 2018\n21 | What is Efficacy? (This question wasn't really asked to anyone according to my knowledge, but this article on Wikipedia is worth a read) | Link to answer | April 2018\n22 | How would you differentiate between an AC and a DC ammeter. (3 points are expected from you) | Link to answer | April 2018\n23 | How would you differentiate between an AC and a DC ammeter. (3 points are expected from you) | Link to answer | April 2018\n24 | Order of Lumiunous efficacy and VI power used in the experiment involving four lamps. | April 2018\n25 | Why do we use AC bulbs and other general appliances that run of AC current? Why dont we just go ahead and use a DC appliance? | Link to answer | April 2018\n26 | While performing the experiment for Superposition principle, will you choose a MC or an MI Ammeter? | Link to answer | April 2018", "page": "Electrical Technology Viva Questions"}]