[{"chunk_id": "info_7c7377", "title": "EP60010: Financing New Venture - Quick Facts", "text": "EP60010\nCourse name | Financing New Venture\nOffered by | Rajendra Mishra School of Engineering Entrepreneurship\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n2 4 13 15 20 24 2 EX A B C D P F | 2 | 2 | 4 | 4 | 13 | 13 | 15 | 15 | 20 | 20 | 24 | 24 | 2 | 2 | EX | A | B | C | D | P | F\n2 | 2 | 4 | 4 | 13 | 13 | 15 | 15 | 20 | 20 | 24 | 24 | 2 | 2\n2\n4\n13\n15\n20\n24\n2\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "EP60010: Financing New Venture"}, {"chunk_id": "9a7b7bcf", "title": "Syllabus mentioned in ERP", "text": "Financial InstitutionsFunding the R and D for Refinement of Early Stage InnovationsCost of Project and Means of FinancingFixed assets and requirement of fundEstimation of working capital needTotal requirement of fund and mix of debt and equitySources of EquityOwn capital, Unsecured Loan, Government subsidy, Margin money fromgovernmentEquity funding schemes of commercial bankAngel Funding, Crowdfunding, Venture Capital, Private Equity FundSources of Debt Fund for Capital Assets Term Loan, Deferred payment guaranteeLeasing and Hire-PurchaseMoney market instruments – Bond, Corporate PaperQuasi Equity – Preference CapitalWorking Capital Funding and ManagementFund-based Credit FacilitiesLine of credit with mix of loan against inventories (Cash Credit), against bookdebts (Over Draft), Non-fund credit facilities: DA/DP Letters of Credit – inland orforeign, Bank GuaranteeWorking capital managementFinancing international trade – Export and import creditRisk and Return, Cost of CapitalCost of debt, preference, leaseWeighted average cost of capitalCapital Asset Pricing Model and Cost of CapitalRaising International finance – equity (ADR), debt (ECB), hybrid (FCCB, ) and ExchangeRiskHedging: Commodities DerivativesForeign Exchange derivativesProject Risk AnalysisSources, Measure, and Perspectives on RiskSensitivity Analysis, Beak-even analysisManaging RiskDecision TreeInitial Public Offering of Shares10. Pre-requisitesAttending ‘Foundations of Entrepreneurship’ is a prerequisite for enrolling in thissubject.11. Evaluation processWritten examinations and class tests.12. Name of faculty membersi. Manoj Kumar Mondal. ii. Titas Bhattacharjee.13. Will the Subject Require Appointment of Adjunct Faculty? If yes the Number ofSuch Adjunct faculty:No.14. Do the Content of the Subject Have an Overlap with any Other Subject Offered inthe Institute? If yes give Details:No.15. Suggested readings:Text Book:1. Principles of Corporate Finance by Brealey and Myers et al., McGraw Hill Education (India)Private LimitedFurther Reading:1. Startups! Finding Funding – by Mehul Darooka, Vikas Kumar, Vishwakarma Publications2. Project Finance. Graham D. Vinter, Sweet and Maxwell.3. Introduction to Project Finance. Andrew Fight. 2006. Butterworth-Heinemann.4. Fundamentals of Financial Instruments, Dr Sunil Parameswar, Wiley", "page": "EP60010: Financing New Venture"}]