[{"chunk_id": "info_24d8e2", "title": "ES60002: Waste To Wealth: Microbial Intervention - Quick Facts", "text": "ES60002\nCourse name | Waste To Wealth: Microbial Intervention\nOffered by | School of Energy Science & Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | Spring", "page": "ES60002: Waste To Wealth: Microbial Intervention"}, {"chunk_id": "5ccf8a8e", "title": "Syllabus mentioned in ERP", "text": "Syllabus:Topics and LecturesIntroduction: Glimpses of microbial world towards biofuel/bioenergy production frombiomass,Lectures=2Biomass characterization (Biophysical, Biochemical, Physicochemical, thermal, etc.) ,Lectures= 2Microbial Growth kinetics of pure and mixed culture ,Lectures=4Mechanisms of Reactions: Pathways involved in waste to energy production,Lectures= 5Metabolic and media engineering in biomass conversion,Lectures= 4Microbiology of aerobes and anaerobes,Lectures= 2Mechanism of bioconversion process ,Lectures=2Trends in biofuel production: First, second, third and fourth generation biofuel ,Lectures=2Biohydrogen ,Lectures=1Oleaginous biodiesel production,Lectures= 2Microbial fuel cells ,Lectures=1Bioremediation of heavy metals, xenobiotics and hazardous wastes,Lectures= 2Biofertlizers ,Lectures=3Value added product development and its cost effective recovery,Lectures= 4Conventional and nonconventional techniques adopted for product recovery and itscharacterization,Lectures=3Bioindicators, Biomarker, Biosensor, Bioluminescence ,Lectures=3Toxicity analysis, Environmental safety through Bioagents ,Lectures=2TOTAL 44Reference Books:1. Environmental Microbiology by Raina M. Maier, Ian L. Pepper, Charles P. Gerba, Academic Press Elsiver2006.2. Environmental Biotechnology by Bhattacharyya BC and Banerjee R, Oxford Univ Press, 2007.3. Manual of Environmental Microbiology by Christon J. Hurst, Guy R. Knudsen, Michael J. McInerney, Linda D.Stetzenbach, Michael V. Walter, ASM Press Washington DC, 1997.", "page": "ES60002: Waste To Wealth: Microbial Intervention"}]