[{"chunk_id": "info_20a53d", "title": "ES61007: Renewable Energy Sources - Quick Facts", "text": "ES61007\nCourse name | RENEWABLE ENERGY SOURCES\nOffered by | School of Energy Science & Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | {{{semester}}}", "page": "ES61007: Renewable Energy Sources"}, {"chunk_id": "639bcf45", "title": "Syllabus mentioned in ERP", "text": "SyllabusGeneral Introduction:Renewable and Non renewable energy sources, Global and Indian scenario, Basic heat transfermechanism, Laws of thermodynamicsSolar thermal power :Solar radiation characteristics, flat plate collector, Tubular Collector, solar air collector, solarconcentrator, Applications: Crop drying, Distillation, Water heating, Electric power generationSolar Photovoltaic: PV cell technologies Ist, IInd and IIIrd generations, Electrical characteristics, PV module and array,PV system components and designHydro power : Water turbines, hydroelectric system theory, measurement and components, advantages and disadvantagesof hydroelectric systemWind Energy : Wind turbines, aerodynamics, types of turbines wind energy conversion system, Wind turbine generatortypes. Advantages and disadvantagesGeothermal Energy: Structure of earth, geothermal resources, Exploration of geothermal energy, Utilization: Direct,Electricity, Heat pumpOTEC, Tidal, Wave: OTEC: principle, applications, Tidal: principle, power calculation, Tidal modes of operation,Wave: wave motion, energy conversion, devices applicationsBiofuels: Biomass characteristics and their availability, Biofuel production processes: Biomethane, Biohydrogen,Alcoholic fermentation, Biodiesel, Microbial Fuel Cell, Biomass based steam power plant, combined cycle powerplant, cogeneration plantBooks and References:1. Renewable energy resources. J. Twidell and T. Weir, Taylor and Francis .2. Renewable and efficient electric power systems. G.M. Masters, John Wiley and Sons .3. Renewable energy sources and Emerging technology. D.P. Kothari, K.C.Singal and R. Ranjan,Prantice Hall .4. Renewable energy engineering and Technology. Ed. VV N Kishore, TERI .5. Biofuels Engineering Process Technology by Caye M. Drapcheo, N P Nhuan, T.H Walkar6. Biohydrogen production: Fundamentals and Technology Advantages by D. Das, N. Khanna , C. Nag", "page": "ES61007: Renewable Energy Sources"}, {"chunk_id": "fe06d191", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NC431\nTuesday\nWednesday | NC431 | NC431\nThursday | NC431\nFriday", "page": "ES61007: Renewable Energy Sources"}]