[{"chunk_id": "info_9c1ff2", "title": "ES61002: Solar Photovoltaic Technologies And Systems - Quick Facts", "text": "ES61002\nCourse name | SOLAR PHOTOVOLTAIC TECHNOLOGIES AND SYSTEMS\nOffered by | School of Energy Science & Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n4 2 1 3 EX A B C D P F | 4 | 4 | 2 | 2 | 1 | 1 | 3 | 3 | EX | A | B | C | D | P | F\n4 | 4 | 2 | 2 | 1 | 1 | 3 | 3\n4\n2\n1\n3\nEX | A | B | C | D | P | F\nSemester | {{{semester}}}", "page": "ES61002: Solar Photovoltaic Technologies And Systems"}, {"chunk_id": "0299fc02", "title": "Syllabus mentioned in ERP", "text": "I.Objectives and contentsa) Objectives : To provide the background for conducting research in the field of solarphotovoltic.b) Contents (in 100 to 150 words) : SyllabusRenewable energy technologies, solar radiation and its characteristics,radiation estimation and energy output prediction.Manufacturing of solar cells: Basics of functioning of solar cells, firstgeneration solar cells, p-n junction solar cells. Polycrystalline andamorphous silicon solar cells. Second generation solar cells.Manufacturing of thin film, CdTe and CIGS solar cells. Thirdgeneration solar cells. Overview of a variety of third generation solarcells, manufacturing of dye sensitized and quantum dot sensitizedsolar cells. Nano-structured solar cells. Concentrating PV systems.Measurement and analysis of solar cells. Efficiency, IV measurements,Cell temperature effect, IPCE measurement. Reliability standards andreliability testing methods. Reliability Modeling.PV Systems. PV modules and array, Shading impact, bypass diode,blocking diode. Required equipments for PV systems: battery,inverter, MPPT, sun tracker, charge controllers. Applications of PVsystems: Direct coupled, grid connected, stand-alone or hybridsystems. Design of PV System: Load characteristics, effect oftracking. Sizing of systems for grid connected, water pumping andstand-alone systems. System economics.(Please attach the detailed lecture-wise breakupand/or list of experiments)II.Recommended Text Books : 1. Renewable energy resources. J. Twidell and T. Weir, Taylor andFrancis (1986).2. Renewable and efficient electric power systems. G.M. Masters, JohnWiley and Sons (2004).3. Renewable energy sources and Emerging technology. D.P. Kothari,K.C.Singal and R. Ranjan, Prantice Hall (2011).4. Renewable energy engineering and Technology. Ed. VV N Kishore,TERI (2008).5. Handbook of Photovoltaic Science and Engineering, Ed. AntonioLuque and Steven Hegedus, John Wiley and Sons (2011).6. Nanostructured materials for solar energy conversion. Ed. TetsuaSoga, Elsevier, (2006).10. Reference Books : Latest materials from journals", "page": "ES61002: Solar Photovoltaic Technologies And Systems"}]