[{"chunk_id": "info_1566d0", "title": "EX41004: Nuclear Geophysics - Quick Facts", "text": "ME30640\nCourse name | Mechanics of Human Body\nOffered by | Department of Mechanical Engineering\nCredits | 4\nL-T-P | 3-1-0\nProfessor(s) | Sanjay Gupta [ 1 ]\nVenue(s) | NC 232 [ 1 ]\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | {{{semester}}}", "page": "EX41004: Nuclear Geophysics"}, {"chunk_id": "bf9ae560", "title": "Syllabus mentioned in ERP", "text": "Introduction to Biomechanics: Basic terminology and concept of human musculoskeletal system, anatomy and overall function. Biomechanics of Tissues and Structures of musculoskeletal system – composition, structure and biomechanical behaviour: bone, articular cartilage, muscle, tendon and ligament.; Biomechanics of joints – structure, range of motions, musculoskeletal model of forces: (i) hip; (ii) knee; (iii) shoulder; (iv)elbow; (v) spine. Lubrication of joints. Motion and gait analysis – method, gait cycle, segmental kinetics, engineering approaches to posture analysis. Joint replacement and fracture fixation – stress analysis and basic design approach, failure mechanisms, wear in joint arthroplasty, bone remodelling, biomaterials – properties and application.", "page": "EX41004: Nuclear Geophysics"}, {"chunk_id": "16e9f372", "title": "Concepts taught in class", "text": "Mechanics of Human Body is a subject that applies the concepts mechanical engineering to the human body. We start with the presumption that the human body is a machine with links, joints and actuators. The course topics till mid-semester include:\n• Types of joints Synovial Cartilaginous Fibrous\n• Muscles and Tendons\n• Joints: Knee Shoulder Elbow Hip\nThere is also elaborate discussion on prosthetics, sports biomechanics.", "page": "EX41004: Nuclear Geophysics"}, {"chunk_id": "b52f7b53", "title": "Student Opinion", "text": "This is an extremely interesting subject, the lectures are short, non-boring, and icky(when he tells you about the different ways to tear ligaments). Also, you'll get to play with fibre replicas of different joints and bones.\nFun trivia:\n• There're ligaments in the knee called anterior and posterior cruciate(like \"cruciatus\") ligaments, which have a role in the osteoarthritis pain\n• Most of the joints in our body are unstable, such as the shoulder/glenohumeral joint, and can displace with little disruption.", "page": "EX41004: Nuclear Geophysics"}, {"chunk_id": "00c0296b", "title": "How to Crack the Paper", "text": "• Practice previous years' questions papers, over 80% is repeated verbatim.\n• For shoulder/knee/elbow/hip, remember the following muscles, ligaments,tendons and bones names and types of all joints degrees of freedom", "page": "EX41004: Nuclear Geophysics"}, {"chunk_id": "cb46b61d", "title": "Classroom resources", "text": "All classroom resources are updated on Google Drive and shared by the professor.", "page": "EX41004: Nuclear Geophysics"}, {"chunk_id": "6cce2d85", "title": "Suggested reference books", "text": "Nordin & Frankel", "page": "EX41004: Nuclear Geophysics"}, {"chunk_id": "51b32786", "title": "Additional Resources", "text": "↑ 1.0 1.1 Verified by Angry Bitch on 2016-02-16.", "page": "EX41004: Nuclear Geophysics"}]