[{"chunk_id": "info_d024c1", "title": "Flavour - Quick Facts", "text": "Category | Food and Beverages\nLocation | Outside campus\nCuisines | Buffets, Chinese, Diners, Indian/Pakistani, Italian, Mexican and Vegetarian\nClosed on | None\nTimings | 11AM to 11PM\nRoom Delivery | Yes\nSeating capacity | 80 [ unverified ]\nContact | 8001800384, 3222225122", "page": "Flavour"}, {"chunk_id": "d61fc851", "title": "History", "text": "Flavour-The Battle of Dishes was founded by Mr. Arkajeet Guin with an objective and motive to provide high quality delectable cuisine at reasonable prices. It soon became a popular meeting place for all age groups, starting from college groups to big corporate get-togethers. It was opened on February 14, 2010.\nA government inspection in the summers of 2018 found the food of the restaurant to be unfit for consumption and hence it was closed off. A popular lore claims that dog meat was found in the raid and it was the primary reason for the closing off of flavor.", "page": "Flavour"}, {"chunk_id": "dd34ca7f", "title": "Facilities and cuisines", "text": "A wide range of including but not limited to Indian, Chinese, Italian and On Demand Mexican served along with lip smacking Mocktails and Smoothies in the best of ambience and hospitality, that leaves an impression long after you leave the premises. Cuisines include Buffets, Chinese, Diners, Indian/Pakistani, Italian, Mexican, Delectable Italian, Mexican preparations on requests, Chinese, Tandoorie to mouth-watering Indian food from the heartland of North India.\nThey also have a hookah bar that serves the best of hygienic flavours and a Mini Discotheque complete with a Mixing Station which will ensure that you have the time of your life.", "page": "Flavour"}, {"chunk_id": "88e4dd55", "title": "Catering services", "text": "Flavour is mainly involved in serving authentic Chinese, Mughlai and Continental food at various events and occasions such as birthday parties, marriages, small get-togethers as well as large corporate seminars too. Flavour works according to the requirements of the customer and provides services in accordance with the business, schedule, budget and taste of the clientele. Catering Services include both Off Premises Catering and In House Catering.Their previous clients for the same include Life Insurance Corporation of India (LIC), DTDC, AIESEC IIT Kharagpur, Vodafone India Ltd, Bharti Airtel and many more.", "page": "Flavour"}, {"chunk_id": "32e05abc", "title": "Menu", "text": "The menu can be viewed here .", "page": "Flavour"}, {"chunk_id": "48197c8e", "title": "Room Delivery", "text": "The order can be placed online at http://www.flavour.net.in/.", "page": "Flavour"}, {"chunk_id": "2c771d90", "title": "Payment Methods", "text": "Cash, Visa, American Express and Mastercard.", "page": "Flavour"}, {"chunk_id": "a22b3335", "title": "Special occasions", "text": "See also", "page": "Flavour"}]