[{"chunk_id": "585bcc77", "title": "Football", "text": "Football is one of the 13 sports which is a part of the General Championship during Inter IIT Sports Meet .", "page": "Football"}, {"chunk_id": "5a92ff93", "title": "Format of Play", "text": "Almost all IITs take part in the Inter IIT tournament. The tournament is a (group + knockout ) type competition, conducted in the month of December. The number of participating teams is usually 16, which are divided into 4 groups. Two teams from each group progress to the quarter finals, from where the knockout phase starts. Each team has 11 players on the field. The duration of the matches played at the Inter IIT Level is 70 minutes (35 min each half). A new rule was introduced in 2015 which allows an extra time of 20 mins (10 mins each half) from the knockout stage, in case the teams are all tied at the end of normal time.", "page": "Football"}, {"chunk_id": "d27cce2a", "title": "Infrastructure", "text": "IIT KGP has maintained two full length football fields, which provide enough ground for anyone who wishes to learn this sport. The fields are floodlit; the infrastructure for which has been bestowed upon the institute by TATA. It is for this reason that the sports complex is known as the TATA SPORTS COMPLEX. The maintenance of these fields is supervised by the veteran football coach, Mr. Ardhendu Kumar Ghosh. He is an integral part of all the official football activities in the institute.\nTata Sports Complex", "page": "Football"}, {"chunk_id": "9945413f", "title": "Trials for the Inter IIT Team", "text": "The selection procedure for the final team for the Inter IIT Sports meet is a semester-long process. No specific trials are conducted. Players who are passionate and determined enough to devote 3-4 hours daily at the field make it to the final team. The team list of 16 players is generally released about 3 weeks before the tournament starts. With a view of scouting new talent from the young freshers, a freshers tournament is also conducted in the month of August/September.", "page": "Football"}, {"chunk_id": "8c7d9c15", "title": "Past Performance", "text": "• 48TH Inter IIT 2012(IIT Roorkee) : Lost 2-1 to Hyderabad in quarter finals (captain : Ravish Roy GG ’14)\n• 49th Inter IIT 2013 (IIT Guwahati) : Bronze medal (captain : Shailesh Mohan NA ’14)\n• 50th Inter IIT 2014 (IIT Bombay) : Bronze medal (captain : Navneet Kumar GG ’15)\n• 51st Inter IIT 2015 (IIT Madras) : The sports meet was cancelled at the last moment due to heavy rains in Madras. (captain : Shraddhesh Chandra CE ’17)\n• Team 2015\n• Team 2014\n• Team 2013", "page": "Football"}, {"chunk_id": "aa4671ec", "title": "The Team", "text": "1. Bronze medal at the 49th Inter IIT Sports Meet, IIT Guwahati.\n2. Bronze medal at the 50th Inter IIT Sports Meet, IIT Bombay.", "page": "Football"}, {"chunk_id": "5229d539", "title": "Office Bearers (2015-2016)", "text": "• Secretary, Football Sub-Committee : Hitesh Saini\n• General Secretary, Sports and Games : Sanket Mandal", "page": "Football"}, {"chunk_id": "6effa15d", "title": "Inter Hall Tournament", "text": "The Inter IIT tournament gives players a chance to represent their institute at the bigger level. However, the various halls (hostels) come together every year to compete in the Inter Hall football tournament. The charm and aurora of these inter hall battles is so high that players tend to out- work their benchmarks and set new levels of brilliance. The tournament is held in the spring semester, when all the dust from the past semester Inter IIT tournament has settled down well. The Inter Hall tournament strictly follows the rules and regulations of the Inter IIT Sports meet which is conducted in the month of December.", "page": "Football"}]