[{"chunk_id": "9d7db511", "title": "Fresher%27s Packing Guide", "text": "Congratulations for making it to IIT Kharagpur. If you are coming here and struggling with thinking of what to bring and what not to bring, this guide can help you. This list has been made from experience of staying in campus for two years and realizing what is important or not. The list is not exhaustive and there may be some changes that you may want to make and that's up to you.", "page": "Fresher%27s Packing Guide"}, {"chunk_id": "bc9696fa", "title": "What to bring from home?", "text": "1. Clothes (you can consider bringing a formal shirt and a kurta which may be used depending on your department and activities you are involved in and get a white shirt and black pants if you answer questions in ERP in such a way that you might get NSS)\n2. Umbrella (it might be raining heavily when you reach kharagpur, so better to keep it at hand)\n3. Lab coat (if you have an old one, otherwise you can buy it here, needed only if you are in sections 1-8, having chemistry semester)\n4. Waterproof/water resistant slippers/ sandals (you don't want to go and get them repaired every other week if they can't stand being in water)\n5. Covered shoes (necessary if you are in chemistry semester, some labs require you to wear covered/sports shoes)\n6. Lock and keys\n7. Odomos, anti-insect sprays, HIT, all-out or whatever you need to deal with the multitude of insects in rainy season\n8. Toileteries like soap, shampoo, handwash, soap, detergent, toothpaste, toothbrush, deo, comb, nailcutter etc. (you can buy it from here buy unless you want to go to market straight away, better to carry some)\n9. Things related to your interests (sports gear, musical instruments, kindle, books, etc)\n10. Curtain for a single window (nice to have if you don't like waking up with sun shining on your face)\n11. Food (you'll realize its importance eventually)\n12. Medical kit for common medicines (like painkillers, something for fever or coughs, diarrohea and vomiting, ORS) and band-aids.\n13. Laptop (NOT a necessity but is easier to view slides on laptop than on phone, you can wait till Dusshera holidays to get one)\n14. Clock and calendar (not necessary but its so easy to get used to their presence)\n15. Torch and batteries (for the rare case when electricity isn't available, maybe an hour in a semester?)\n16. Bag for carrying to class\n17. Towels (carry at least 2 for when you need a second one because first one is wet)\n18. Plate, glass tumbler, bowl, spoon, fork and knives (get knife from campus if you travel by air, these things may be helpful when you want to eat in your room or get NSS and have to attend camp in December)\n19. Mobile phone (you may need to frequently check mails for class updates and check Facebook groups for many activities)\n20. Any necessary documents (will be mentioned on front page of ERP, in the sign-in page)", "page": "Fresher%27s Packing Guide"}, {"chunk_id": "2b51bdd0", "title": "What to buy here?", "text": "Some of these you may get from your home, depending on how far you live from campus.\n1. Mattress (available either in you Halls or Tech market)\n2. Pillow\n3. Bedsheets and pillow covers (if getting them from home, buy the largest single sized ones you can so it is easy to tuck in)\n4. Stationery including notebooks, pens, pencils, erasers, scientific calculator, engineering drawing kit (if you are in physics semester or sections 11-20, more information will be given in first ED class)\n5. Hangers, clotheslines, hanging clips, laundry basket\n6. Bucket, mug and soapcases\n7. Dustbin\n8. Shelves and baskets (not necessary but they make organising your room much easier, you have somewhere to dump stuff if you need your able to be clean)\n9. Multiplugs/spikes/extension boards (it depends on your room if you'll need it, some rooms already have more than enough plugs)\n10. LAN cable (if you bring a laptop)\n11. Blankets (it will not be needed till late October or November, can bring from home in Dusshera hoidays)\n12. Sweatshirts (same condition as blankets, you can buy once cold hits and show off the IIT tag)\n13. Pen stand (you might not need it if you are a person who organises their table)\n14. Bicycle (you may get through without it but you will be one of the rare people if you do. There are buses but usually they are too crowded or may be easy to miss. Unless you want to walk at least 2 km everyday to class, a bicycle may be very helpful)\n15. Water-bottle (its the only reason to always carry a bag)\n16. Wall hooks (you may have someone who will add nails in your room in which case you might not need it)\n17. Sewing kit with a couple of threads, some buttons, safety pins and needles (in case you are snickering, knowing a bit of sewing can really help you at times when you lose a button or get a tear in your clothes)", "page": "Fresher%27s Packing Guide"}, {"chunk_id": "32988c79", "title": "Where can you buy?", "text": "Most Halls of Residences (aka hostels) have shops where you can buy. Some temporary shops may be set up near some Halls.\nAlternatively, you can buy whatever you need from Technology Market (just ask anyone where is it or follow Google Maps), also known as Tech Market or TechM.\nIf you can wait for some time or like buying online then all major e-commerce websites deliver to campus.", "page": "Fresher%27s Packing Guide"}, {"chunk_id": "550afc2b", "title": "Extra information", "text": "Electric kettle: Some people think that they should have brought it from home but unless you have extra electric kettles lying around, you can always order from Amazon. It is also possible to get through a whole year or more, without ever using your own electric kettle. Some people borrow their wingmates' kettles whenever need be and return them.\nInduction plates: They are not allowed in most Halls although checking differs from Hall to Hall.", "page": "Fresher%27s Packing Guide"}, {"chunk_id": "290c8b38", "title": "References", "text": "This list was first made by Pankhuri Saxena (HS '22) in her first year and later posted in the group \"IIT Kharagpur Freshers' Official 2018-19\".", "page": "Fresher%27s Packing Guide"}]