[{"chunk_id": "cc6bfed0", "title": "Fresher%27s guide", "text": "Welcome to IIT Kharagpur! Here's some friendly advice on how to get settled in quickly and comfortably.", "page": "Fresher%27s guide"}, {"chunk_id": "0659d621", "title": "Registration", "text": "The registration process in previous years required physical presence of the student on registration days, resulting in long queues for fee payment and verification. With the integration of an online payment gateway with the ERP , fee payment and the registration process can now be completed online and there are no more queues.\nRegistration is defined as formal enrollment in the academic subjects of the semester. Only after registration does the name of the student appear in the list of students of the subject instructor. It is enabled after the fee payment process is completed.\nAdditional subjects and micro-specialization must be indicated during registration process. Freshers can ignore this section as the semester subjects are fixed in the first year.\nAfter the registration is submitted, it will be digitally signed by your faculty advisor . This is indicated in the Student Academic Activities (UG) section in ERP on the right-hand corner of the screen. Once this is done, a duly signed printout of this sheet must be submitted to the faculty advisor before the dates given in the timeline. This formally completes the registration process.\nRegistration must be completed within 10 days of commencement of classes.", "page": "Fresher%27s guide"}, {"chunk_id": "ec88713b", "title": "Packing Guide", "text": "If you are confused about packing and what can you bring, a list has been created here . The list has many items that you may be using during your stay.", "page": "Fresher%27s guide"}, {"chunk_id": "08859b54", "title": "Smart card and medical booklet", "text": "The smart card of a student is the formal proof of studentship at IIT Kharagpur (can be used as a photo identity proof) and also serves as the library card when issuing books from the library . It will be issued to all the students shortly after they are admitted and the document verification (12th Marksheet, JEE Admit Card etc.,) is completed.\nIn case of loss of the smart card , an FIR must be lodged at the nearest police station, and there is a re-issuance fee of Rs. 1000/- for lost card. A copy of the FIR is required for re-issuance of a lost smart card.\nTo avail of medical facilities from BC Roy Technology Hospital , a medical card is required. This card is issued through the halls of residence. It requires a passport size photograph pasted on the top, and the card must be signed and stamped by the warden of that hall. The card must be presented while seeking appointment and consulting doctors and collecting medicines from the pharmacy at the hospital .", "page": "Fresher%27s guide"}, {"chunk_id": "2943f8de", "title": "WiFi and LAN", "text": "See also: Institute Proxies and DC\nIIT Kharagpur has an extensive network of WiFi routers throughout the campus and halls of residence. Connecting to the WiFi routers require a password to connect to the secured SSID WiFi. The password can be set individually by students on their ERP. There are multiple WiFi access points like Campus, Academic, Student, Guest etc and any network could be connected to.\nThe LAN network has DHCP Support, so IPs are dynamically allocated to a connected device upon connection, no static configuration is required. After successful proxy configuration, the Internet can be accessed.\nNote that connecting to the DC network through WiFi is banned, so LAN must be used to download and share content locally.", "page": "Fresher%27s guide"}, {"chunk_id": "8ed1b282", "title": "OneDrive: Cloud Storage", "text": "IIT Kharagpur students are allotted 100GB of cloud storage in one drive, one can access it by signing up here using your Institute email address,\nNote that this email is only available as long as your institute email address is activated (till graduation.).", "page": "Fresher%27s guide"}, {"chunk_id": "d359eb0c", "title": "Important facebook pages/groups", "text": "• Awaaz - Awaaz is the hindi campus media body.\n• Scholars' Avenue - The Scholars' Avenue is english campus media body.\n• Director IIT Kharagpur - It is the official page of Director, IIT Kharagpur\n• Technology Students' Gymkhana - Technology Students' Gymkhana is the hub of the numerous extra-curricular and co-curricular activities in IIT Kharagpur ranging from sports to socio-cultural.\n• clickkgp -it is for photographs of events happen in campus\n• Branding and Relations Cell -\n• Search for your fresher's group and make sure to join it. It will be something like \"IIT Kharagpur freshers 20XX\"\nIf you don't have a Facebook account or want to see updates from all these pages at one place you can use Naarad .", "page": "Fresher%27s guide"}, {"chunk_id": "a3171a70", "title": "Mobile phone", "text": "Airtel and Vodafone seem to be the most preferred networks on campus. During admission time, most of the stores offer SIM cards but it is recommended that the student and their parents go through the various plans and data packs available in West Bengal Circle (note that this is different from the Kolkata telecom circle) from the respective cellular network website so they can make an informed decision and are aware of the various benefits of each one.\nFor residential address proof, the student must get a proof of address letter signed by the hall warden, the format of the letter is available from the respective hall office. This is required as a local address proof.", "page": "Fresher%27s guide"}, {"chunk_id": "95b3810e", "title": "Lectures", "text": "Policies around using mobile phones in classrooms are set by the course instructor. Generally, mobile phones are permissible in lecture halls during regular classes, provided they are in silent mode. Using mobile phones as in browsing or gaming during lectures is frowned upon and will attract the wrath of the instructor and may lead to expulsion from the lecture hall. Restrictions regarding the usage of mobile phones inside the lecture hall will generally be clarified by the instructor along with other course-related information in the first lecture of every course. The instructor's policy is final and binding in this regard.", "page": "Fresher%27s guide"}, {"chunk_id": "84de4ee1", "title": "Examination", "text": "During semester examinations, mobile phones are strictly banned and if brought into the examination hall, must be handed over to the invigilators at the beginning of the examination and collected afterward. Use of mobiles during examinations is considered Unfair Means and will lead to disciplinary action by the Disciplinary Committee . There have been some cases in the past in which students mistakenly kept mobile with them and later on the invigilators found out and then the student was de-registered from the subject. So, remember not to keep the phone with you in exams.", "page": "Fresher%27s guide"}, {"chunk_id": "eb8bf3bf", "title": "Hall and roommates", "text": "From 2014 onward, first year students have been exclusively allotted to a single hall of residence. In 2014 and 2015, male students were allotted Lal Bahadur Shastri Hall of Residence while female students were allotted Mother Teresa Hall of Residence . In 2015, however, girls were allotted Sarojini Naidu / Indira Gandhi Hall of Residence .\nSince LBS has triple occupancy rooms, all first years had to register in groups of three for one room. Though in 2015 the students were allotted rooms with their own department mates.\nHowever, from 2016, the room allocation was reverted to allocating rooms in different halls, with the majority of male students (around 700) being alloted Lal Bahadur Shastri Hall of Residence while the remaining male students were distributed to other halls. The same pattern of hall allotment followed in 2017 as well.\nAs of 2018-19, undergraduate girls are in allocated one of the following Halls: Sarojini Naidu/Indira Gandhi Hall of Residence, Mother Teresa Hall of Residence and Sister Nivedita Hall of Residence. Boys are alloted one of the following in their first year: Lal Bahadur Shastri Hall of Residence, Madan Mohan malviya Hall of Residence, Rajendra Prasad Hall of Residence, Radhakrishnan Hall of Residence, Azad Hall of Residence, Patel Hall of Residence and Nehru Hall of Residence.\nAs of 2025, first year undergraduate girls are allocated in Sister Nivedita Hall of Residence (SNVH/IGH), and boys are alloted Lal Bahadur Shastri Hall of Residence.", "page": "Fresher%27s guide"}, {"chunk_id": "fc286043", "title": "Bicycle and other useful things", "text": "Bicycle stalls are put up around the Tech Market area from where they can be bought easily. The sellers bargain after the parents leave and the dust settles, so make the most out of it. There will be a variety of cycles ranging from Rs. 3500 to Rs. 6000. There is not much need to buy a higher end bicycle with gears and stuff. You can also get a used bicycle from Tech Market or from Cycle Shed owners with price ranging from Rs. 1300 to Rs. 2500. The bicycles with thin tires are easy to maintain, cheaper and easier to ride. Since campus has excellent roads, so there is no need to purchase bicycle with shockers and shock absorbers. One of the best bicycle to purchase is Btwin My Bike White, however, you can only get it from Decathlon Stores or online purchase from decathlon.in or other online retailers like Snapdeal and Amazon. The price of the bike is around Rs. 4,500, the bike has excellent build quality and comes with a lifetime warranty. There are abundant cycle sheds in every hall and cheap cycle repairing shops in every hall.\nOne more thing to note is 'Simpler the design of cycle, the better it is'.\nThe bed and pillow will also be available at the Tech Market . You can also find some temporary shops near MMM hall for beds and all There are a variety of beds ranging from the synthetic one to the wool ones. Though it would be advisable to bring bed and pillow sheets from home. You can also buy hangers, hanging clips, and hanging strings from the Tech Market . Though unfortunately, some items like clothes and sports equipment aren't that up to the mark so its advisable to bring it from home. Other consumables like toothpaste, soap, etc of all recognized brands are available. There is a Big Bazaar outlet and also Gole Bazaar for an even wider variety of options.", "page": "Fresher%27s guide"}, {"chunk_id": "896a16f3", "title": "Mess and food", "text": "The mess serves 4 meals i.e. breakfast, lunch, snacks, and dinner. Breakfast and snacks are the nice meals and it would be advisable not to miss those. For dinner, there are a lot of canteens available and some hotels too. A list of all the eateries can be found . Delivery is available, although students MUST go to the front gate of their hall, as vendors are not allowed inside the blocks in any of the Halls of Residences. Although it won't be wise for students to form a preconceived notion regarding mess food and should try them out for sure.", "page": "Fresher%27s guide"}, {"chunk_id": "0c780a25", "title": "Academics and classes", "text": "See also: How to get deregistered and Central Library\nFirst year lecture classes are held in Vikramshila complex, Nalanda complex and a few in the Main Building . Academics have a high amount of weightage so it would be advisable to take it seriously. There is a CGPA criteria for a lot of things in campus.", "page": "Fresher%27s guide"}, {"chunk_id": "4b41c221", "title": "Question Papers", "text": "You can find previous year question papers here: https://qp.metakgp.org/\nFor resources, check out: https://swgiitkgp.org/resources , KGPellence Mobile App\nFor Mechanical engineering students ONLY, visit http://mech14.weebly.com/ for course materials and books.", "page": "Fresher%27s guide"}, {"chunk_id": "0a00e49f", "title": "Double Major", "text": "See also: Department change and Double Major\nSince session 2024-25, the provision of Double Major has been introduced. This replaced the previous provision of Department Change .", "page": "Fresher%27s guide"}, {"chunk_id": "79a2de41", "title": "UG Curriculum", "text": "The curriculum for admission batch 2024 and later can be found here .", "page": "Fresher%27s guide"}, {"chunk_id": "c201e60e", "title": "Clubs and societies", "text": "Clubs and Societies form an integral part of the life at IIT Kharagpur. They usually held their interviews in the beginning of the semester except for a few. The posters for the interviews would be put up on the mess and around the hall. The intro seminars for the same are also held to give an idea of what the society does. Societies and Clubs allow you to explore your interests and if you don't find any to suit your interest, you can open a new one yourself by contacting the Technology Students' Gymkhana .", "page": "Fresher%27s guide"}, {"chunk_id": "a48618a1", "title": "Technical Activities", "text": "See also: List of student run research groups and Technology Robotix Society § Activities\nIIT Kharagpur provides students ample opportunities to engage in technical activities. Students can join a student run research group , selection for these organizations usually happen in the spring semester. You can also approach a professor asking them for a project in their area of interest. You can search professors by their area of interest using MCMP . You can find when a particular professor is free by using WIMP . Students can also participate in various workshops, hackathons and contests held throughout the year.", "page": "Fresher%27s guide"}, {"chunk_id": "310f23fc", "title": "Sports and Games", "text": "See also: Inter IIT Sports Meet", "page": "Fresher%27s guide"}, {"chunk_id": "6c0acc8f", "title": "Health and Hospital", "text": "See also: BC Roy Technology Hospital , Gym , Swimming Pool and How to claim your medical expenses", "page": "Fresher%27s guide"}, {"chunk_id": "ca3294b2", "title": "E-commerce and courier", "text": "See also: Courier services in the campus\nAll the major E-commerce companies and courier services deliver your order inside the campus. However they are not allowed inside the hall premises and you must collect it from your hall gate or a nearby location. Usually the delivery-guy waits in case till evening at various parts of the campus.", "page": "Fresher%27s guide"}]