[{"chunk_id": "5057ebdb", "title": "G S Sanyal School of Telecommunications", "text": "The School was set up on Nov. 8, 1996 and was named in the honour of a distinguished faculty member and a former Director of the Institute, Prof. G. S. Sanyal. One of our illustrious alumnus and a successful entrepreneur Mr. Arjun Malhotra, had a vision of Telecommunication needs and its growth potential in India. Mr. Malhotra and his wife, Mrs. Kiran Malhotra, made an invaluable endowment for setting up the School of Telecommunications, to function as a center of excellence in the field of communication technology. It was conceived to fulfill the needs of education, research, technology development and training. The school has been assigned a role to collaborate with industry, academia, professional bodies etc. and function through various innovative means. Following are the specific objectives of the School: To take up research activities through M.S., Ph.D. and post-doctoral research programmes in order to keep pace with the advances in the area of telecommunications.To take up sponsored and consultancy projects from industries and government agencies.To offer general and specific tailor made training programmes on current topics.To set up laboratories and test facilities. [ 1 ]\nProf. Saswat Chakrabarti is the current Head of the School .", "page": "G S Sanyal School of Telecommunications"}, {"chunk_id": "1ecf84d3", "title": "Research Areas", "text": "• 5G Communications\n• Chemical and Material Science\n• Cloud RAN\n• Green Communications\n• Large MIMO Systems\n• Mechanical and Structural\n• Millimeter Wave Communications\n• Multiuser Information Theory\n• Physical Layer Secrecy\n• Signal Processing for Communication\n• Union of networking & information theory", "page": "G S Sanyal School of Telecommunications"}, {"chunk_id": "4befaad3", "title": "Research Laboratories", "text": "• Hardware Laboratory\n• Mspc Lab\n• Network Lab\n• Project Lab", "page": "G S Sanyal School of Telecommunications"}, {"chunk_id": "530887b7", "title": "References", "text": "↑ http://www.iitkgp.ac.in/department/GS", "page": "G S Sanyal School of Telecommunications"}]