[{"chunk_id": "eb3e5405", "title": "Great Step", "text": "Great Step is fest organized by the Department of Mining Engineering, Indian Institute of Technology, Kharagpur.", "page": "Great Step"}, {"chunk_id": "c58d6170", "title": "Great Step 2016", "text": "This 9th edition of GREAT STEP was filled with mind churning challenges and informative guest lectures aimed at the expansion of thoughts into the untouched and unexplored reams of the field of Mining. GREAT STEP 2016 successfully organized a total of 15 events along with 3 newly added events this year.\nStarting from 30th September, the three days fest touched a new height of success. It served the very idea of providing a common platform for students, teachers and employers of the field of mining. The inaugural session was started with the introductory lecture by Prof. B K Prusty (President, TMES), Prof. Khanindra Pathak (Head of Department, IIT Kharagpur) followed by the guest lectures of Mr. Harsh Sachdev (Managing Director at S&T Mining Company Pvt. Ltd.), Mr. Subhasis Das (Vice President & Head at Sandvik Mining and Rock Technology, India), Mr. Subhash Niyogi (Marketing Director at Korman Rockster GmbH, AUSTRIA) and Shri Subir Kumar Mukhopadhyay.\nThe presence of our distinguished alumni in the fest took the events to the new heights- Shri K.B. Biswas (Member (ED & MM) of Central Ground Water Board (CGWB) has been appointed as officiating Chairman of CGWB), Mr. P K Sinha (Chief Managing Director at Orissa Minerals Development Company (OMDC)),Mr. Bibhas Chandra (Vice President at Indian Mining Cunsultency Pvt. Ltd.,Kolkata).\nAnd eminent guests are Mr.Deepak Pandya (Dy. General Manager at Coal India Limited), Mr A.K.Srivastav, Mr Sagar Khetia (Executive Assistant and Reverse Mentor on Digital to Senior Leaders,Tata Steel).\nEvents such as Sarvekshan, Petro Case study and Enviro Case study saw a huge participation of the geo-mining students of the country. Geobotics and Industrial Design tested the integration of theoretical and practical knowledge of future leaders of this industry.\nMineac and Quiz Spiel, the quizzing events were undoubtedly the most likely and thoroughly enjoyed events. National Mining Innovation Challenge witnessed the amazing raw talent and creativity of the fresher of IIT Kharagpur through working models and presentations. The overall environment during the fest was encouraging, stirring and exhilarating.", "page": "Great Step"}, {"chunk_id": "62081f81", "title": "Great Step 2016 (New Events Added)", "text": "NATIONAL MINING INNOVATION CHALLENGE\nThink a innovative idea which can be implemented in Mining and Allied Industry .Here you have to present your innovative idea it may be paper or model presentation during event.The idea must have following feature :1. It must be innovative. 2. It must have some application. 3. It must be related to field of mining.\nSARVEKSHAN\nSurvey,Map,Execute….Few important stands of an Engineer…This event provides an insight into planning part of an engineer and hones the planning skill of participants. The event will challenge the students to apply classroom knowledge of surveying in order to solve a real problem. The event will simulate the surveying problems in real conditions.", "page": "Great Step"}, {"chunk_id": "e5a0ca8e", "title": "Great Step 2015 (New Events Added)", "text": "ENVIRO CASE STUDY\nWith the success of other case studies, GREATSTEP came up with ‘Enviro case study’. It is a case study competition where participants have to come up with a sophisticated and complete solution about environmental problems faced in mining industry. Even though this competition was held for the first time, it was participated by large number of teams and a fierce competition.\nOPTIMIZAIRE\nThis was the event where participants were to come up with some peerless solutions to optimize the production in mining and other related industries. Many great ideas were discussed along with some detailed questioning by the judges which gave the participants an insight of its importance in today's industries.\nCREATIVE DESIGN PROBLEM\nIt was an exhibition event where participants were required to present new / innovative ideas in the form of a presentation or model. It saw some of the great presentations of raw talent from the freshers of IIT Kharagpur.", "page": "Great Step"}, {"chunk_id": "5f496f29", "title": "Great Step 2014", "text": "GEOBOTICS\nGeobotics is a manual robotics competition; students are given with an industrial problem which can be solved by using robotic implementation. GREAT STEP witnessed some new innovative designs and strategies by the participating students to overcome the problems given at hand.\nINDUSTRIAL DESIGN PROBLEM\nIt is an overnight event and the problem statement is given on site. The participants have to pass a preliminary round to compete in the final round. The participants seemed enthusiastic and thrilled about this overnight competition as they would be exchanging idea and design of a prototype model in one night and bringing them into reality.\nMINEO CASE STUDY\nMineo case study is a case study competition where participants have to come up with a sophisticated and complete solution about a mining industry situation. The competition is to present the idea in front of panel of 8 judges and answer their question. This event was participated by large number of teams and audience, as it broadens the thinking of a mine planning and development.\nPETRO CASE STUDY\nPetro Case Study is similar to Mineo Case Study but about petroleum industry rather than mining. The participants were equally aware and active about this competition. It turned into a healthy competition and discussion among faculty and students.\nMINESHOT\nMineshot was another new event; an online event and it saw an enormous participation from all parts of the country from mining and non mining students. It was a photography competition where the participants had to upload a mine related photo and the winner would be decided by the number of like the photos gets on Facebook and its relevance. These photos were posted on official page of GREATSTEP 2016.\nMINEINDITE\nMineIndite is yet another presentation competition where the participant has to present a paper developed by themselves about particular topic in the subject of mining engineering. This event witnessed the most number of participants.\nMINEAC\nMineac is a quiz competition where participants form a team. The quiz is based on overall knowledge regarding Mining, Petroleum and Geological Science. The participants as well as the audience showed interest and enthusiasm in this event. This event was very thrilling and ended up with closed gathering discussion between professors and students. The event drew up 150 participants.\nTEE DESIGN\nThis event was aimed at increasing the awareness and importance of mining engineering through T-shirt. The participants were asked to design a T-shirt based on the theme of mining. The design of the T-shirt of GREATSTEP this year is in fact the idea of the winner of this event. The designs were posted on official page of Great Step.\nQUIZ SPIEL\nIt is an online quiz competition with questions pertaining to mining and earth sciences. All the 5 rounds of this event showed the existence of highly qualified mining engineers among us.\nMINE DATA ANALYSIS\nThis was an event on data analytics organized by our alumni who posed a problem from Mining Industry. It saw a huge participation as participants were keen to know about the applications of data analytics in the field of mining.", "page": "Great Step"}, {"chunk_id": "2c42b39b", "title": "Sponsors for Great Step 2016", "text": "Industrial Partne r : Hindustan Zinc Limited\nPlatinum Sponsors: Mahanadi Coalfields Limited (MCL) and South Eastern Coalfields Limited (SECL), Tata Steel & Balasore Alloys\nGold Sponsor: National Mineral Development Corporation (NMDC)\nSilver Sponsors: Sandvik, Orissa Minerals Development Company Limited (OMDC)\nEvent Sponsors: Rungta Mines Limited,GMMCO", "page": "Great Step"}, {"chunk_id": "023647ed", "title": "Sponsors for Great Step 2015", "text": "Platinum Sponsors: Mahanadi Coalfields Limited (MCL) , Tata Steel and Balasore Alloys Limited\nGold Sponsor: South Eastern Coalfields Limited (SECL)\nSilver Sponsors: Eastern Coalfields Limited (ECL), Godavari Power & Ispat Limited (HIRA), Dee Cee Coal Carriers Private Limited, Mine Line Private Limited, Steel Authority of India Limited (SAIL), awxcacon and Hindustan Petroleum Corporation Limited (HPCL)\nEvent Sponsors: Central Mine Planning & Design Institute Limited (CMPDI), Online Mining Exam and Uranium Corporation of India Limited (UCIL)", "page": "Great Step"}, {"chunk_id": "371b13d3", "title": "Sponsors for Great Step 2014", "text": "Platinum Sponsors: TATA Steel, National Mineral Development Corporation (NMDC) and Mahanadi Coalfields Limited (MCL)\nSilver Sponsors: Eastern Coalfields Limited (ECL), Uranium Corporation of India Limited (UCIL), Indian Rare Earths (IRE), Monnet Group and Total Solutions\nEvent Sponsor: National Thermal Power Corporation Limited (NTPC)\nResearch Publication Partner: GIAP Journals", "page": "Great Step"}, {"chunk_id": "0bb5b01b", "title": "2016", "text": "Prof. Khanindra Pathak : Chairman, Technology Mining Engineering Society; Head Of the Department, Department of Mining Engineering, IIT Kharagpur.\nProf. B. K. Prusty : President, Technology Mining Engineering Society, Assistant Professor, Department of Mining Engineering, IIT Kharagpur.\nDebjit Dutta : Vice President, Technology Mining Engineering Society, IIT Kharagpur.\nB. Soumyadeep : General Secretary, Technology Mining Engineering Society, IIT Kharagpur.", "page": "Great Step"}, {"chunk_id": "8dc4646c", "title": "2015", "text": "Prof. Khanindra Pathak : Chairman, Technology Mining Engineering Society; Head Of the Department, Department of Mining Engineering, IIT Kharagpur.\nProf. B. K. Prusty : President, Technology Mining Engineering Society, Assistant Professor, Department of Mining Engineering, IIT Kharagpur.\nAsif Ahmad : Vice President, Technology Mining Engineering Society, IIT Kharagpur.\nVibhas Jaiswal : General Secretary, Technology Mining Engineering Society, IIT Kharagpur.", "page": "Great Step"}, {"chunk_id": "e63f3b97", "title": "2014", "text": "Prof. Khanindra Pathak : Chairman, Technology Mining Engineering Society; Head Of the Department, Department of Mining Engineering, IIT Kharagpur.\nProf. B. K. Prusty : President, Technology Mining Engineering Society, Assistant Professor, Department of Mining Engineering, IIT Kharagpur.\nVishal Agrawal : Vice President, Technology Mining Engineering Society, IIT Kharagpur.", "page": "Great Step"}]