[{"chunk_id": "4b155d25", "title": "How to edit Metakgp", "text": "Welcome to Metakgp, and thanks for considering contributing to this wiki! We are glad to have you. We hang out on Slack , do drop by to say hi :)\nChanging the content on any page or creating a new page is called editing . Editing Metakgp wiki is really easy.", "page": "How to edit Metakgp"}, {"chunk_id": "e4c1a412", "title": "Quick start", "text": "Most of us have never edited a wiki before, and it can be quite scary to change an existing page, or create a new one. Don't worry, it's actually quite simple to do.\n• Go to any page, and click the \"Edit\" link near the left of the search box. This will load Visual Editor, which is a very friendly and intuitive interface for editing.\n• To create a new page, type the name of the page into the search box. The search results will give you an option to create the page.\nBefore making decisions such as how to write acronyms, phone numbers, names of people etc, please visit the Conventions page.'", "page": "How to edit Metakgp"}, {"chunk_id": "0ed0b414", "title": "Where to begin", "text": "Ready to edit, but not sure what you should write about? Here are some suggestions to help you get started:\n• Make a page for your hall, society, club or student group. How many people does it have, and what makes it unique? (eg. Debating Society )\n• Add an article about your research/internship program. Was it interesting? What challenges did you face, and what do other people need to know about it? (eg. BEST )\n• Share some KGP lore. Do you know any interesting things about the place we live?\n• Tell us how to get things done. Did you have to manage a difficult situation - DepC , Summer quarter , or something else? We want to know how you did it!\n• Look at Yellow Pages , and add a phone number for a service – it's really useful to have them all in one place!", "page": "How to edit Metakgp"}, {"chunk_id": "0b86b752", "title": "Finding your way around", "text": "This wiki has a lot of powerful options, but it can be confusing initially. Here are some useful links to know about:\n• Recent changes : This handy link on the sidebar will show you an overview of everything that's changing on the wiki. Really useful to see which pages are seeing activity, and what edits are being made.\n• Talk pages: Every page on the wiki has an associated Talk page, where you can leave comments. This is useful for having a discussion about the content on the actual page. See Help:Talk pages .\n• User pages: You have your own page on this wiki – check it out ! You can add information about yourself, or anything else you want, on this page. For example, many people find it useful to add handy links or snippets of text that they want to be able to access from anywhere, to their user page.", "page": "How to edit Metakgp"}, {"chunk_id": "435be5b2", "title": "Uploading and displaying an image", "text": "This wiki can display any image from MediaWiki Commons . To upload and display a new image:\n• Upload a new image to MediaWiki commons. Make sure you have the rights to this image – either it should be yours, or you need to have permission from the owner.\n• Once you've uploaded the image, you can click on Insert -> Media in VisualEditor to insert the image anywhere on the wiki.\n• If you need to use the image in an infobox, you can refer to the image by filename directly.\nTo transfer images from flickr first change the license to an appropriate free license and then use the flickr2commons tool. You will need to give the userID of the photographer or photoset ID or photo ID to transfer the image. You can get to know your user ID here .\nFor more information, check out MediaWiki image help .", "page": "How to edit Metakgp"}, {"chunk_id": "47a470d8", "title": "Editing source", "text": "Sometimes the Visual Editor doesn't have the full set of features that wiki markup offers. In those rare cases, click on Edit source , and take a look at the excellent and short Wikipedia editing tutorial . If you still face problems, don't hesitate to contact any of the admins . Some pages, like this one, don't have Visual Editor enabled, and you must edit the source.", "page": "How to edit Metakgp"}, {"chunk_id": "1877809d", "title": "Syntax help inks", "text": "• Formatting", "page": "How to edit Metakgp"}, {"chunk_id": "2f22371c", "title": "What is Metakgp about?", "text": "Metakgp is a community driven wiki. KGPians are the editors of Metakgp, and no official organisation or student body controls it. The most active editors generally end up having the largest say in the wiki's policies. To understand why we think this wiki is a good idea, check out Amrav: Why metakgp?", "page": "How to edit Metakgp"}]