[{"chunk_id": "25b5f6d0", "title": "How to Pack for a Foreign Internship", "text": "If you're going abroad in the summer(2-3 months), here are the list of things you might want to pack. Asterisked items are optional.\nAn additional document containing most of the suggestions listed below can be found here . Print out for convenience.", "page": "How to Pack for a Foreign Internship"}, {"chunk_id": "6bf3d9eb", "title": "Before you pack", "text": "• Check your airline baggage rules. In case your travel includes multiple flight operators, baggage rules might differ for each. Typically, a carry in baggage (~ 7 kg) and two pieces of checked-in baggage (~23 kg x 2) are allowed.\n• Check if the bag dimensions are within the allowed limits of the airline.", "page": "How to Pack for a Foreign Internship"}, {"chunk_id": "49fe519b", "title": "Documents", "text": "• Passport. Carry photocopies of visa page, transit visa (if applicable) and bio page (the first and last pages of your passport).\n• Visa documents and a few photocopies of each\n• Letter of introduction and a few copies of it\n• Employment documents and a few copies of it\nKeep all the documents with yourself in your carry-in baggage . You may additionally keep a few copies in your checked baggage.", "page": "How to Pack for a Foreign Internship"}, {"chunk_id": "df8aca9f", "title": "Electronics", "text": "• Universal pin adapter: This is quite important, carry more than one if required\n• * Extension socket\n• Laptop + charger\n• Mobile + charger\n• * Ebook reader\n• * Ethernet cable\n• * Camera and charger\nKeep valuable electronic items with your in your carry-in baggage . You will be required to unpack them during security screening at various airports, particularly the laptop.", "page": "How to Pack for a Foreign Internship"}, {"chunk_id": "fd5d6540", "title": "Cooking and Cutlery", "text": "Depending on whether they're provided or not at your accommodation.\n• A plate, spoon, fork, knife, cup, pair of scissors (all of these should go into your check-in luggage, not carry bag)\n• An induction cooker: In case your accommodation is at a hostel, this could be worth the weight.\n• 2-3 bowls\n• A small (1.5-2L) pressure cooker and valves: In case you're cooking rice.\n• 2-3 cooking utensils/dekchis\n• A pan\n• In case you plan to cook rotis, a wooden/plastic roti roller/maker. You may substitute this with a flat plate and rolling pin. Keep in mind that roti makers are difficult to find abroad.\n• Small plastic containers to store spices\n• Lunch box\n• * Casserole\n• * Clips (metal or plastic) to seal open packets", "page": "How to Pack for a Foreign Internship"}, {"chunk_id": "c8a37b82", "title": "Food", "text": "Depending on availability at the location and weight vs cost consideration\n• Rice (~4kgs)\n• Flour (~3kgs)/Instant Rotis\n• Oats\n• Daal, green gram\n• Spices: chilli powder, coriander powder, turmeric, mustard seeds, cumin powder\n• Salt and sugar\n• Instant Noodles/Pasta/Upma/Poha/Dosa mix\n• Curry masalas/Sambar mixes\n• Pickle\n• You may also carry some onions if you've space, they won't spoil and can save you the hassle of immediate grocery shopping.", "page": "How to Pack for a Foreign Internship"}, {"chunk_id": "3f0e7dcd", "title": "Clothes", "text": "• Pair of formals\n• 2-3 pairs of jeans and some t-shirts\n• Thermal inners, if you're going to a cold country\n• 5-6 pairs of undies, socks and/or inners\n• 2-3 sweatshirts and jackets, gloves, scarfs, mufflers depending on the climate there\n• Formal shoes, regular shoes, sandals, heels\n• 1-2 Bedsheets and pillow cases", "page": "How to Pack for a Foreign Internship"}, {"chunk_id": "6b43bf90", "title": "Personal Care", "text": "• Soap, face and hand wash, shampoo, toothpaste, conditioner, razors, shaving gel, moisturizer, lip balm and other toiletries.\n• Detergent, dish wash, scrubber.\n• Sanitary napkins, if applicable.\n• Hair equipments like comb, clips, bands, clutches, etc\n• Cosmetics, if any.", "page": "How to Pack for a Foreign Internship"}, {"chunk_id": "28a2ca91", "title": "Stationery", "text": "• A book, pen\n• * Journals or diaries\n• * Books", "page": "How to Pack for a Foreign Internship"}, {"chunk_id": "b4af78b6", "title": "Miscellaneous", "text": "• * Needle and thread\n• Umbrella\n• Spectacles/contact lenses", "page": "How to Pack for a Foreign Internship"}, {"chunk_id": "03d3ffc6", "title": "Foreign currency", "text": "This is absolutely necessary to be done before you depart. SBI at IIT Kharagpur can supply Euros, Pounds and USDs. For other currencies, you may have to go to SBI, NRI Branch, Kolkata. You may carry converted currency as a mix of cash and foreign travel card or cash alone. Irrespective of how much balance you've on your card, always carry some liquid cash. In case you're carrying a card, before you leave the branch, make it absolutely sure that they activate it. In case you've a long transit at any other country, please carry the respective currency as well.\nIt is worth noting a few common points:\n• US Dollars are accepted at several airports and can be converted to almost any currency across the world. So, if you think you are being fleeced for the conversion at SBI IIT Kharagpur, you can convert INR to USD and then convert the USD to your destination country's currency at your destination airport\n• The SBI Multi-Currency Foreign Travel Card is very useful. It is accepted throughout the world and can be used at ATMs in your destination country to withdraw the local currency. This allows you to carry enough currency to last you 2 or more months because you can use ATMs instead of having to carry actual currency.\n• A foreign travel card is also very useful for buying food and other necessities during travel. In several western countries, you might even be able to get by without withdrawing cash at all. (Even though having a minimum amount of cash is always recommended)\nHow much cash is enough cash? Depending on the country, and your arrangements, you may have varying expenses such as transit from airport to your accommodation, rent/safety deposits, daily/monthly transit passes, grocery shopping, etc. Take into account these initial expenses and carry enough cash to sustain until your intern payments. Discount for differences in cost of living between India and the respective country.", "page": "How to Pack for a Foreign Internship"}, {"chunk_id": "13a5faa3", "title": "After you reach", "text": "• Immigration and Work Permit: These procedures should be done when you enter the foreign country. You'll be required to produce the visa documents, and will be issued a work permit if they're fine. Be sure to keep safe any immigration document that you might be issued.\n• Getting a SIM card: You may want to obtain a SIM card at the city where you will be living. However, most developed countries have WiFi at public places, transit stations, etc. Most often, your work place will have WiFi too.\n• Opening a bank account: This is mandatory for some employers. Advantages include cashing pay checks, issue of local debit/credit cards, etc. Note that banking in India is different from banking in other countries. So, while opening your account, request the bank to help you get thorough with the particulars.\n• Getting a transit pass*\n• Getting a medical insurance: Don't lapse on this. Most often, your university or employer may have a medical insurance that you may be accommodated into.", "page": "How to Pack for a Foreign Internship"}, {"chunk_id": "3abeb698", "title": "References/See also", "text": "This list is based on personal recommendations. For a more extensive and organized list you may want to consult the following:\nhttps://voiceoftruth.wordpress.com/2008/07/22/basic-packing-list-for-study-abroad/\nhttp://www.antarikshbothale.com/docs/PackingList.pdf\nhttp://oakland.abroadoffice.net/res/saoffice_static_pages/2068/updated%20Study%20Abroad%20Packing%20List.pdf\nIn addition to these, you may be able to find destination country specific packing lists.", "page": "How to Pack for a Foreign Internship"}]