[{"chunk_id": "1f98c0a0", "title": "How to get a certificate from Coursera free of cost", "text": "Coursera is an online learning platform founded by Stanford professors Andrew Ng and Daphne Koller that offers courses, specializations, and degrees. Many of the students are enrolled in various courses there. You will be getting a certificate on completion of the course. But, almost all of the courses ask for money from the users for the certificate and access to assignments and quizzes.\nYou can apply for financial aid if you want the certificate and course materials for free. There is also a 7-day trial and audit option. But, when you can do the whole course and get a certificate for free, who cares about all these? For financial aid, you need to upload an ID proof(ex: College ID, Voter ID, Driving license, etc.) Don't upload Aadhar card as it requires photo verification. Then, you need to describe why you want a financial aid and your future plans after doing the corresponding course in 150 words each. Chill! You can do it :D. Don't copy-paste stuff in the text boxes. Almost all financial aids from students will get approved if it sounds genuine. You may have to wait 15 days for the approval. In this time period, you are not allowed to use the 7-day free trial option. If you do that, your application for financial aid will get cancelled. Keep calm. You can still audit the course. You can have 11 pending financial aid applications at a time.\nNEW SCHEME BY COURSERA from 2020\nAfter Covid-19 pandemic and closure of offline classes in Institutes, many Institutes collaborated with Coursera and Its starts giving one of the any course for free of cost, moreover you will get a certificate also. In starting months of 2020 till September 2020, It was giving all the courses for free of cost, in-fact Specializations course also but this scheme came to end. Now its giving only one course for free and if you want more, then you can apply for finical aid as stated above. You only have to verify yourself as student of collaborated institutes by verifying your account by institute email id in \"For Student\" section(Top most right part of navigation bar of Coursera site) .\nMost Popular Courses in 2017:\nMachine Learning\nNeural Networks and Deep Learning\nLearning How to Learn: Powerful Mental Tools to Help You Master Tough Subjects\nIntroduction to Mathematical Thinking\nBitcoin and Cryptocurrency Technologies\nProgramming for Everybody (Getting Started with Python)\nAlgorithms, Part I\nEnglish for Career Development\nNeural Networks for Machine Learning\nFinancial Markets", "page": "How to get a certificate from Coursera free of cost"}]