[{"chunk_id": "79a027ce", "title": "How to conduct your own event with no money", "text": "This is a wiki version of the article published in The Scholars' Avenue here .\nThe title is actually a misnomer so the writer apologies for that straight off the bat. The writer did have to use his own money for some parts but it is in the process of reimbursement so it is technically correct. This is a rundown of the experiences he had while trying to conduct the event for Quiz Club, IIT Kharagpur with funds from the Gymkhana budget and the problems he faced.\nThe Approval\n• Decide on the event, the dates, the people who are going to work and the other logistics. Don’t decide till the last final detail but just to the point where you know that you have someone in mind for every task.\n• Ping the GSec responsible and see if it will actually be entertained as an idea. This is the part where you can decide if you can conduct the event and let the GSec handle the reimbursement and approvals later on or do it yourself (HINT: Pick Do It Yourself). For certain events, if it has been cleared in the budget in the start of the year, you can skip the next three points.\n• Send a mail to the President, TSG and request a meeting (for any department related activity, change this to HOD, for a hall related activity, first discuss everything with the Hall President and for a project related activity, approach the Project Head or the Dean in charge)\n• Once you convince the person in-charge, the President, TSG in my case, prepare a proper draft of the proposal with the expected expenditure for everything and discuss it with the other people who are going to be a part of the process. Also, finalise the dates in your mind for the event at this moment.\n• Approach the President once again and keep the other people in power aware about your plans and get this proposal approved. Now, you enter the part where your speed is determined by the administrative machinery. The only way you can speed up the next steps is, in the words of the great Prof. Alastor ‘Mad-eye’ Moody, “CONSTANT VIGILANCE!”. My proposal with the identifying information redacted can be found as a template HERE .\nThe Funds\n• The President, after approval will redirect you to a staff in-charge, who in the case of TSG is called Sports Officer In-charge. (There is one such person for every single event, competition or society that comes under the ambit of the TSG and this is a person you want on your side. For department events, go to your department office and ask and help you shall receive.) Approach this person and ask him/her about the budget and show him the approved proposal. He will tell you if the event is feasible under the current remaining budget or not and if it is, will prepare a NOTE SHEET with a formal list of all the things you have received approval for.\n• If the event requires you to have a large part of the amount before the event starts, ask your Staff In-charge to apply for an advance. It requires permission from the DoSA or the Director, IIT Kharagpur based on the amounts that you need an advance for. Any other professor generally just has authority to approve expenditure, not actual disbursement of funds. The rules for Departments and Halls are different and your Department/Hall office will have clearer details for different types of activities. If advance was deemed not necessary (as in the writer's case), conduct the event, use your funds where you absolutely need to or get the vendors to accept payment later whenever possible and take bills for everything. It will be needed later.\n• If approval for advance was granted, your Staff In-charge will get the money in his account and he will give the amount to you to use during the event. You’ll still have to maintain all bills as in the point above and give all of them with clear details on each expense.\nThe Venue\n• Once this money part has been cleared, you’ll need a venue for the event. Looking back at point 4, you should already have the dates in mind. For the venue booking, you’ll need to go to the Academic Section, Main Building, 3rd Floor. You will need a letter signed by a Sports Officer In-Charge or a Professor, mentioning the Date and Time Slots you need the venue for. For certain rooms, you’ll need a clearance stamp on that letter from the CDC as well that they are okay with you taking the room for the said duration. Gymkhana has forms in the mentioned formats that you can take for TSG activities on which a Senior Sports Officer’s Sign or the President, TSG’s sign is required.\n• The Deputy Registrar in the Academic Section will redirect you to another staff for the room booking who’ll finally get you a letter signed and stamped by the Academic Section. You’ll need this to book AV Cell facilities if you need them.\n• For this next part, go to the CWISS Building, right in front of Mining Department and take the AV Cell form from the office and fill and submit it with a copy of the letter you received in the point above. Remember this place, you might have to come here again to get the final bills for AV Cell activities.\nCongratulations, you’ve succesfully completed all the activities needed to be completely ready for the event logistics.\nNow, go ahead with your publicity and get posters printed (GET GST BILLS for Reimbursement) and call your friends, family, wingies, profs, girlfriends, boyfriends, whoever you’re interested in calling and conduct the event.\nAfter The Event\n• Maintain bills on everything that you spent money on, order them and keep proof of winners for competitive events signed by the judges. Prepare a sheet with all these things and add each bill as and when you get them.\n• Once the bills are ready, go and submit it to the staff and explain how it is ordered and you’re done.\nYour part is done. The Gymkhana will take a few millennia before it comes to your file and the accountant there considers it worthy of his time and like Schrodinger’s Cat, your money will either die while stuck in his file or will get cleared one day and you’ll get a happy surprise reminiscent of seeing something working that you’d considered long dead.\nThe writer was joking in the paragraph above( but not for everything :) ).\nTo ensure it doesn’t become a joke on you, go and sit in front of the accountant everyday till he begins to hate your face and decides to clear the file and process it. Go to sleep once you receive your money and dream about the nightmarish day when you had decided to step into this entire process.", "page": "How to conduct your own event with no money"}]