[{"chunk_id": "a9f4bce0", "title": "How to book a room in Academic Complex", "text": "All the class rooms in the Vikramshila Complex, Main Building and Nalanda Complex can be booked to organize events or seminars.\n• Step 0:\n• Contemplate - Plan out your schedule and decide upon the probable date, venue and time of the events to be held. This should be done at-least 15 Days in advance.\n• Proceed to Step 1 if Vikramshila {V1, V2, V3, V4}, F127, F131, F132, F232-236, F244, S301, S302 have to be booked.\n• Proceed to Step 4 if Kalidas, TOAT, Vikramshila Foyer, Gargi and/or Maitreyi have to be booked.\n• Step 1:\n• CDC Conflicts - Make sure the room you want to book is not pre-booked by CDC for internship and placement talks. Visit CDC and request them to release one room on the given date.\n• Letter - Draft a letter addressing the Assistant Registrar (Academic section) requesting to book the required venue, stating the time duration, date and purpose.\n• Signature - The letter would need the signatures of the present Governor of the society as well as that of the President of the Gymkhana in case of a Gymkhana society or just any professor would also do.\n• Step 2:\n• Verification - Take the letter from Step 1 and go to Mr. Joydip at the UG Academic Section of the main building. Check with him if the venue is available on the dates contemplated. Ask him to write a note on your letter to confirm verification. You also have to get it signed and stamped by CDC if you had CDC conflicts in Step 1.\n• If the dates are not available, go to Step 0.\n• If verification is successful, proceed to Step 3.\n• Step 3:\n• Office Order - Take the verified letter to the Secretary, at the Deans' Office on the 1st Floor of the main building, of the Dean of UGS and he will process the request. Collect the office order the next day from Mr. Hazra. You have to submit a copy to CDC if there were CDC conflicts in Step 1.\n// Keep this very carefully, as it is the only proof of a confirmed booking.\n• End. You have successfully booked the desired venue. All you have to do now is show up at the event with the Office Order.\n• Step 4:\n• Letter - Draft a letter addressing the The Registrar requesting to book the required venue, stating the time, date and purpose.\n• Signature - The letter would need the signatures of the present Governor of the society as well as that of the President of the Gymkhana in case of a Gymkhana society or just any Professor would also do.\n• Step 5:\n• Verification - Take the letter from Step 4 and go to the Establishment Section , 2nd Floor, of the main building. A Lady is there who would check if the venue is available on the dates contemplated.\n• If the dates are not available, go to Step 0 .\n• If verification is successful, proceed to Step 6 .\n• Step 6:\n• Office Order - Give the letter at the Establishment Section itself. There is no need to go to the Dean or any other person. Give it to the Lady there. Collect the office order the next day from the Establishment Section.\n// Keep this very carefully, as it is the only proof of a confirmed booking.\n• End. You have successfully booked the desired venue. All you have to do now is show up at the event with the Office Order.\n• Step 7: Audio Visual Cell\n• Get a Requisition Form for AV Cell. Mr. Subrata Mukherjee (Subrata Da) [Phone: +91 9126123728] for Nalanda. Mr. S.K. Sharma [Phone: +91 9933750851] for Vikramshila. In case of any non arrangement/problems contact : Prof. A. Roychowdhury , Chairman AV Cell [Phone: +91 9434306694]\n• Fill it up as per the requirements, like Microphones and Projectors, and submit it.\n• Fees: You may need to pay a small fee to AV Cell for Mics and it's batteries post event. If it's a Non-Working time ( post 5 PM on weekdays or anytime on weekends , you need to pay the attendants of the AV Department). The fee as of 2018 is Rs. 90 per person per hour. (They generally always keep two people, so you can consider the minimum to be Rs 180 per hour). This rate is applicable for Nalanda and Vikramshila.\n//Remind him a few hours earlier on the day of the event about the requirements.\n• Step 8: STOP\n[WARNING : All the steps are subject to availability of the respective people and this may result in you going multiple times to complete any given step.]", "page": "How to book a room in Academic Complex"}, {"chunk_id": "82fbd946", "title": "Extra Funda", "text": "• Subhrata Da can get the AV equipment without the form too provided he trusts the person.\n• Nalanda Booking procedure is not tested so not mentioned.", "page": "How to book a room in Academic Complex"}]