[{"chunk_id": "589ba608", "title": "How to get a visa to Ireland", "text": "Note : Students who visit to do research work in Ireland are NOT called Interns, they are called Visiting Students. This distinction is extremely important to note because it will determine the type of VISA one should be applying for. And in case of any confusion OR before applying for the VISA, consult with your institute/lab/company for the procedure to follow and cross verify it with the Embassy of Ireland, New Delhi by dropping them a mail (They usually reply quickly).\nIf you are going to be a visiting student in Ireland for less than 90 days, then you will need to apply for a short stay visa. Apply well before your end semester exams to avoid hurrying and have ample safety time in case anything goes wrong. Usually, NO original documents are needed to be sent to you by your host institute to submit for VISA application. Color printouts and photocopy works. Check with your institute regarding this.\nThe following documents are required for submitting (not exhaustive, please cross check) :-\n• Color printout of the Invitation/Acceptance Letter stating the duration of the research visit and any studentship you will be getting (Important)\n• Application Letter addressed to the Embassy of Ireland clearly stating your purpose and any important information (1-2 page, typed or hand written)\n• Bonafide certificate from the Institute\n• Proof of funds :- Original Bank statement of the last 6 months (starting from the month you are applying) or Original updated Passbook\n• Proof of accommodation (a printout of email communication works)\n• Flight tickets confirmation printout if you have already booked.\n• Letter of Recommendation (not mandatory but for safety)\nThe above list is a reference and there may be other documents required as per your case.", "page": "How to get a visa to Ireland"}, {"chunk_id": "788a03cb", "title": "Online Application", "text": "Visit the VFS Global Ireland website, navigate to India's page and follow the instructions given to make an application. Visit the INIS page for help regarding VISA and the documents you have to submit.", "page": "How to get a visa to Ireland"}, {"chunk_id": "ca736515", "title": "Helpful Information", "text": "The Embassy of Ireland is very helpful with VISA applications and will get back to you in case there are any missing documents in your application. If required by them OR if you missed submitting an important document at VFS, you can directly speed post the document to the Embassy after consulting with them. Do asks in Facebook groups and forums in case you are stuck with things but anything VISA related should be cross verified with the Embassy. They are the authority in that matter.", "page": "How to get a visa to Ireland"}]