[{"chunk_id": "a2e61e51", "title": "How to prepare for FRM", "text": "(This guide is written by Ritesh Saraogi (HS '17))\nThe Financial Risk Manager (FRM) designation is an international professional certification offered by the Global Association of Risk Professionals (GARP). The candidate is required to complete two levels of practice-oriented exam which covers major topics in finance & risk management and demonstrate two-years' professional work experience in the same field in order to achieve the FRM designation.", "page": "How to prepare for FRM"}, {"chunk_id": "e5448a59", "title": "Examination Pattern", "text": "FRM Part I is a four-hour long exam held 3 times a year. The paper consists of 100 multiple choice questions focusing on tools used to assess financial risk: quantitative analysis, fundamental risk management concepts, financial markets and products, and valuation and risk models.", "page": "How to prepare for FRM"}, {"chunk_id": "b2012e67", "title": "Preparation Material", "text": "'Schweser Notes for FRM Exam' provides sufficient material to clear FRM exam in a compact way. But, the level of sample questions in Schweser is a little below than that of actual FRM examination. So, after going through the book, one must solve sample practice papers for FRM available on GARP website. Many other sample papers are also available online for FRM preparation on websites like Bionic turtle and Edupristine .\nIt is recommended to start studying 3-4 months before exam especially if you don't have previous knowledge of basic finance & quantitative analysis. One may excel with one month of study if he/she has a basic understanding of financial markets and has taken courses like Regression/Time series in college. Last 10-15 days should be devoted to practice the sample papers as there are high chances of minor mistakes given the mathematical nature of questions.", "page": "How to prepare for FRM"}, {"chunk_id": "4258b7a4", "title": "Passing Marks", "text": "There are no fixed passing marks for FRM exam. Passing scores are decided by FRM committee and is generally based on relative performance.\nAlthough FRM does not declare marks of the candidate, it declares quartile for each of the four topics. It is generally recommended to be in top two quartile (i.e. above 50 %tile) in each subject. Else, scoring 3rd quartile (i.e. 25-50 %tile) in one subject should be compensated by a 1st quartile (i.e. 75 %tile above) in other. One must note that this is not the actual criteria, but a guess based on historical results.\nIn terms of no. of questions, one should correctly to solve 70+ questions for smoothly passing FRM exam. However, students solving around 60 question (correctly) passes the exam in general. Always remember that FRM does not penalize wrong answers. So, it is recommended to make a guess and attempt all questions in the paper.", "page": "How to prepare for FRM"}, {"chunk_id": "94bcfa3d", "title": "Topic-wise Guide", "text": "FRM Level I contains four topics with following weightage:", "page": "How to prepare for FRM"}, {"chunk_id": "a6d9b6ab", "title": "Fundamental Risk Management Concepts (20% weightage)", "text": "The topic verifies the candidate's understanding of the basic concepts risk management, recent financial disaster and US credit crisis (2007-08), standard models in finance (like CAPM, Arbitrage pricing etc.) and GARP's Code of conduct.", "page": "How to prepare for FRM"}, {"chunk_id": "72941e94", "title": "Quantitative Analysis (20% weightage)", "text": "This topic is entirely mathematical covering the concepts of probability, regression and time series analysis. It should be easy to cover if you have done such courses during college.", "page": "How to prepare for FRM"}, {"chunk_id": "149d48a5", "title": "Financial Markets & Products (30% weightage)", "text": "This topic deals with the mechanics of derivative products (options, futures, swaps etc.) and markets. This book requires good understanding & should take majority of your preparation time. It is recommended to read Options, Futures and Other Derivatives ( a book by John Hull ) for a deep understanding of the chapters of this topic.", "page": "How to prepare for FRM"}, {"chunk_id": "f0a8d1ef", "title": "Valuation & Risk Models (30% weightage)", "text": "This topic introduces the aspirant to the use of various risk models and valuation techniques used for pricing of options.", "page": "How to prepare for FRM"}]