[{"chunk_id": "6a6512d0", "title": "How to switchover", "text": "Students admitted to the 4-year B. Tech.(Hons.) / 5-year Dual Degree Program through JEE(Advanced) are eligible for Switch Over to the Dual Degree Programs of Engineering Entrepreneurship/Financial Engineering.\n• Such students must have completed all the prescribed course work for the first two Semesters in first attempt with a minimum CGPA of 6.00.\n• Application for a Switch Over must be made by intending eligible students when the notification is made during the Spring Semester of the academic year. The students have to accordingly (i) apply online and (ii) submit signed hardcopy to Academic Section by the specified deadline.\nAn option for Interdisciplinary Dual Degree Programs does not prevent a student to opt for Change of Branch. In such case Change of Branch allotted to a student would prevail over the option of Interdisciplinary Dual Degree Program.", "page": "How to switchover"}, {"chunk_id": "4b788609", "title": "B.Tech.(Hons.) to Dual Degree Switch Over", "text": "• Third year B.Tech.(Hons.) students will have the option to switch over from 4-year B.Tech.(Hons.) to an existing 5-year Dual Degree course (one-way and not the reverse) in the same department, including a choice of specialization, offered at 2-year M.Tech. level in the Department maintaining proportionate distribution of seats.\n• The student must have completed all the curricular requirements upto sixth semester and must not have any backlog subjects with a minimum CGPA of 6.00.\n• The notification for Switch Over will be issued during the Spring Semester of each academic year. The students have to accordingly (i) apply online and (ii) submit signed hardcopy to Academic Section by the specified deadline.", "page": "How to switchover"}, {"chunk_id": "4ed73568", "title": "Options for Dual Degree Specialization", "text": "• Third year Dual Degree students of Agricultural and Food Engineering, Civil Engineering, Electrical Engineering, Electronics & Electrical Communication Engineering and Mechanical Engineering must exercise their choice of particular M.Tech. specialization.\n• Such dual degree students will be allowed to choose any post-graduate specialization approved by the department without any constraint. Alternately if a department fixes the number of seats in each post-graduate specialization with the approval of the senate the allotment of the seats will be made on the basis of choice and CGPA at the end of the 3rd year including the Supplementary/Summer Quarter results as the case may be.\n• Specialization allotment will be made only for those students who are promoted to the next level.\n• The notification for choice of specialization will be issued during the Spring Semester of each academic year. The students have to accordingly (i) apply online and (ii) submit signed hard copy to Academic Section by the specified deadline.", "page": "How to switchover"}, {"chunk_id": "64eda4d0", "title": "References", "text": "UG Regulation Document", "page": "How to switchover"}]