[{"chunk_id": "f9e59c05", "title": "How to install Ubuntu as Dual Boot", "text": "• Prepare the pen drive We’ll need a pen drive of size at least 4 GB. (Label it with your name) Install unetbootin or Rufus USB Installer or Universal USB Installer on your computer. Download Ubuntu 16.04 iso file (Be sure to download the variant that matches your architecture, 32 bit or 64 bit. All laptops less than 10 year old support 64 bit.). Should also be available on the DC++ hub or CIC software repository at 144.16.192.212 . Run unetbootin or Rufus UUI. For 32-bit machines, Suse Studio Image Writer may be used. Right click on the image writer executable file and choose 'Run as administrator'. Follow the instructions carefully to format the pen drive and extract the iso file using unetbootin or UUI in the pen drive to make it bootable. (Very Simple steps)\n• Prepare the computer (Windows) for dual boot Search for “Create and Format disks”. “Shrink” the end (right side) of the partition to avail more than 50 GB. (It will take time) Make sure there are no more than three partitions in Windows.\n• Flash Ubuntu and install Reboot the computer and use the keys F2, Esc or F10 to change the boot order and boot using the pen drive. Select the option “Use Ubuntu without installing” After the OS boots, start the installation by running the software on the desktop. Do not install any third party software and also do not connect to internet. Updates can be done later. Next, next, next until you see the “Install alongside Windows” option. Choose it and proceed. Select location for time. Fill name and computer name. Let the user choose the password. Leave every other option as it is. Proceed. Restart and hope for the grub to appear with entries for both OSes.\n• (If grub menu does not appear, time to do boot-repair) Boot the flash ubuntu again. Connect to Internet and configure proxy. We need to run Boot-Repair . Restart. And Pray for the grub to appear.\n(If grub menu appears but windows is not appearing in Grub) Boot the flash ubuntu again. Click on try ubuntu option Open terminal using ctrl+alt+t (Type)sudo gedit /etc/grub.d/40_custom(then enter) Then a file opens read the instruction properly on the file & then copy paste the below snippet properly menuentry \"Windows\" { set root=(hd0,2) chainloader +1 } (Save the file)ctrl+s & close the window Reboot your system Ref: https://askubuntu.com/questions/485278/windows-8-1-not-appearing-in-grub2-after-installing-ubuntu-14-04/485300#485300 Notes : For any kind of problems during or post installation, please refer to this doc: https://docs.google.com/document/d/1oogiSAm_4iXWFIsGNM0LFvPa5--kvGuoj38sCF8EpuQ/edit?usp=sharing Disable secure boot from BIOS (F2). After installation, instructions for updating and upgrading ubuntu should be given. Never mess with disk partitions unless you know what you are doing. Installation instructions for other Distros are very similar. Be sure to check that you are installing alongside Windows and not removing everything from your disk. Be sure to check the hashsums of the file downloaded and the corresponding hash values given on their website before installation. Both the values should match. You can use freely available Hashcalc for Windows. See Also Metakgp:GNU Linux Install Fest 2016‎‎ Institute Proxies External Links 1. https://unetbootin.github.io/ 2. http://releases.ubuntu.com/16.04.1/ 64bit - http://releases.ubuntu.com/16.04.1/ubuntu-16.04.1-desktop-amd64.iso 32bit - http://releases.ubuntu.com/16.04.1/ubuntu-16.04.1-desktop-i386.iso 3. https://help.ubuntu.com/community/Boot-Repair 4. http://www.pendrivelinux.com/downloads/Universal-USB-Installer 5. http://www.ubuntu.com/download/how-to-verify 6. http://releases.ubuntu.com/16.04.1/MD5SUMS", "page": "How to install Ubuntu as Dual Boot"}]