[{"chunk_id": "5fd097bf", "title": "How to get a department change", "text": "[DEPRECATED] FROM 2024 BATCH, THE OPTION FOR DEPARTMENT CHANGE HAS BEEN ABOLISHED , NOW BEING REPLACED BY DOUBLE MAJOR .\nChange of the branch is a privilege and not a right. Only those students admitted to B.Tech.(Hons.) / Dual Degree / Integrated M.Sc. Programs through JEE (Advanced) are eligible to be considered for a change of branch after the Second (Spring) Semester as per the following rules [ 1 ] :\n• To be eligible for consideration for a change of branch the following conditions must be satisfied:\n• He/she must have completed all the credits prescribed in the first two semesters of the course, in his/her first attempt, without having had to pass any course requirement in the re-examination, supplementary examination and/or summer quarter.\n• He/she must have obtained a Cumulative Grade Point Average (CGPA) not lower than 8.5 at the end of the Second (Spring) Semester.\n• He/she must not have been punished for any offence by the Standing Institute Disciplinary Committee or the Committee on Prevention of Examination Malpractices at anytime prior to the notification for the change of branch.\n• Application for a change of branch must be made by intending eligible students when the notification is made during the Spring Semester of the academic year.The students have to accordingly (i) apply online and (ii) submit signed hardcopy to Academic Section by the specified deadline.\n• Students admitted to 4-Year B.Tech.(Hons.) and 5-Year Integrated M.Sc. programs are eligible for consideration for a change of branch to any Engineering or a Science discipline.\n• Students admitted to a 5-Year Dual Degree Program are eligible for a change to another 5-Year Dual Degree Program only.\n• Students may enlist up to TEN (10) choices of branch, in order of preference, to which they wish to change over. It will not be permissible to alter the choices after the application has been submitted.\n• Change of branch shall be made strictly on the basis of inter se merit of the applicants. For this purpose the CGPA obtained at the end of the Second (Spring) Semester shall be considered. Ties will be broken by the JEE Advanced rank of the applicants.\n• Branch Change\n• In making the change of branch, those applicants shall be first considered who have secured a rank within top 1% (one percent), rounded to the nearest integer, amongst all the first year students in terms of the CGPA scored at the end of the Second (Spring) Semester. Change of branch requested for by such applicants shall be made without any constraint on the number of seats.\n• The remaining applicants may be allowed a change of branch, strictly in order of inter se merit, subject to the limitation that the actual number of students in the Third (Autumn) Semester, in the branch to which the transfer is to be made, does not exceed 110% of the sanctioned yearly intake for that branch.\n• The sanctioned yearly intake of a particular branch shall be the number sanctioned by the Senate as the intake for that branch for the particular year of entry of the applicants. To compute the total number of students in the first year, sum of the sanctioned yearly intake of all the branches will be taken. For the purpose of calculating the actual number of students in a particular branch, the number of students joining the branch is to be considered.\n• The academic section will notify the students and display on the notice boards about the changes of the branch at least 7 (seven) days before the assigned date(s) of the registration of the third (Autumn) semester. However, all changes of branch made in accordance with the above rules will be effective from the Third (Autumn) Semester of the applicants concerned. No changes of branch shall be permitted thereafter.\n• All changes of branch will be final and binding on the applicants. No student will be permitted, under any circumstances, to refuse the change of branch offered.\n• Notwithstanding the provisions of foregoing paragraphs, the Senate may under very special circumstances, permit the transfer of a student from one branch to another in deviation of the above mentioned rules. In each such case the special reasons for which the transfer is permitted must be recorded in the Senate resolution. Such transfers, if any, will be over and above the regular transfers, and their number will not be counted in the computation of ‘Actual Number of Students’ in a given branch.", "page": "How to get a department change"}, {"chunk_id": "89c5a7f6", "title": "See also", "text": "Department change", "page": "How to get a department change"}, {"chunk_id": "82fb5e62", "title": "References", "text": "↑ https://erp.iitkgp.ernet.in/regulation_UG_corrected.pdf", "page": "How to get a department change"}]