[{"chunk_id": "e7ca5090", "title": "How to register for a subject outside your department as Dual Degree Elective", "text": "Dual Degree electives have sanctioned lists that only consist of subjects inside the home department. There is a procedure through which you can get approval to register for subjects outside your department as a dual degree elective. The procedure is outlined below. Note that this process takes time and you should begin this as soon as you can.\n• Email the subject teacher expressing your interest to register for the subject. Make a convincing case. If the professor is known to reject requests of people outside the department from taking their course, put in some extra effort (eg: Meet them in person)\n• If you have the subject teacher's approval, you can begin the process\n• Once you have paid your fees, visit Academic > UG > Student Academic Activities (UG) , and click on Apply for Pre-Requisite Waiver . Enter your subject code. If your subject has prerequisites that you haven't completed, then apply for the waiver and email the subject teacher for approval. If the subject doesn't have any prerequisites OR you have completed all prerequisites, go to step 6.\n• After the subject teacher's approval of prerequisite waiver, the subject's department HOD will have to approve the same\n• Once the prerequisite waiver has been approved by both subject teacher and subject department HOD, you can begin the process in your department\n• Email your faculty advisor expressing your intention to take this subject outside your department as a Dual Degree Elective. If your faculty advisor doesn't approve these requests generally, you will have to put in some extra effort, yet again.\n• If your faculty advisor consents, and approves your request, the next stop is your department's HOD. ERP sends them a notification email once your faculty advisor has begun the process. You can email the HOD to make sure they get the message.\n• Once your HOD has approved the request on ERP, the next stop is the subject teacher, yet again. This will be the last step.\nPrerequisite waiver: Subject Teacher -> Subject Department HOD\nDual Degree Elective outside home department: Faculty Advisor -> Home Department HOD -> Subject Teacher", "page": "How to register for a subject outside your department as Dual Degree Elective"}]