[{"chunk_id": "250ab596", "title": "How to get a visa to USA", "text": "A large number of students go to United States for research internships, further studies or conferences. Obtaining a VISA is the second most important step after securing an offer confirmation from your host institution or organization. Of all the countries, United States has the most time consuming visa process.\nBelow we describe the process of obtaining different types of visa.\nPlease note that the information below (especially the payment amounts) may become outdated. Please cross-verify with the linked sources.", "page": "How to get a visa to USA"}, {"chunk_id": "b90039cb", "title": "B1/B2 visa", "text": "Credit: Vivek Rai (BT '17)\nB1/B2 visa is the tourism and business visa for temporary visit. This is the visa you need if you are visiting USA for a conference or competition. The consulate office website has given comprehensive information on the B-visa process which includes filling up an online form, paying the visa fees, scheduling an appointment, giving your biometric information and finally appearing for an interview at consulate office. The whole process typically takes 2 to 4 weeks.", "page": "How to get a visa to USA"}, {"chunk_id": "fd4be06c", "title": "Documents", "text": "During the interview at the consulate office you need to prove the legitimacy of your visit, and it is recommended that you carry the following documents before the interview:\n• Invitation Letter\n• Bonafide certificate\n• Latest resume\n• Official transcript\n• Bank Statement\n• Flight tickets (if booked)", "page": "How to get a visa to USA"}, {"chunk_id": "24ca8342", "title": "Costs", "text": "• The visa fee is 160 USD which can be paid through NEFT, IMPS or cash-deposit at select banks. The bank details are available after scheduling the appointment.", "page": "How to get a visa to USA"}, {"chunk_id": "936562bd", "title": "J1 visa", "text": "Credit: Vivek Rai (BT '17)\nJ1 is an Exchange Visitor visa. It is a non-immigrant, temporary visa issued to trainees or interns for a fixed period of time. If you are currently studying and are accepted by an institution or company in United States for summer, J1 is the most appropriate visa type for you. J1 visa requires a government authorized sponsor agency. A sponsor agency is simply a third-party organization which will handle all the documents and necessary paperwork for your visa at some cost. Typically, your host institution itself (if a major university) will be a sponsor, otherwise would advise you to contact a different sponsor. The overall visa process, depending on your type, might take anywhere between 1 to 3 months.\nThe first step is to get in touch with a sponsor organization. The HR manager of your host institution will have specific advise on this matter. Once you have a sponsor ready to handle your application, the following steps follow:\n• Obtain the invitation letter from your institution.\n• Complete Trainee/Intern Agreement (TIA) and Trainee/Intern Placement Plan (TIPP) agreements. Your sponsor may request additional documents like bonafide certicate and resume.\n• Your sponsor organization's coordinator or your inviting faculty will schedule an interview to fill your SEVIS record.\n• Sign the agreements as necessary.\n• The sponsor will process your DS2019 form and send to you by post. The mail will also contain additional documents like a signed TIPP plan (also called DS 7002 form ), a social security application letter and other documents (insurance, for example).\n• Complete online DS160 form , pay SEVIS fee using the details provided by your sponsor. Retain printout of everything.\n• Schedule a visa appointment. An additional appointment for biometric collection is also scheduled.\n• Visit the consulate/embassy (in Kolkata or as mentioned in your online forms) with the documents.", "page": "How to get a visa to USA"}, {"chunk_id": "076fc890", "title": "Documents", "text": "• DS 2019\n• DS 7002\n• Invitation/Offer letter\n• DS 160 confirmation printout\n• SEVIS fee payment receipt\n• Social Security Application letter\n• A copy of bank statement (with sufficient balance) - suggested\n• Bonafide certificate - suggested\n• Resume - suggested", "page": "How to get a visa to USA"}, {"chunk_id": "f2f219b1", "title": "Costs", "text": "• Your sponsor will typically require a processing fee payment before sending your DS 2019. It can vary anywhere between 500 USD to 2500 USD. It is typically paid through credit card or international wire-transfer.\n• SEVIS fee is 180 USD. It can be paid only though a credit card.\n• Scheduling an appointment requires another 160 USD. It can be paid through NEFT, IMPS or cash-deposit at select banks. The bank details are available after scheduling the appointment.", "page": "How to get a visa to USA"}, {"chunk_id": "c1d36d65", "title": "Time", "text": "After receiving your DS 2019, it can take anywhere between 2-3 weeks. Typically, the nearest appointment is available after 4-6 days and once your visa is issued, it will take another week before you can collect it. The time before DS 2019 can vary depending on how fast you complete the formalities. However, there can often be delays because of additional administrative processing called by the consul officer before a visa is issued. If additional processing is required, add another 4 weeks of time.\nTotal: 1-2 months for visa.\nPlease plan well before.", "page": "How to get a visa to USA"}, {"chunk_id": "97332130", "title": "F1 visa", "text": "Credit: Debanjana Chakraborty (CY '17)\nF1 is a non-immigrant, temporary visa required by those aiming for studying and getting a degree (Bachelors/Masters/Doctorate) from a US university. One can apply for an F1 visa after getting an official acceptance/invitation letter and the I-20 form from a US university approved by SEVP (Student and Exchange Visitor Program). The I-20 form you receive will contain all the required information for starting your visa application i.e. SEVIS ID; school name, code, address and official contact; course and duration of study; estimated costs and funding source(s).\nThe F1 visa application process is quite similar to that of J1 visa and is relatively easier to get. The only difference is that in case of F1, you will receive I-20 form from the concerned university instead of DS2019 form. Students accepted for a doctorate program may get a DS2019 form or I-20 form from the university, depending on the nature of program and slots available for J1 visas in the university. In that case, it is best for the student to get in touch with the OIS (Office of International Services) of the university and figure out what type of visa will be much more suitable and relevant. The first step is to obtain the official admissions offer letter and I-20 form from the university or research institute/centre. If the university is fully or partially funding your tuition fees and living expenses, that will be mentioned in your offer letter and I-20 form. In case, funding is arranged from personal resources or third party organization, the same should be notified to the university after you accept the offer with required documents as per university guidelines\n• After you obtain the form, you need to pay the SEVIS fees (generally known as I-901 fee). The present fee is 200$ and payable online only through credit card. After payment, obtain and take a printout of SEVIS I-901 payment confirmation slip. Please note that it might take 2-3 working days for your payment to be processed and acknowledged\n• You need to fill up the DS-160 form before paying the visa appointment fees and making an appointment. Please ensure that the information you fill is correct. Obtain and take a printout of the DS-160 confirmation slip, which will be required during your visa interview.\n• You can now proceed with visa appointment fee payment and date scheduling here . You need to pay 160$ for appointment confirmation and schedule two date- one for biometrics followed by interview at the nearest consulate. Obtain and take a print out of the appointment confirmation, which you require for both biometrics and consulate interview. The amount can be paid through NEFT, IMPS or cash-deposit at select banks. The bank details are available after scheduling the appointment", "page": "How to get a visa to USA"}, {"chunk_id": "31229fbc", "title": "Documents", "text": "• I-20 form\n• Admissions offer letter (both from the graduate school and specific program, if any)\n• SEVIS I-901 payment confirmation slip\n• DS-160 confirmation printout\n• Appointment confirmation slip\n• Proof of immediate availability of sufficient funds to cover tuition fees and living expenses for the first two semesters (bank balance statement, sanctioned loan documents, funding approval letter from third party organization or sponsors etc.). For those who are receiving full funding from the university, the I-20 form and offer letter will suffice.\n• Proof of English proficiency (highly suggested in case your I-20 form does not mention about the same; TOEFL, IELTS score or bonafide certificate from your current institute if it follows a English-medium curriculum)\n• Recent academic transcripts and backlog clearance proof, if any (suggested)\n• Your resume (suggested)\n• Any handbook, prescribed by your university, with detailed description of your coursework and your program specifics (suggested)\n• Previous US visa details and name and references of contacts established in US, in case you have been to US before through other visa type (highly suggested)", "page": "How to get a visa to USA"}, {"chunk_id": "36041585", "title": "Notes", "text": "Preparing for F1 visa interview After you receive your I-20 form, it might take at least 4-5 weeks or as long as 2-3 months before you obtain your visa. It is recommended that you start the application process as soon as you receive the official documents. However, you need to keep certain things in mind.\n• If your study program and degree is unfunded or partially funded, you need to arrange for suitable financial resources and veritable proof for the same before your visa interview. Do not rely on future arrangements and never try to assure the same to the interviewing officer. Have your funding sources and documents ready.\n• You need to check whether your program of study or course falls under TAL (Technology Alert List) or related to any of the listed subjects. You can do so by contacting the OIS or any senior of yours enrolled in similar course in US. If yes, then you should apply for visa as soon as possible since your application can be subjected to additional processing (221g) and your visa may be delayed for another 4-5 weeks. See administrative processing section.\n• You need to prepare for the interview. Any reluctance or lack of confidence while answering the interviewer’s questions can lead to rejection of your visa. You can find a list of few questions asked to previous applicants here. You can prepare your answers beforehand and choose your words carefully to avoid any kind of conflict in your answers.\n• Since F1 is a non-immigrant visa, you need to assure the interviewer that you are not planning to stay in US beyond your estimated period of study or training. Avoid saying things like you wish to settle in US or you are looking for a permanent job there.\n• You need to be well acquainted with information related to F1 visa, your university and your study program, your future career plans, how well aware you are about the living conditions and location of your university.", "page": "How to get a visa to USA"}, {"chunk_id": "9a44aa53", "title": "Additional Processing", "text": "In case the consul officer sends your visa application for additional administrative processing, your passport will be returned along with a 221(g) letter asking for additional documents. Typically, the consulate requires you to submit your resume along with a word document containing answers to a few questions (as specified in document) to a consulate's email address ( [email protected] ). Based on your responses, they will process your application and approve the visa. Once approved, you will asked to drop off your passport the Kolkata VAC for final visa processing.\nThis is a time consuming step and can take anywhere between 3-6 weeks. It is difficult to predict whether your application will go for additional processing but a good indication is whether your field is included in Technology Alert List or not. Even a loose association with the mentioned field might require the processing.", "page": "How to get a visa to USA"}, {"chunk_id": "6d60e82d", "title": "Visa Application Center", "text": "The best way to reach the VAC office is to take a local train to Santragachi railway station . It takes approximately 2 hours from Kharagpur. From there, take any bus to Exide/Minto Park (almost all buses go to Exide) and get down at Shakespeare Sarani, Birla Planetarium, or Minto Park --- takes approximately half an hour. You can walk to your destination from there.", "page": "How to get a visa to USA"}, {"chunk_id": "a97962f5", "title": "U.S. Consulate", "text": "It is recommended to reach Howrah Railway Station and take a cab from there to directly reach the consulate. Also, if the appointment is in early morning and one does not wish to leave early, a guest room can be booked at IIT Kharagpur's Kolkata Guest House for an overnight stay.", "page": "How to get a visa to USA"}, {"chunk_id": "b1f4efc7", "title": "See also", "text": "• How to get a visa to Canada\n• How to get an official transcript\n• How to get a Bonafide Certificate", "page": "How to get a visa to USA"}, {"chunk_id": "17997374", "title": "External links", "text": "• B-visa\n• Step-by-step non immigrant visa information", "page": "How to get a visa to USA"}]