[{"chunk_id": "1e171058", "title": "How to write a recommendation letter", "text": "Credit: Vivek Rai , BT '17\nRecommendation letters are the most critical part of any graduate school application. Admission committee evaluate the applicants profile based on what the recommenders have written about the candidate and whether that corroborate the description given by the student in their statement of purpose. Typically, universities require 2-3 recommendations per application. Some may require specific people such as professors, thesis advisors to be a compulsory letter writer.\nIdeally, the letter is to be written entirely by the faculty in a confidential manner with the knowledge that it is going to be a good or great letter. However, many faculty will ask for a draft letter written. This guide will illustrate a few examples of such drafts which one may adapt for their own requirements.", "page": "How to write a recommendation letter"}, {"chunk_id": "84ec9be6", "title": "Traits of a good letter", "text": "This section requires expansion .", "page": "How to write a recommendation letter"}, {"chunk_id": "da90d22b", "title": "Letter for PhD (#1)", "text": "John Doe Professor, [department] [division] Indian Institute of Technology Kharagpur [email] November 15, 2016 Re: To Whom It May Concern I am pleased to recommend [applicant] for his PhD program of interest at your institution. I am a Professor in the [department] at Indian Institute of Technology Kharagpur, one of the leading engineering institutes in India. As an educator and mentor to [applicant], I have known him for the past 2 years. I can rate him as being amongst the top 2% of students that have passed through my laboratory for short periods of time, and amongst the top 5% of students that I have seen ready to pursue a PhD programme. I taught [applicant] in [course] class during his junior year, and he excelled in his performance securing highest grade (EX) among an extremely group of senior students. Later, he expressed interest to work in my lab for his undergraduate project on analysis of protein knots and is continuing to work on it as his final year thesis, learning about sequence analysis, functional annotation, and mathematical biology. [applicant] has shown the sincerest form of dedication towards his class, assignments and now his thesis project. He meets frequently to discuss his progress with the questions, and comes up with well-researched approaches for solving them--often going beyond the lengths I would expect of him. He is a sharp, self-motivated individual with commendable scientific attitude and eagerness to learn. His work is well organized and highly presentable. In his bachelor’s project, [applicant] focused on formulating his research statement for a bioinformatics analysis of protein knots. My lab had solved a protein structure which potentially formed a knot structure was important in its enzymatic activity. We wanted to find out if the knotted structure confers structural or functional advantages, and if yes, what is the possible mechanism. [applicant] used his time to survey literature, create datasets, and create tools and pipelines to explore these objectives. His investigation led him to a few proteins that might be misclassified in reported literature. At the end of the junior year, all students were asked to make a final presentation of their project, and it was clear that [applicant] stood head and shoulders above the others in terms of what he had got done. Currently, [applicant] is working on verifying those leads. At a personal level, I would describe [applicant] as curious by nature, who does not hesitate in reaching out or discussing questions with new people. During his undergraduate project, he added new improved methods for knot detection that could potentially reveal misclassifications due to improved numerical precision, in collaboration with external an external researcher. [applicant] also takes active interest in communicating his work and has given several talks related to his work in the intra-department Journal Club seminars. [applicant] has always expressed his desire to pursue a career in computational biology, specially approaches that integrate multi-omics, statistics, and methods development. He is an academically strong student (in top 2 of class) with demonstrated ability to pursue wide variety of problem. Overall, [applicant] unquestionably has my strongest recommendation. I am positive that he can adapt to the challenging environment you have to offer him and contribute significantly to your research. Not to mention, he will also share his energy, enthusiasm, positivity, and talent with his peers and collaborators. Please do not hesitate to contact me ([email]), should you require any additional information. Wishing him a bright future.", "page": "How to write a recommendation letter"}]