[{"chunk_id": "88aed9af", "title": "How to prepare for GATE", "text": "This guide was originally written by Tushar Singh Soam (BT '17), Electronics and Communication section was added by Ashish Manmode (EC '17), Mechanical section was added by Vivek Narsaria (ME '17) and Mining Section was added by Vibhas Jaiswal (MI '17)\nThe Graduate Aptitude Test in Engineering (GATE) is an all- India examination that primarily tests the comprehensive understanding of various undergraduate subjects in engineering and science. The score is used for admissions to various post-graduate education programs (e.g. Master of Engineering, Master of Technology, Doctor of Philosophy) in Indian higher education institutes, with financial assistance provided by MHRD and other government agencies.", "page": "How to prepare for GATE"}, {"chunk_id": "3ad78c14", "title": "Syllabus", "text": "Though it is revised a bit at regular intervals but broad outlines remain almost the same. It consists of the following three sections.\n• Biotechnology (~72%):\n• General Biotechnology\n• Biochemistry\n• Microbiology\n• Molecular Biology and Genetics\n• Analytical Techniques\n• Immunology\n• Bioinformatics\n• Recombinant DNA Technology\n• Plants and Animal Biotechnology\n• Bioprocess Engineering\n• General Aptitude (Common for all streams) (~15%):\n• Verbal ability\n• Numerical ability\n• Engineering Mathematics (Stream specific) (~13%):\nA long list. It’s better to check this from host institute’s GATE website.", "page": "How to prepare for GATE"}, {"chunk_id": "e40fe5b5", "title": "Preparation strategy", "text": "It depends on how serious a student has been throughout the courses that he/she has been taught during the regular coursework. Given the worst case scenario, it will still not take more than 2 months to go through all the required concepts. Considering the syllabus, GATE (Biotechnology) paper can be divided as follows:", "page": "How to prepare for GATE"}, {"chunk_id": "b6d29e7d", "title": "Aptitude + Mathematics", "text": "Difficulty level -> Average\nThis is the easiest portion of the exam, need not waste much time on this to prepare but ensure you get it all right in exam. Solve as much question as possible from previous year GATE question papers or sample papers available. Basic level questions from Mathematics – 1 & 2 (1 st year) will be asked.", "page": "How to prepare for GATE"}, {"chunk_id": "d3fab8c7", "title": "Numerical from Biotechnology", "text": "A good amount of quantitative questions will be asked from Bioprocess engineering, Analytical biotechnology, Enzymes biotechnology and Classical Genetics combined with simple probability concepts. One needs to be thorough with the concepts (which are actually very few) from above topics and a bit of practice leads to a very good score in this section. Good score in this section makes a big difference to the overall score obtained since generally biotechnology students lack mathematics background at intermediate level.", "page": "How to prepare for GATE"}, {"chunk_id": "2643e894", "title": "Data Interpretation", "text": "Some questions are set to test the inference skills of students. These questions may or may not require the background knowledge of the domain they belong to but require critical analysis of the situation in the problem. These question can be compared to Logical Reasoning section of other standard aptitude tests.", "page": "How to prepare for GATE"}, {"chunk_id": "de6a9ece", "title": "Factual Biotechnology", "text": "There are some questions in paper which test the amount of literature one has consumed. There isn’t any specific strategy for such types of questions, the best advice is just to keep revising the topics under syllabus as much as possible from different sources.", "page": "How to prepare for GATE"}, {"chunk_id": "3d40405b", "title": "Study material", "text": "Class notes, any competitive book for preparation of GATE, Biotechnology. Other standard books are Lehninger for Biochemistry, Prescott for Microbiology, Janeways for Immunology etc.", "page": "How to prepare for GATE"}, {"chunk_id": "1e39f4de", "title": "Syllabus", "text": "Every year the host institute provides the syllabus for GATE, but the general topics that are covered remains the same. For the current year syllabus students are advised to visit the GATE website.\n• Subject (~85%) Engineering Mathematics Networks, Signals and Systems Electronic Devices Analog Circuits Digital Circuits Control Systems Communications Electromagnetics\n• General Aptitude (~15%) Verbal Ability Numerical Ability", "page": "How to prepare for GATE"}, {"chunk_id": "8844c955", "title": "Preparation Strategy", "text": "If the student have attended and taken up all the coursework seriously for previous 3 years, then preparing for GATE wont be a tough ballgame. Even if that's not the case dedicated preparation for 2 months will do the task.", "page": "How to prepare for GATE"}, {"chunk_id": "b8fa9c22", "title": "Study Materials", "text": "Following standard textbooks with self-study helps in the overall preparation.\n• Alan V. Oppenheim for Signals and Systems,\n• Benjamin C. Kuo for Control Systems,\n• Network analysis by Valkenberg,\n• Microelectronic Circuits by Sedra,Smith,\n• Digital Design by Morris Mano.", "page": "How to prepare for GATE"}, {"chunk_id": "b4c41282", "title": "Syllabus", "text": "Visit GATE website for current year detailed syllabus.\n• Stream Specific Topics (~85%) Engineering Mathematics – Linear algebra, calculus, differential equations, complex variables, probability and statistics, numerical methods Applied Mechanics and Design – Engineering mechanics, mechanics of materials, theory of machines, vibrations, machine design Fluid Mechanics and Thermal Sciences – Fluid mechanics, heat transfer, thermodynamics, advanced thermo-fluids Materials, Manufacturing and Industrial Engineering – Engineering materials, casting forming and joining processes, machining and machine tool operations, metrology and inspection, CIM, inventory control, operations research\n• General Aptitude Topics (~15%) Verbal Ability - English grammar, sentence completion, verbal analogies, word groups, instructions, critical reasoning, verbal deduction. Numerical Ability - Numerical computation, numerical estimation, numerical reasoning, data interpretation", "page": "How to prepare for GATE"}, {"chunk_id": "f071f091", "title": "Preparation Strategy", "text": "You can give preference to the subject in the following order:\n• Production, Industrial\n• Thermodynamics, Fluid mechanics, HMT/RAC\n• Strength of material, Theory of machines, Machine design\n• Material science, Power plant, IC Engine, Mechanics", "page": "How to prepare for GATE"}, {"chunk_id": "1311babc", "title": "Study Materials", "text": "Following standard textbooks with self-study helps in the overall preparation.\n• Thermal Sciences - Engineering Thermodynamics by P. K Nag, Thermodyanmics by Cengel\n• Fluid Mechanics - Introduction to Fluid Mechanics & Fluid Machines by S. K Som\n• Theory of Machines - Theory of Machines by S S Rattan\n• Strength of Materials - Strength of Materials by Gere & Timoshenko\n• Manufacturing - Production Technology: Manufacturing Processes, Technology and Automation by R.K. Jain\n• Heat Transfer - Heat Transfer by Cengel and Holman\n• Machine Design - Design of Machine Elements, By V Bhandari\n• Industrial Engineering - Industrial Engineering and Management by O P Khanna", "page": "How to prepare for GATE"}, {"chunk_id": "8485bebb", "title": "Syllabus", "text": "Syllabus gets a revision from time to time. So keep yourself updated from the official GATE website.", "page": "How to prepare for GATE"}, {"chunk_id": "b5ae1969", "title": "I. Subject (~70%)", "text": "• Mine Development - Methods of access to deposits; Underground drivages; Drilling methods and machines; Explosives, blasting devices and practices\n• Mine Surveying - Levels and leveling, theodolite, tacheometry, triangulation; Contouring; Errors and adjustments; Correlation; Underground surveying; Curves; Photogrammetry; Field astronomy; EDM and Total Station; Introductory GPS\n• Engineering Mechanics - Equivalent force systems; Equations of equilibrium; Two dimensional frames and trusses; Free body diagrams; Friction forces; Particle kinematics and dynamics; Beam analysis\n• Geomechanics - Geo-technical properties of rocks; Rock mass classification; Instrumentation and stress measurement techniques; Theories of rock failure; Ground vibrations; Stress distribution around mine openings; Subsidence; Rock bursts and coal bumps; Slope stability\n• Ground Control - Design of pillars; Roof supporting systems; Mine filling\n• Mining Methods - Surface mining: layout, development, loading, transportation and mechanization, continuous surface mining systems; Underground coal mining: bord and pillar systems, room and pillar mining, longwall mining, thick seam mining methods; highwall mining; Underground metal mining: open, supported and caved stoping methods, stope mechanization, ore handling systems\n• Mining Machinery - Generation and transmission of mechanical, hydraulic and pneumatic power; Materials handling: haulage, conveyors, face and development machinery, hoisting systems, pumps, crushers\n• Surface Environment - Air, water and soil pollution: Standards of quality, causes and dispersion of contamination, and control; Noise; Land reclamation\n• Mine Ventilation - Underground atmosphere; Heat load sources and thermal environment, air cooling; Mechanics of air flow, distribution, natural and mechanical ventilation; Mine fans and their usage; Auxiliary ventilation; Ventilation planning; Ventilation networks\n• Subsurface Hazards - Mine Gases. Underground hazards from fires, explosions, dust and inundation; Rescue apparatus and practices; Safety in mines; Accident data analysis; Mine lighting; Mine legislation; Occupational safety\n• Mine Economics - Mineral resource classification; Discounted cash flow analysis; Mine valuation; Mine investment analysis; Mineral taxation\n• Mine Planning - Sampling methods, practices and interpretation; Reserve estimation techniques: Basics of geostatistics and quality control; Optimization of facility location; Work-study\n• Systems Engineering - Concepts of reliability; Reliability of simple systems; Maintainability and availability; Linear programming, transportation and assignment problems; Network analysis; Inventory models; Queuing theory; Basics of simulation", "page": "How to prepare for GATE"}, {"chunk_id": "37784f44", "title": "II. Engineering Mathematics (~15%)", "text": "• Linear Algebra - Matrices and Determinants; Systems of linear equations; Eigen values and Eigen vectors\n• Calculus - Limit, continuity and differentiability; Partial Derivatives; Maxima and minima; Sequences and series; Test for convergence; Fourier series\n• Vector Calculus - Gradient; Divergence and Curl; Line; surface and volume integrals; Stokes, Gauss and Green’s theorems\n• Differential Equations - Linear and non-linear first order ODEs; Higher order linear ODEs with constant coefficients; Cauchy’s and Euler’s equations\n• Probability and Statistics - Measures of central tendency; Random variables; Poisson, normal and binomial distributions; Correlation and regression analysis\n• Numerical Methods - Solutions of linear algebraic equations; Integration of trapezoidal and Simpson’s rule; Single and multi-step methods for differential equations", "page": "How to prepare for GATE"}, {"chunk_id": "692b7ede", "title": "III. General Aptitude (~15%)", "text": "• Verbal Ability - English Grammar, Sentence Completion, Verbal Analogies, Word Groups, Instructions, Critical Reasoning, Verbal Deduction\n• Numerical Ability - Numerical Computation, Numerical Estimation, Numerical Reasoning, Data Interpretation", "page": "How to prepare for GATE"}, {"chunk_id": "f2317781", "title": "Preparation Strategy", "text": "• If you have taken your lecture classes seriously, then you have a positive point. It'll become easy for you to prepare.\n• If you haven't, then identify your weak areas i.e. your weak topics.\n• Take a note of the pattern by going the previous year papers. Last 5 years question papers would be quite sufficient but if you get hold of last 10 years, it would be great.\n• This will help you in identifying the important topics and your strong and weak zones.\n• Now focus on eliminating your weak zones.\n• Solve as many questions as you can to excel in your exams. Don't have an attitude of \"just passing\" the exam .\n• Try giving mock tests and do analyse them carefully.", "page": "How to prepare for GATE"}, {"chunk_id": "f84cda48", "title": "Study Materials", "text": "• Lecture notes of your professors.\n• A Complete Guide for Mining Engineers by Dr. A.K. Gorai (I will recommend this book for the last minute study and NOT for preparation of the exams)\n• GATE Mining Engineering by B.N. Bhagat & Sachin Lal (I DO NOT recommend this book as most of the solutions in this book are wrong. But you can go through the questions given. They are good.)", "page": "How to prepare for GATE"}, {"chunk_id": "77c26bc6", "title": "Calculation of GATE score", "text": "GATE 2025 [ 1 ] score will be calculated using the formula:\nGATE Score = S q + ( S t - S q )( M - M q )/( M t - M q )\nIn the above formula;\nM = marks obtained by the candidate (actual marks for single session papers and normalized marks for multi-session papers)\nM q = is the qualifying marks for general category candidate in the paper\nM t = is the mean of marks of top 0.1% or top 10 (whichever is larger) of the candidates who appeared in the paper (in case of multi-session papers including all sessions)\nS q = 350, is the score assigned to M q\nS t = 900, is the score assigned to M t", "page": "How to prepare for GATE"}, {"chunk_id": "5fd7525a", "title": "Qualifying Marks", "text": "The rules for qualifying marks have varied from year to year. The qualifying marks (out of 100) are different for different subjects as well as categories.\nCategory | Qualifying Marks (out of 100) for 2025 [ 1 ]\nGeneral | max(25 or min(40, µ+σ))\nOBC | 90% of general category's qualifying mark.\nSC and ST | 2/3 (i.e., 66.67%) of general category's qualifying mark.\nHere μ is the average (i.e., arithmetic mean) of marks of all candidates in the subject (with negative marks converted to zero) and σ is the standard deviation of all marks in that subject.\nUsually, the general category’s qualifying mark is in the 25 to 50 range.", "page": "How to prepare for GATE"}, {"chunk_id": "1de25d27", "title": "Summary", "text": "Though it seems that GATE syllabus is quite heavy, but analyzing the previous year question paper one can easily figure out that it only asks question related to the very essence of subjects covered in syllabus and focuses more on general aptitude of the student. So to everybody who is going to sit for GATE, All the Best!", "page": "How to prepare for GATE"}, {"chunk_id": "a6717bd6", "title": "External Links", "text": "• GATE CS guide on GeeksForGeeks\n↑ 1.0 1.1 GATE2025_InformationBrochure.pdf , page 29", "page": "How to prepare for GATE"}]