[{"chunk_id": "c01571b9", "title": "How to get a visa to Czech Republic", "text": "If you are looking to intern in Czech Republic during summer, through a program such as UFAL or via mailing, you will be applying for a student visa. It would take minimum of 10 days to process.\nThe following are required for the student visa:\n• Invitation letter (stating duration of internship and financial support, if any)\n• Proof of accomodation (for the whole duration of stay)\n• Proof of personal funds (bank statement)\n• Bonafide Certificate\n• Two passport size photographs\n• Original Passport and a xerox copy of the bio page\n• Health insurance for the whole duration of stay\n• Xerox copy of previous Schengen VISA (if any)\n• Cash of 5300-5500 rupees(Card payment is not accepted currently at VFS global, Kolkata)\n• Put your flight tickets if you have already booked\n• Xerox of identity card\n• A cover letter", "page": "How to get a visa to Czech Republic"}, {"chunk_id": "b480cf53", "title": "Online Application", "text": "• Download and fill the Schengen VISA application form from here .\n• Book an appointment at vfsvisaonline.com ( http://www.vfsglobal.com/czechrepublic/india/ )", "page": "How to get a visa to Czech Republic"}, {"chunk_id": "ed84cdea", "title": "VFS Center", "text": "The VFS center is at Rene Tower, Rajdanga Main road, Kasba, Kolkata . They would ask for documents, then submit the VISA and processing fee, after which you would have to go through bio-metrics check (if you have not been to a Schengen country recently). You have the option to receive the passport through courier at your address or at the VFS Center, Kolkata.", "page": "How to get a visa to Czech Republic"}, {"chunk_id": "5078db5f", "title": "See Also", "text": "• How to get a visa to USA\n• How to get an official transcript\n• How to get a Bonafide Certificate\n• How to get a bank statement", "page": "How to get a visa to Czech Republic"}]