[{"chunk_id": "5917d417", "title": "How to file RTI to get information", "text": "This guide explains in step-by-step approach how you can file a Right To Information claim for getting information from public offices and authorities which includes the Indian Institute of Technology Kharagpur as well.\nThe process is completely online, is super easy to fill for anyone who wants to inquire, takes only 5 minutes from start to end and if you don't come under BPL, a Rs.10 fee is charged.", "page": "How to file RTI to get information"}, {"chunk_id": "02b4b672", "title": "How To File RTI", "text": "A really easy way to file RTI is to use the online portal RTI Online . Below are the steps you can follow:\n• Choose \"Submit Request\", agree to usage policy on the following page, and click submit.\n• Select ministry and then the public authority you want the question to be addressed to. You can also use the \"Search Public Authority\" search box (for IIT KGP, enter \"Indian Institute of Technology\" in the box and select \"Indian Institute of Technology, Kharagpur\" from the dropdown).\n• Enter the basic details as asked in the form.\n• Enter your query in the \"Text for RTI Request Application\" and upload supporting documents (if any). For the content, please see Four Golden Rules of Writing RTI Applications .\n• Verify all details and content; an RTI application once made cannot be edited or canceled.\n• Click \"Submit\" and pay the fee of Rs.10 via the available online payment modes.\n• After successful payment, you'll get your RTI application number. Keep this safe!\nKeep checking for the status of your RTI application every few days; it generally takes two weeks for a response but may take up to a month. Read more on the RTI Time Limits here .", "page": "How to file RTI to get information"}, {"chunk_id": "f275cc86", "title": "RTIs Filed In IIT Kharagpur", "text": "Following is a list of RTIs filed by students of IIT Kharagpur or filed to procure information relating to IIT Kharagpur.\n• RTI filed to get financial information regarding Alumni Tower.\n• RTI filed to get information regarding fees structure, utilization of each breakup and impact of Covid-19 on the fees.\n• RTI filed to get information regarding the number of students paying fees, number of MCM scholarships granted, number of fee waivers granted and number of students paying fees.\n• RTI filed to get information on the time taken and interest generated from the Dual Degree Assistantship.", "page": "How to file RTI to get information"}, {"chunk_id": "2394f999", "title": "See also", "text": "• More Detailed Guide on How To File RTI\n• How to file ITR for income declaration\n• How to get a visa to USA\n• How to claim your medical expenses", "page": "How to file RTI to get information"}]