[{"chunk_id": "d05ccae9", "title": "How to mail a Professor", "text": "This page outlines some common sense etiquette that professors expect a student to maintain while mailing them. These were written with IIT Kharagpur students in mind. But other students may benefit from these as well.\nThe points below are abridged from Advice to students on writing emails – Jeevanjyoti Chakraborty's Blog\nStart with a proper address. The formal, idiomatic way is to start with “Dear Professor Surname-of-the-Professor”. You may also write “Dear Dr Surname-of-the-faculty”. Please do NOT write things like “Dear Dr John”. That’s very unidiomatic. It should be “Dear Dr Smith”.\n• If you are writing to a lady faculty member or anyways referring to a lady faculty member, it is STILL “Professor Surname-of-the-faculty” or “Dr Surname-of-the-faculty”. NEVER EVER (ABSOLUTELY EVER!) write “Miss”, “Ms” or “Mrs”.\n• Greetings like “Dear Jeevan Sir” can be excused if you know the professor being mailed to very well. And, overall that’s fine as long as you are at IIT Kharagpur. But, please make sure that don’t write like this to people with whom you are not on close terms. And, stop doing this once you are out of IIT Kharagpur!\n• EXTREMELY important point: In the body of the email, first of all, introduce yourself with your name and roll number. At the end of the email body, again write your name and roll number.\n• When you are making a request, you need to be polite. “Please could you …” or “Kindly take a look into …” or “I’d be grateful if you kindly consider … ”. Never write in a way that makes your email appear as if you are ordering; for example, “Do the subject registration for me” or “Open that elective option for me” The above point regarding politely making your request applies not just when you are writing to faculty members. WHENEVER you are making a request – even if it is to one of your friends or juniors – you need to make the request politely.\n• At the same time, when being polite, please don’t overdo it! The actual content of your email or the actual request should not get buried under a mountain of supplicatory phrases! Make your email sound polite but crisp and professional.\n• When you think you have to explain a complicated situation, first try to think it out and then write as concisely as possible. A shorter email has a greater chance of actually being read through and being acted upon.\n• If the situation is such that you do indeed have to describe the details, please do NOT write one large paragraph. Break it up into readable chunks.\n• DO NOT use mail trackers. Apart from being considered a violation of privacy, many people hate this kind of intrusive behaviour. In the worst-case scenario, it induces stubbornness in people to not reply BECAUSE you used the mail tracker – so the whole idea backfires.\n• Sometimes you will see emails from some faculty members which sound extremely rude. Please do not take those instances as examples to follow. Reject the bad and learn from the good instances.", "page": "How to mail a Professor"}]