[{"chunk_id": "c713457a", "title": "How to prepare for CFA level 1", "text": "(This guide was originally written by Shugun Patel(IM '16))\nThe Chartered Financial Analyst ( CFA ) Program is a professional credential offered internationally by the American-based CFA Institute (formerly the Association for Investment Management and Research, or AIMR) to investment and financial professionals. A candidate who successfully completes the program and meets other professional requirements is awarded the CFA Charter and becomes a CFA Charter .", "page": "How to prepare for CFA level 1"}, {"chunk_id": "03c87767", "title": "Content", "text": "CFA level I contains 10 topics (weightage in Level I exam) :\n• Ethical and Professional Standards (15%)\n• Quantitative Methods (12%)\n• Economics (10%)\n• Financial Reporting and Analysis (20%)\n• Corporate Finance (7%)\n• Equity Investments (10%)\n• Fixed Income (10%)\n• Derivatives (5%)\n• Alternate Investments (4%)\n• Portfolio Management and Wealth Planning (7%)", "page": "How to prepare for CFA level 1"}, {"chunk_id": "6f30d1d5", "title": "Preparation Time", "text": "One month of dedicated study is enough to clear Level I. A candidate with prior knowledge in Basic finance is a plus point. If you have other priorities and can’t give 1 month complete for preparation, a regular study of 1-2 hours everyday before 2-3 months of exam date is sufficient.", "page": "How to prepare for CFA level 1"}, {"chunk_id": "1b89fda7", "title": "Material", "text": "Schweser study material is enough to understand and clear Level I. One can go through and solve official booklet (soft copy) of CFA Institute as well if you have enough time to prepare.", "page": "How to prepare for CFA level 1"}, {"chunk_id": "b4007c9a", "title": "Passing Marks", "text": "It is suggested to secure more than 70% in each topic to smoothly clear Level I. Candidates who have less than 70% in 1 or 2 even 3 subjects (less weightage subjects) have also cleared level I but it's unlikely.", "page": "How to prepare for CFA level 1"}, {"chunk_id": "4f9bfb0a", "title": "Ethical and Professional Standards", "text": "This is one of the toughest and easiest topic in CFA Level I. Toughest for some who find remembering rules difficult and get confused or apply their own logic in questions in these topic. Easy for those who go through the rules and sections and understand and remember the rules and the ambiguity attached with some questions. There are CFA lecture videos by Arif Irfanullah , going through them for Ethics preparation is beneficial. You will quickly understand the content then you can refer to your Schweser booklet to solve more questions.", "page": "How to prepare for CFA level 1"}, {"chunk_id": "888442f0", "title": "Quantitative Methods", "text": "Most of us (Kgpians) will find these section to easy to understand and study. You Complete the entire topics in 2 or 3 days, given that we have basic knowledge of probability and statistics. Schweser notes is more than enough for these topic.", "page": "How to prepare for CFA level 1"}, {"chunk_id": "73b2d17f", "title": "Economics", "text": "These topic requires you to understand the concepts well. If you have basic knowledge in Economics, it will help you. Economics (subject) is compulsory in 2 nd year for some departments. These will give you basic macro and micro economic knowledge which will help you in your Economics preparation for CFA Level I. Also, Banking Theory and Practice (HS Dept) is yet another subject which you can opt as an elective or additional as these subject will help you understand Macroeconomic topics in CFA Level I Economics. Again, If you don’t understand the theory given in Schweser , refer to video lectures by Arif.", "page": "How to prepare for CFA level 1"}, {"chunk_id": "25ed4828", "title": "Financial Reporting and Analysis (FRA)", "text": "FRA has the most weightage in level I and it is completely new topic for us. It has basic accounting rules to follow and you need to remember two different accounting principal U.S. GAAP and IFRS. You should give decent time for these topic and Do make your own notes to refer while revising. These is very important for FRA as there are many rules and cases to remember. Refer to video lectures in case you are stuck somewhere. There is a course in VGSom which you can opt as an additional or elective Introduction to Financial Management (IFM). These course content includes Balance Sheet, Income Statement and Cash Flow Statement which can help you in getting acquainted with FRA for Level I.", "page": "How to prepare for CFA level 1"}, {"chunk_id": "af594b64", "title": "Corporate Finance", "text": "Not a tricky topic or difficult as such. IFM from VGSoM might provide you with some concepts given in Corporate Finance.", "page": "How to prepare for CFA level 1"}, {"chunk_id": "465d3372", "title": "Equity Investments", "text": "These is again a simple topic compared to other topics. Go through notes and questions behind every chapter. Video lectures if required.", "page": "How to prepare for CFA level 1"}, {"chunk_id": "18306499", "title": "Fixed Income", "text": "This topic is comparatively more interesting and in level I the difficulty level for questions in these topic is more compared to other topics. So, Read these topic carefully, Solve questions and go through official CFA Study materials question as they are a bit tougher compared to Schweser .", "page": "How to prepare for CFA level 1"}, {"chunk_id": "6cb95f09", "title": "Derivatives", "text": "Derivatives in Level I is just an introduction. You can finish studying it in a day or two. Derivatives and Risk Management Course by Prof. Prabina Rajib in VGSoM can be opt for to gain more knowledge in Derivatives.\nP.S. Ma’am is quite serious regarding attendance, Home Assignment and Presentations. But, the knowledge you ll gain after taking her course is worth the hard work involved.", "page": "How to prepare for CFA level 1"}, {"chunk_id": "e580e379", "title": "Alternative Investments", "text": "Again a small topic mainly theoretical. Don’t miss or neglect these topic as most of the people have secured less than 70% in these section.", "page": "How to prepare for CFA level 1"}, {"chunk_id": "0b09fb9c", "title": "Portfolio Management and Wealth Planning", "text": "Study materials will be enough to understand these topic. Again, Not a difficult topic to understand, but should not be neglected.", "page": "How to prepare for CFA level 1"}, {"chunk_id": "1764dc56", "title": "Summary", "text": "Clearing CFA Level I is easy task. It is not at all a difficult exam. Study wisely, make your own short notes for quick revision in last week. Clear conceptual doubts through video lectures, additionals or electives mentioned, or simply searching on Internet. Most important is practice especially in Ethics.", "page": "How to prepare for CFA level 1"}]