[{"chunk_id": "7272e1f9", "title": "How to typeset your thesis", "text": "During the course of undergraduate and postgraduate studies at IIT Kharagpur, one is required to submit a formal thesis and present the research carried out as a part of Bachelor's Project (BTP), Master's Project (MTP), or Doctoral Thesis (PhD). Since, typing a large research work requires careful organization, referencing and presentation, the choice of word-processor or typesetting is an important consideration. The two common choices tend to be Microsoft Word and LaTeX . While former provides excellent ease of usability and common formatting options, latter provides a granular control on content organization and generally produces superior quality documents.\nThe how-to discusses potential advantages of each method and illustrates how to do it.", "page": "How to typeset your thesis"}, {"chunk_id": "ad759d26", "title": "Advantages", "text": "• Excellent reference management\n• Whitespace and layout is automatically typset (table of contents, index page, list of figures etc.) ensuring maximum readability\n• Embed high quality figure easily", "page": "How to typeset your thesis"}, {"chunk_id": "cf429022", "title": "Disadvantages", "text": "• Has a learning curve; problem has be partially mitigated by using WYSIWYG editors\n• Requires careful setup, errors can be hard to debug", "page": "How to typeset your thesis"}, {"chunk_id": "afe23ce1", "title": "Template", "text": "It is best to start from a template. Fortunately, a few people have developed templates that you can adapt to write your own thesis. For example, Sarthak Jain wrote this template specifically for IIT Kharagpur's thesis styles. Download the file and read the instructions. However, note that each department has different guidelines regarding the format of thesis. The template can be adapted according to personal requirements.", "page": "How to typeset your thesis"}, {"chunk_id": "4d93ca35", "title": "General guidelines", "text": "• Remember, the top priority is to fulfill the thesis requirements of your department\n• Consider the marginal utility of investing in thesis typesetting versus thesis development", "page": "How to typeset your thesis"}, {"chunk_id": "b8bde852", "title": "External links", "text": "• Thesis writing - Pointers for keeping it simple and sleek by Sarthak Jain", "page": "How to typeset your thesis"}]