[{"chunk_id": "41c60cfb", "title": "How to get a specimen manufactured from CWISS", "text": "Credit: Siddharth Kannan\nAssumptions:\n• You are getting this manufactured for an ongoing project with the consent of your professor-in-charge (PIC)\n• You won't have trouble getting your HOD's signature on the work order\n• You have the material for the specimen (Already procured by the professor, or any other means)\n• You have the drawing that you need to get manufactured\n• All these steps need to be performed between 9 am and 4 pm. So, plan accordingly!\nSteps:\n• Take a sample of the material and a rough drawing to CWISS. Meet with Mr. Jena and show him the drawing as well as the material and let him decide the appropriate process to be followed (CNC or Conventional, Milling / Lathe / etc)\n• Now, walk into the CWISS office and get the Work Order forms from there\n• Fill out the work order forms Fill in a reference number: If this is a job for the Mechanical department, Your PIC is Prof. P K Das, your name is Rahul Gupta, and this is the first job that you are submitting: ME/PKD/RG/01 (This is merely a guideline) Clearly mention the material, number of pieces on both the work order forms and the drawings that you will attach with each work order form\n• Get the signature of your PIC on the work order\n• Get the signature of your department's HOD on the work order\n• In all you have 3 copies of each drawing. Staple 1 with the appropriate work order. Submit 1 to the technician at CWISS. Keep 1 with yourself for later use (In case they misplace it, and you have to submit it again) If you are giving multiple jobs, then staple all the drawings you are giving to the technician and write your name and phone number on the first drawing Write the number of pieces of each job clearly on each drawing\n• Take the material (appropriate size) and work orders along with the drawings (stapled together) to CWISS and again, meet Mr. Jena\n• Get Mr. Jena's signature on all the work orders. Explain the nature of the job and the utility (Creep test specimen, Impact test specimen, etc) to him\n• Give him the Technician's copy of all the drawings. Clearly mention the material, number of pieces and reference number on each drawing that you submit to him\n• Submit the work order, along with stapled drawing in the CWISS office\n• Ask Mr. Jena for expected time of completion, follow up with him continuously to get the job manufactured", "page": "How to get a specimen manufactured from CWISS"}]