[{"chunk_id": "9a6acfeb", "title": "How to prepare for GRE", "text": "(This guide was originally written by Abhigyan Sharma (CS '08), who got a perfect score in his year. Vaishnav Tadiparthi (AE '17) modified the article to suit current syllabus.)\nThis article serves as a complete guide to the GRE. A complete guide may not be a practical guide to follow. Everyone has his own way of studying for the GRE, this articles serves as a guide to pave your own, more realizable study path.\nThis article has been mainly written for the 2008 version of the GRE. One notable change since the 2008 GRE is the maximum score which is currently 340. This article is currently undergoing modification to adapt to the new GRE style.", "page": "How to prepare for GRE"}, {"chunk_id": "05ceac3a", "title": "Resources:", "text": "• Word Power Made Easy. It is not essential but it’s good to read it if you have a lot of time to go before GRE. The red book you will find lying around here and there. Helps build a solid vocab base, plus teaches the basics of etymology, i.e. the origin of a word and how to guess the meaning of a word. This book will take around 2-3 months to complete.\n• Word Web Pro (for windows users). Just Ctrl+ Right-Click on any word on the screen and it shows the meaning, along with synonyms which helps remember other related words as well.\n• Answers.com. The first entry in this is from American Heritage Dictionary, which is a good dictionary, and it gives the etymology of the words which is of great help. The other entries, for example, Wikipedia or Thesaurus entries help understand the word.\n• Barron’s word list. To feel comfortable I think it is necessary. Mugging it is a heck of a task, I agree. But some things can help in doing it. For example, After first iteration of Barron’s make a list of all unremembered words and try to memorize this list first FlashcardExchange.com. This site has a online flashcards of all barrons words plus a few more necessary ones. Here is the link. The list is in random order and you need to sort the list in the Options to read it sequentially. I could study faster online than from Barron’s. Also you could mark the incorrect words from it. This can help in making the list of unremembered words after first iteration. Forming links: trying to forms links either through etymology or through synonyms or antonyms, this helps cluster the words as well as memorize them. You may also read up the Wikipedia entry from Word Web Pro, if it exists, to help understand the word. After memorising do study the list randomly. This will test and confirm your knowledge of the words. Try to know the exact meanings of the words, because this will help in analogies, where you need to make eliminate similar options.\n• Apps: Magoosh GRE app is available on both Android and iOS. Around 1000 words have been categorised on the basis of difficulty. Very useful in the last month of preparation. The Quizlet app has wordlists made by the public. Another popular wordlist that can be found in quizlet is the Manhattan's wordlist.", "page": "How to prepare for GRE"}, {"chunk_id": "577ae44c", "title": "Software", "text": "The google dictionary chrome plugin is an extremely convenient feature to quickly lookup meanings of words. Install the plugin and double click on any word on the internet, and a pop up will appear showing its meaning. This is helpful while reading difficult articles.", "page": "How to prepare for GRE"}, {"chunk_id": "713aee74", "title": "Articles (Need Expansion)", "text": "Mugging up words is not enough, one must also know how to use them. Reading articles are an excellent way to learn word usage. Some of the best reading resources include popular newspapers such as The NY Times, The LA Times, The Atlantic, The New Yorker and article compilation websites such as Arts and Letters Daily ( https://www.aldaily.com/ ). AL daily combined with the chrome plugin serves as an excellent source of new words.", "page": "How to prepare for GRE"}, {"chunk_id": "906387f3", "title": "Part 2 : Practicing for verbal", "text": "Resources:\n1. Cracking the GRE (The Princeton Review): This book is very good. It has excellent strategies for verbal questions, which must be looked into. Plus you get to do with each purchase of book, two online Computer Adaptive Tests (CAT) like the actual GRE. The practice questions in the book are at par with GRE test.\n2. Power Prep: The authentic GRE stuff from ETS. Absolute must. It has practice questions and two CATs which can give the feel of actual GRE. Give it a shot around two weeks before the GRE to estimate your preparation.\n3. Barron’s: There are practice questions in the start and 5 model tests in the end. The question at the start can be practised. The model tests are OK, though little less tough than actual GRE. They can be practised by keeping a lesser time frame.\n4. Other Softwares on LAN: Several softwares are available on LAN/Internet. You can try and install them and see if they work. If they do, then well you can practice from them as well.\n5. Manhattan Prep: It is more than enough practice to solve all the questions in the 5 lb. book.\n6. Verbal Workout for the GRE (The Princeton Review): Extremely useful because it's very effective at telling you where you're most likely to go wrong.\nImportant things for Verbal:\n• Power Prep must be done as it is exactly the same software in GRE test. It will get you acquainted with it. Also,The book Cracking the GRE has strategies for verbal questions which are very useful.\n• Verbal Practice can be started after say half of the words have been mugged or after first iteration is complete. Then, both practice and mugging can be done side by side.\n• Reading Comprehensions (RC) take most of the time and you can get 3 to 4 of them. If one had infinite time, then all RC questions could be tackled, but to do so in 30 minutes, apart from other questions and without making silly mistakes, it needs practice.\n• Computer based tests take more time than paper based tests. This is mostly due to RCs where you need to do a lot of scrolling. So while practicing on paper keep a time frame of say 27 minutes for the Verbal Section.\n• This is a strategy in case you are running out of time. Generally the last RC comes around 15th or 16th question. So, if you have 5 questions including an RC and say you have say 3 minutes left and the RC has 2 questions based on it, you can mark arbitrary answers for RC and move forward to answers the remaining 3 questions, which are likely to be non-RC and can be answered in 3 minutes easily.", "page": "How to prepare for GRE"}, {"chunk_id": "0562449b", "title": "Part 3: Analytical Writing", "text": "Just a few things which are important. Rest can be read from Cracking the GRE, which is an excellent resource for this.\n• You must know what score your writing can get you. The sample Essays included in Power Prep and on ETS site's GRE practice booklet can give a fair idea of what level your writing is and what level of writing is needed to get a 5/6 or a 6/6.\n• These are not normal essays. The stress is on reasoning and proving your argument. Some practice must be done to get used to the kind of writing that is needed.\n• You should know what score you want to achieve. It is written in Barron’s that for streams like engineering and mathematics, analytical writing is not as important as the Verbal and Quantitative. So if you can get a score of 4.5 or 5 out of 6 it is good enough. Also depending on your flair in writing, you can decide how much time to spend time on it. If you think you have to improve to get a decent score, then start at least 4 weeks before exam.If you are good and can get a 5/6 easily (after seeing the sample essays) , then you can start to practice late.\n• Opening and concluding paragraphs are very important. They must be well written, and not rushed off. Apart from them, do write at least 3 paragraphs, having solid points, well-reasoned and with examples if possible.\n• Time it well. Both the issue task and argument task is 30 minutes each (no break, so 1 hr for 2 essays). More speed is needed as the time is 30 minutes for each individual essay and it must be practised more. While practising always time and do both the essays back-to-back to build up the stamina needed for the exam.\n• If you know about the logical fallacies, it can help in finding the fallacies in Argument Task. Try and read through some of them online or through a book on logic if possible.", "page": "How to prepare for GRE"}, {"chunk_id": "e40b67ab", "title": "Part 4: Quantitative", "text": "Just hope you do not make any mistakes with it.\n• There is no need to hurry since there are 35 minutes for answering 20 questions which are not at all difficult. But every question is a potential silly mistake question. Take your time.\n• Barron’s has good strategies for this section, which are worth following and make the job easier.\n• Though it is possible to go without any preparation and score 170 but after doing some practice you get to know the pattern of questions and know the potential pitfalls which increase your chances of getting full score.", "page": "How to prepare for GRE"}]