[{"chunk_id": "580a41d0", "title": "How to get a visa to France", "text": "If you are looking to intern in France during the summer, you will be applying for a student visa. There are two types of visa issued by France - i) Less than 3 months ii) More than 3 months For the 1st type, it takes generally 3-5 days to process the application while it takes around 15 days to process the application for the 2nd type.\nThe following are required for the student visa:\n• Convention de Stage or Invitation letter (stating duration of internship and financial support, if any)\n• Proof of accommodation (for the whole duration of stay)\n• Proof of personal funds (bank statement)\n• Bonafide Certificate\n• Two passport size photographs\n• Original Passport and a xerox copy of the bio page\n• Health insurance for the whole duration of stay\n• Xerox copy of previous Schengen VISA (if any)\n• Cash of 7000 rupees\n• Flight Tickets (Not mentioned on the visa website, but is compulsory)\n• Xerox of identity card\n• A cover letter\n• NOC from the department (Not mentioned on the visa website, but asked by VFS)\n• Resume (Not mentioned on the visa website, but asked by VFS)", "page": "How to get a visa to France"}, {"chunk_id": "8a56b472", "title": "Online Application", "text": "• Download and fill the Schengen VISA application form from here .\n• Book an appointment at vfsvisaonline.com ( http://www.vfsglobal.com/czechrepublic/india/ )", "page": "How to get a visa to France"}, {"chunk_id": "250ec67d", "title": "VFS Center", "text": "The VFS center is at Rene Tower, Rajdanga Main road, Kasba, Kolkata . They would ask for documents, then submit the VISA and processing fee, after which you would have to go through bio-metrics check (if you have not been to a Schengen country recently). You have the option to receive the passport through courier at your address or at the VFS Center, Kolkata.", "page": "How to get a visa to France"}, {"chunk_id": "0db95c0e", "title": "See Also", "text": "• How to get a visa to USA\n• How to get an official transcript\n• How to get a Bonafide Certificate\n• How to get a bank statement", "page": "How to get a visa to France"}]