[{"chunk_id": "f9357264", "title": "How to prepare for TOEFL", "text": "Credit: Vivek Rai , BT '17\nTest of English as Foreign Language (abbrv. TOEFL) is an English proficiency requirement test administered by Educational Testing Services (ETS), a non-profit organization based in United States. The test scores are often used by universities as an admission requirement for admitting non-native English speakers in undergraduate and graduate programs.", "page": "How to prepare for TOEFL"}, {"chunk_id": "2b232c70", "title": "TOEFL iBT", "text": "TOEFL iBT is the Internet based examination where test is administered via computer. It is the more common form of taking TOEFL examination. The paper consists of 4 sections: Reading, Listening, Speaking, and Writing. Each section is scored between 0-30, and total test score is ranged between 0-120. There are no grades or class awarded. A percentile score is also available for different scores.", "page": "How to prepare for TOEFL"}, {"chunk_id": "883deb61", "title": "Assessing current preparation", "text": "Usually, the GRE score is a nice indicator of the preparation needed for TOEFL. A good score means relatively little preparation for certain sections of TOEFL, for example, Reading and Writing sections. However, one may till need to prepare to Listening and Speaking sections.", "page": "How to prepare for TOEFL"}, {"chunk_id": "98ac8760", "title": "Know the time", "text": "The whole test can take up to 3 hours and 30 minutes. Each section is individually timed and subsections in each category have separate times as well.\n• Reading: 3-4 passages, 54-72 minutes\n• Listening: 4-6 lectures and 2-3 conversations: 60-90 minutes\n• Break: 10 minutes\n• Speaking: 4 questions: 12-17 minutes\n• Writing: 2 tasks: 20 min and 30 min respectively\nThe number of question in each set varies depending on which set consists the experimental section. For example, you would either receive an extra section in Reading, or an extra section in Listening but not both.", "page": "How to prepare for TOEFL"}, {"chunk_id": "518daa7d", "title": "Resources", "text": "ETS provides sample resources including audio files, reading comprehensions and scored responses.", "page": "How to prepare for TOEFL"}, {"chunk_id": "2420c8d7", "title": "Reading", "text": "Each passage in Reading section is accompanied by 14 questions. The questions are simple choose-one, choose-multiple, re-arrange based on text, match-groups type. There's about 20 minutes time for each set, though the entire set is timed at once. That is, if you have 3 passages, you will have a total time of 60 minutes. It is relatively easy to score Reading section since passages are not easy.\nProtip: Do not wait to read all the passage before answering. Read question, lookup answer, repeat.", "page": "How to prepare for TOEFL"}, {"chunk_id": "07637a4d", "title": "Listening", "text": "Listening section consists of two kinds of questions: Lectures and Conversations. You'll have to hear 4-6 of lectures and 2-3 conversations to answer questions about material discussed. You are allowed to take notes during the listening tasks.\nProtip: Avoid making too detailed notes. The questions asked are high-level in nature. For example, What was the purpose of the lecture, Which concept was introduced. Not like, What happened on the Friday the 13th at 5 pm.", "page": "How to prepare for TOEFL"}, {"chunk_id": "d532b8d9", "title": "Speaking", "text": "Consists of 6 questions: 2 independent speaking and 4 integrated speaking tasks. You typically have to speak for 30-60 seconds (varies by each question) for each question. Some questions contain an integrated lecture, and you are asked to answer a question related to the lecture.\nProtip: Practice by recording your own voice to sample questions and listening it. Note where you get stuck. The idea is to keep it simple and clear without using too fancy English. There is no need to be too loud or fake an accent.", "page": "How to prepare for TOEFL"}, {"chunk_id": "b2ffdf0f", "title": "Writing", "text": "Consists of two questions: One independent writing about an issue (30 minutes), and other integrated writing (20 minutes). The independent issue writing is very similar to GRE analytical writing section, except that you are not required to demonstrate persuasive writing. The integrated writing portion consists of a passage, followed by a lecture that discusses aspects of the passage. You are required to write about a question that combines the material from both passage and lecture.\nProtip: Practice simple essay writing for general issues under timed conditions.", "page": "How to prepare for TOEFL"}, {"chunk_id": "1571650a", "title": "Scores", "text": "TOEFL iBT scores arrives in about 10-15 days. Typically, most universities have cutoff varying between 80-100. There are hardly any universities that require scoring above 100 as cutoff. So, any score above 100 is pretty good. In fact, scoring above 110 will put in 90-percentile group. Also, unlike GRE, TOEFL requires you to select target universities before giving the test. You are required to fill in the codes of universities for which you will be sending the scores by 10 p.m (local time) of the previous day of the test date. By doing so you will get an opportunity to send scores for free to 4 universities. After 10 p.m there will be late charges. More info can be found . Make sure you have selected your target universities before taking the exam.\nThe most important thing about scores, is the score in speaking section. Generally all the good universities will offer you a Teaching Assistantship (TA) if and only if you have a speaking score of more than or equal to 27 ( generally most of the Indians get stuck up in the range 22 to 26) . So getting a good score in speaking section and having reasonably good grades will give you an edge over other applicants in funding. Of course there are other forms of assistantship's like fellowships and Research Assistantships (RA) which you will get based on the strength and content your application. Lastly there should be no much of a worry if one cannot score the threshold in speaking. Having an overall good score will also give an equal advantage, but one will have to clear an exam similar to TOEFL(designed according to the universities teaching standards) after getting an admission. Generally these tests will happen in the orientation week of the graduate school and are very easy compared to TOEFL.", "page": "How to prepare for TOEFL"}, {"chunk_id": "417250c7", "title": "See also", "text": "• How to prepare for GRE\n• How to apply to graduate school", "page": "How to prepare for TOEFL"}, {"chunk_id": "7cbd9813", "title": "External Links", "text": "• TOEFL Sample Questions\n• TOEFL Test Preparation: The Insider’s Guide\n• TOEFL Mock Tests", "page": "How to prepare for TOEFL"}]