[{"chunk_id": "48d589b5", "title": "How to apply to graduate school", "text": "(This guide was originally written by Niharika Gupta(CH '16) and some major edits were done by Vivek Rai (BT '17))\nGraduate student applications for the US require GRE, TOEFL, recommendations, transcripts, and SOP.", "page": "How to apply to graduate school"}, {"chunk_id": "7f268b94", "title": "Timeline", "text": "Every department in universities have their own deadlines. Some universities can have deadlines as early as November; some can have in May. You would need to send your GRE and TOEFL scores according to the deadline specified on the university’s website.\nYou can expect to have ALL the admission decisions to be informed by March end, though most universities send out decisions mostly by Jan/Feb. And some universities have rolling admissions as well.", "page": "How to apply to graduate school"}, {"chunk_id": "1a17a022", "title": "Cost", "text": "For each application, it costs between $90-$150 to apply.", "page": "How to apply to graduate school"}, {"chunk_id": "18e3bd16", "title": "Choosing the universities", "text": "For Masters, I would say go with the high rankings. If you are not sure that you have good enough credentials, apply to a mix of high-ranked, mid-ranked and low-ranked. Though my suggestion would be to not go below Top 50.\nhttps://yocket.in/ is a nice website to check out which universities you should try for with your GRE, TOEFL scores, your GPA and your achievements (published research papers etc). It will provide you details of the universities termed ambitious, moderate and safe for your profile. I found the app even more convenient for this. However, this provides a basic outlook of where you might go and does not confirm if your application will be accepted or rejected.", "page": "How to apply to graduate school"}, {"chunk_id": "e7f08a5c", "title": "GPA, GRE, TOEFL requirements", "text": "There’s no minimum GPA criteria that universities set usually. Some might mention some no. on a scale of 4. You would want to check in websites like WES to calculate your GPA scaled in 4 to make sure. You would also need it for some universities which would require your GPA on that scale.\nThere is no minimum requirement for GRE as far as I have seen. But I would recommend try not losing any marks in Math.\nUniversities generally have a minimum TOEFL score requirement ranging from 70 to 100. Make sure to check that on their websites.", "page": "How to apply to graduate school"}, {"chunk_id": "fb07f2d0", "title": "Writing SOP", "text": "See also: How to write SOP", "page": "How to apply to graduate school"}, {"chunk_id": "597a3d32", "title": "Length", "text": "It is recommended to limit your statement of purpose to not more than 2 pages ensuring a legible font size (10pt or 11pt). Also, different schools may have their own limits on the length of SOP, for example, 500 words, 1 page. Also, most of them require you to answer a \"specific\" question but eventually it tends to be similar across all. In some places, one may asked to write an diversity essay, albeit of a much shorter length.\nProtip: Write in as much detail as possible (2-3 pages of initial draft) and then cut down as required.", "page": "How to apply to graduate school"}, {"chunk_id": "f3da252f", "title": "Content", "text": "The role of statement of purpose varies depending on the target degree, that is, master's vs doctorate. For example, statement of purpose for doctorate programs generally tend to focus more on research content supported heavily with suitable research experiences. Mention your major achievements, internships, projects. Mention 1-2 instances in detail during your internship/project that shows the person you are, keeping aside the technical skills. Avoid plagiarism.\nProtip: It is recommended to write an initial draft and then look at other people's statement of purpose to get a idea of structure. Remember to have it reviewed by as many people as possible.", "page": "How to apply to graduate school"}, {"chunk_id": "d153b42f", "title": "Standardized examinations", "text": "See also: How to prepare for TOEFL and How to prepare for GRE\nGive GRE and TOEFL as soon as possible. The earlier you get done with them, the better. In that way, you also have the time to give GRE again if you are not satisfied with your score. Generally, a GRE score above 320 and TOEFL score above 100 is considered acceptable. Since both exams require you to send your scores to institutions, it'd advised to have a list of potential institutions where one is going to apply.", "page": "How to apply to graduate school"}, {"chunk_id": "2f0a6015", "title": "Creating applications", "text": "• Decide for a major in which you would want to pursue your Masters. It need not be the same as your bachelors. I would suggest go for your interest.\n• Read the websites of the department you are applying to very carefully. It would have many required details like the deadlines of GRE, TOEFL, application. They might have some unique programs as well, for example Master’s degree in combined Engineering and Law, Professional Degree Program, etc.\n• While you are deciding which universities to apply to and simultaneously researching their websites, you would want to start writing your SOP as well. Get it reviewed by friends, family, seniors. Some universities want very specific points in it, so you would have to tweak it accordingly.\n• Once sure which universities to apply to, visit their website to get the link to the online application form which would require you to make an account. Application forms are quite lengthy and some fields might be confusing. Email their graduate admission office if any doubts.\n• Send GRE and TOEFL scores to the chosen universities, if not done already. Some of the application forms would let you know if the universities received your scores.\n• After you submit the application, you would be guided to the page where you have to pay the application fees. Usually it would be required to pay with credit card.", "page": "How to apply to graduate school"}, {"chunk_id": "7bde448b", "title": "Getting recommendations", "text": "See also: How to write a recommendation letter\nAsk for recommendations from Professors, industry professionals etc. At least 3 recommendations are required for each university and some of them may specify that 1 or 2 must have to be from a Professor who has taught you or been your supervisor. It is recommend to reach your recommender at least 2-3 weeks before the deadline.", "page": "How to apply to graduate school"}, {"chunk_id": "1937b73d", "title": "Documents", "text": "Mostly, universities require the scanned copy of your transcript that you would be uploading in the application form. But some universities require your transcripts to be mailed by post or e-transcript. However, IIT Kharagpur does not issue an e-transcript and you'd need to have a physical copy of your transcript signed and sealed by the Dean of Student Affairs. For that, one has to visit Dean's office (first floor Main Building, where the Director's office is) with your i) original transcript, ii) few clean copies of your transcript on original (A-1) sized paper and an airmail envelope for each, and iii) your student identity card. The envelope and the copy can be acquired from RLB photocopy center or Tech Market. The Dean's secretary would verify that they are your documents and make a register note (original transcript is returned). Sealed documents can then be collected from the officer later based on Dean's availability.", "page": "How to apply to graduate school"}, {"chunk_id": "1b7f0788", "title": "Other Advise", "text": "• Phillip Guo - A Five-Minute Guide to Ph.D. Program Applications\n• The PhD Grind - This is memoir by Phillip Guo describing the his experience as a Computer Science PhD at Stanford. It is good peek into what a life as PhD might look like.", "page": "How to apply to graduate school"}, {"chunk_id": "e915d936", "title": "See also", "text": "• How to get a visa to USA", "page": "How to apply to graduate school"}]