[{"chunk_id": "b4e32415", "title": "How to get institute email address", "text": "IIT Kharagpur provides an official email id with domain name kgpian.iitkgp.ac.in to all its students and staff. Every student is asked for their preferred email id at the time of their admission on ERP. They are provided with their password and complete facility by the end of their first academic session.", "page": "How to get institute email address"}, {"chunk_id": "1f8f3619", "title": "History", "text": "As of today 30 April 2018, Your Institute ID is already generated when you take admission in any course and fill-up all the details in your ERP account.\nNo need to write any email to anyone.\nTo access your Institute Account:\n• Go to Zimbra Web Client Sign In\n• Username is what you have provided in ERP (with @ iitkgp.ac.in domain). You can also check this in ERP > Academics > STUDENT > Your Academic Information > Profile.\n• Password : For the first time it is your Date of Birth in ‘ mm.dd.yyyy ’ format ( notice the DOT in-between the numbers ).\nYou should change your password after first time you use it.", "page": "How to get institute email address"}, {"chunk_id": "860a6bcb", "title": "Accessing email", "text": "The access to official IIT Kharagpur email is provided via Zimbra Web Client ( https://iitkgpmail.iitkgp.ac.in/ ). One can login to this website after receiving the account details from CIC. Also, ensure that you change your password as soon as you login.\nThe default password for login is your Date of Birth in the format 'mm.dd.yyyy'\nFrom 2020 autumn semester email access is provided through google workspace.\nAs of 2020, for freshers they can login through OTP which is provided in ERP -> Academic -> Students -> Biodata -> Institute E-mail ID . And afterwards they can change their password.\nFor entrants of 2020 and ahead:\n• Go To Gmail Sign In\n• Email is what you have provided in ERP (with @kgpian.iitkgp.ac.in domain). You can also check this in ERP > Academics > STUDENT > Your Academic Information > Profile.\n• Password : For the first-time login, password is provided in ERP along with Email. You need to change the password on first login.\nWe also have Microsoft Account with email address same as provided by the institute and first time login password in ERP.", "page": "How to get institute email address"}, {"chunk_id": "de5a5a97", "title": "Forgot your password?", "text": "Mail the CIC helpdesk (helpdesk[at]cc.iitkgp.ac.in) with the details of your email id. They will reset the password to the default password(DOB) which you will need to change once you login.", "page": "How to get institute email address"}, {"chunk_id": "239848d5", "title": "Expectation of privacy", "text": "Your @iitkgp.ac.in email is owned and maintained by University. There should be no expectation of any privacy or control of data and access to it. Please use your permanent personal email for all important conversations.", "page": "How to get institute email address"}, {"chunk_id": "3a1c8ea4", "title": "Validity", "text": "The institute email address is accessible upto an year after your graduation after which you'll get an email to download your data. Your email is then removed from the system.", "page": "How to get institute email address"}]