[{"chunk_id": "6b41ded8", "title": "How to write SOP", "text": "Statement of Purpose is one of the critical components of a graduate school application. The purpose of the statement of purpose is many fold, and serves as an important first pitch of your capabilites and interest in your field. In many cases, acceptances or rejections or directly offered without interview after screening of student credentials. In such cases, making a lasting impact and communicating your research, through your statement of purpose, become even more important.", "page": "How to write SOP"}, {"chunk_id": "5d227e2e", "title": "Purpose", "text": "It’s misleading that the personal statement is called a \"personal\" statement, since what admission committees are really looking for is a research statement. What admission committees want is a statement about what research you have done, what research you hope to do, and why you like research. ( Source )\nThe purpose of the statement of purpose is:\n• detailed discussion of why the candidate chose the particular program\n• what he/she intends to do while pursuing the program\n• what he/she will do after having gained the education\nWhat it's not:\n• A detailed curriculum vitae\n• A boastful description of what you have achieved in your life", "page": "How to write SOP"}, {"chunk_id": "58e1b9d6", "title": "Masters vs PhD", "text": "Application to both of the program require writing statement of purpose or a variant of the essay. However, the standards for the essay are different for a master's versus a doctoral program; not that one is superior over the other.\n• Focus\n• Experience", "page": "How to write SOP"}, {"chunk_id": "99f748f8", "title": "Prompts", "text": "This section is empty. You can help by adding to it .", "page": "How to write SOP"}, {"chunk_id": "a08a152e", "title": "Key ideas of SOP", "text": "• Show, don't tell. Reinforce every claim you make with supporting evidence from your own experiences. Demonstrate evidence of critical thinking, and discussion of prior relevant research or project experience.\nI personally would like to hear about the difficult aspects of some project you worked on. Tell me how you displayed excellent problem solving skills, were a leader, or showed initiative. Especially if you have done research before, tell me about that research experience, and what you learned from it. Source\n• Motivation is great. Don't just list out your research projects as successive bullet points. What motivated you to undertake those projects? What did you learn from those projects that motivated you to further pursue research? Why do you want to pursue a Ph.D.?\n• Transitions are important. Don't just have sentences mash up against one another without any connective tissue.\n• Indicate the names of the faculty you would like to work with. Also, it's a good idea to indicate more than one name otherwise you may risk being pigeonholed.\n• If you send supplemental information, make sure it is directly relevant to the pursuit of graduate study in your field of interest.\n• Ensure that your SOP shows that your interests align with the program.", "page": "How to write SOP"}, {"chunk_id": "df67627a", "title": "Basic template", "text": "• First paragraph: Describe the general areas of research that interest you and why. (This is helpful for a committee to determine which professors should read your application.)\n• Second paragraph, Third, and Fourth paragraphs: Describe some research projects that you worked on. What was the problem you were trying to solve? Why was it important? What approaches did you try? What did you learn? It’s fine to say that you were unable to fully solve your problem.\n• Fifth paragraph: Tell us why you feel you need a Ph.D. Look back to second paragraph and explain what in there appealed to you.\n• Sixth paragraph: Tell us why you want to come to the university. Whom might you like to work with? What papers have you looked at from the university that you enjoyed reading? Why is this university the right place for you?", "page": "How to write SOP"}, {"chunk_id": "9c250824", "title": "Collecting information", "text": "Ask yourself the following questions and prepare a document containing your responses:\n• What are the outstanding problems or current trends in your favorite field?\n• Which fields hold the most promise for the future?\n• Why are you specifically well suited for this area of research?\n• What do you enjoy doing – or, more accurately, what could you see yourself doing day-in and day-out until you’re 30?\n• What do you want to learn?\nThese questions will provide a structure to your statement of purpose and help you prepare your draft efficiently. At the same time, these questions will also help you evaluate and reinforce your plans of pursuing a graduate degree.", "page": "How to write SOP"}, {"chunk_id": "d32ac934", "title": "Preparing first draft", "text": "Once you have a story from the previous section, it is time to prepare an outline . Preparing effective outline is a key step, much like having a table of contents or structure when writing a thesis.", "page": "How to write SOP"}, {"chunk_id": "40e99b9e", "title": "Doing revisions", "text": "It is important to get your essay reviewed by as many people as possible. Grammatical errors, sentence flaws and spelling mistakes are frowned upon in a statement of purpose, specially since it is meant to reflect your best possible effort towards getting into the school. It is very easy to overlook such mistakes in a single round of revision.\nIt is recommended to have your essay reviewed by at least one professor, a graduate student, and a classmate or colleague. However, note that different people have different opinions about how you should you story, hence you may get conflicting suggestions. Nonetheless, it is better to have several perspectives than dwell in ignorance.", "page": "How to write SOP"}, {"chunk_id": "5106b32e", "title": "Do's and Dont's", "text": "This section is empty. You can help by adding to it .", "page": "How to write SOP"}, {"chunk_id": "5ba5b71c", "title": "Checklist", "text": "Check if your statement of purpose contains answers to the following questions:\n• [ ] Why you want to be a graduate student?\n• [ ] Why you would make a good graduate student (with supporting evidence from the facts of your life)?\n• [ ] What would it be like to have you here?\n• [ ] Are you repeating the details already present in your resume?\n• [ ] What kind of research could you see yourself doing and why?\n• [ ] Does it show interest, experience, and potential?\n• [ ] Is there proper match between your area of interest and the faculty names you have indicated?\n• [ ] Does your statement indicate how you'd contribute to the program and not just benefit from it?", "page": "How to write SOP"}, {"chunk_id": "e212ef3e", "title": "External Links", "text": "sop for Mba", "page": "How to write SOP"}]