[{"chunk_id": "info_e0a643", "title": "HS13001: English For Communication - Quick Facts", "text": "HS13001\nCourse name | English For Communication\nOffered by | Humanities & Social Sciences\nCredits | 4\nL-T-P | 3-0-2\nPrevious Year Grade Distribution\n81 233 402 486 101 8 2 EX A B C D P F | 81 | 81 | 233 | 233 | 402 | 402 | 486 | 486 | 101 | 101 | 8 | 8 | 2 | 2 | EX | A | B | C | D | P | F\n81 | 81 | 233 | 233 | 402 | 402 | 486 | 486 | 101 | 101 | 8 | 8 | 2 | 2\n81\n233\n402\n486\n101\n8\n2\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "HS13001: English For Communication"}, {"chunk_id": "9cf3f3b2", "title": "Syllabus mentioned in ERP", "text": "The aim of this foundational course is to help the second language learners acquire fluency in both spoken and written English to communicate messages with clarity, precision and confidence in the workplace. The course will have three components: Language, Speaking and Writing. The skills required in these areas will be imparted through Lectures and Sessionals. While lectures will introduce learners to the basic concepts in communication, sessionals will provide handson experience. It is hoped that after commanding the skills required in spoken and written English, learners will be able to communicate better.\nSection A (Lecture topics) Introduction to communication, Language and grammar skills, speaking skills, Writing skills\nSection B (Sessionals) Building Vocabulary, Building sentences, Grammar, Pronunciation drills, Phonetics, vowels, Diphthongs, consonants, Stress, Rhythm and intonation, Conversational skills, Meta Language, the writing process, Writing with a thesis, Writing topic sentences, Writing a paragraph, linking paragraph.", "page": "HS13001: English For Communication"}, {"chunk_id": "1494d336", "title": "Concepts taught in class", "text": "As far as theory is concerned you will be basically taught a set of poems and proses with a very deep analysis. There is no grammar or writing component in the theory component of the course. So dont let the ERP syllabus divert you.\nThe lab classes are concerned with your communication skills and the teaching style and content varies from class to class.\nSome sections had more emphasis on phonetics and pronunciation for a longer time while other sections would focus on professional speaking skills and some basic skills used in Group Discussion and some advanced concepts like Non Verbal Communication and the development of Music and Art. It will be a nice experience and you will get to know your friends better.", "page": "HS13001: English For Communication"}, {"chunk_id": "21cdb455", "title": "Student Opinion", "text": "Relative Grading\nThe midsem and endsem tests are common for all sections. What varies is the lab class evaluation. In some sections, professors do take class tests in pen and paper mode for the Theory component. If Prof. Seema Singh is your Theory teacher, then you are most likely to have 2 movie tests in Vikramshila where you will be shown a one hour movie and then do a critical analysis of it. It was an open internet and resource test. And at the end of the semester she takes a theory test where each student gets a random poem and he/she has to answer the MCQs in it. One can use internet (but its not that easy, the questions are designed ina way that you analyse through the internet and then develop an understanding.)\nIn labs too, evaluation and activities vary.\nBe careful about attendance because several students get deregistered on account of their attendance. One can't give proxy as some profs take attendance themselves.\nGetting an Ex in this course is not at all a cakewalk. The teachers expect you to write mature and fresh answers. You need to touch the historical background and the cultural volume of the texts and write detailed answers with elaborated but precise information. Many people take this course lightly but you really need to have a strong grip on the texts to be able to write good answers in the exams and get a good grade. Again, the checking is quite strict so you must keep an eye on your grammar and spellings in the answer. A neat handwriting and underlining of important phrases with a pencil is appreciated.", "page": "HS13001: English For Communication"}, {"chunk_id": "06e70d74", "title": "How to Crack the Paper", "text": "Well let me clearly define the steps needed to do so:\n1.As soon as the semester starts, jot down the syllabus of the midsem and endsem as per timing.(Both are different and they might be mailed to you).If not then prompt your teacher to do so.\n2. The question paper structure is as follows:\na. Unseen passage with MCQs (Passages are almost of the same level that you encounter in CBSE class 12 English). b. MCQ questions from poems and proses taught in the class. c. 2 or 3 long answer type analysis questions. You have to fill atleast 2-3 pages.\n3. For part a. practise of sample papers and paragraphs would be enough.\n4. For part b. read all the poems and proses taught in the class line by line (not depth and with deep meaning). Have a surface reading and also take special care of new and special words mentioned behind the chapter. They ask those meanings sometimes.\n5. Part c. is the major mark deciding area. You will have a choice to select 1 or 2 from all poems and proses taught seperately. When your semester starts decide the chapter on which you will write the long answer. Draft a 2 or 2 .5 page answer which will include a general analysis of the poem or prose involved by seeing some good sites in Google.Don't forget to write Author's name, place and date of birth, year of publication of poem or prose. If you attatch some movies or songs(dont forget to mention band or singer name) based on the theme of the chapter. The remaining half page will be based on what the question wants or the specification of the question, which you have to develop on your own in the exam hall.", "page": "HS13001: English For Communication"}, {"chunk_id": "b7fb4520", "title": "Additional Resources", "text": "Instiinfo Repository", "page": "HS13001: English For Communication"}]