[{"chunk_id": "info_ac0fa4", "title": "HS20005: Micro Economics-I - Quick Facts", "text": "HS20005\nCourse name | Micro Economics-I\nOffered by | Humanities & Social Sciences\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n5 6 5 12 13 7 1 EX A B C D P F | 5 | 5 | 6 | 6 | 5 | 5 | 12 | 12 | 13 | 13 | 7 | 7 | 1 | 1 | EX | A | B | C | D | P | F\n5 | 5 | 6 | 6 | 5 | 5 | 12 | 12 | 13 | 13 | 7 | 7 | 1 | 1\n5\n6\n5\n12\n13\n7\n1\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "HS20005: Micro Economics-I"}, {"chunk_id": "6600548b", "title": "Syllabus mentioned in ERP", "text": "Prerequisites: None Course Contents Introduction: Nature and Scope of Economics, Difference between Micro and Macro Economics, Central Problems of an Economy; Theory of Demand- Marginal Utility Analysis, Indifference Curve Analysis, Law of Demand, Derivation of Demand Curve from Indifference Curve, Price Effect as a Combination of Income and Substitution Effects, Elasticity of Demand: Price, Cross and Income Elasticities; Revenue and Elasticity; Production Function- Laws of Returns and Laws of Returns to Scale, Cost of Production-Short-run and Long-run-Traditional and Modern Theories; Theory of Firm: Optimizing Behaviour and Isoquant Analysis; Market- Price and Output Determination under Perfect Competition, Law of Supply- Supply Curves under Increasing, Diminishing and Constant Cost Industries; Consumer Surplus and Producer Surplus, Stability of Equilibrium; Pure Monopoly, Discriminating Monopoly, Multiplant Monopoly, Multi-product Monopoly, Bilateral Monopoly.", "page": "HS20005: Micro Economics-I"}, {"chunk_id": "a4a435ac", "title": "Concepts taught in class", "text": "Introduction and difference between micro and macro economics\nDemand (law of demand, types, elasticity)\nSupply\nEquilibrium\nIndifference Curves\nProduction Function", "page": "HS20005: Micro Economics-I"}, {"chunk_id": "3a6c3e32", "title": "Student Opinion", "text": "The concepts in Micro Economics-I are much more abstract than in other economics related subjects (Economics, Macro Economics, Micro Economics-II). This is part one of the Micro Economics course and as such only covers half of the essential topics in microeconomics. The other important topics such as theory of cost and market structure are covered in Micro Economics-II. Unlike the syllabus mentioned in ERP, theory of cost and all types of markets are in Micro Economics-II and not Micro Economics-I.", "page": "HS20005: Micro Economics-I"}, {"chunk_id": "ea0e85dc", "title": "How to Crack the Paper", "text": "Practice all the proofs done in class and remember all the conditions and assumptions taken (this will help in true/false with explanation type questions in exam). Practice all tutorials again before exam. Solve questions from Intermediate Microeconomics by Hal R. Varian or Microeconomics by Pindyck and Rubinfeld.\nMicroeconomics by Hal R. Varian is the primary book for the course and it is one of the bestselling books in introductory microeconomics. However, this book is insufficient for exams because it explains concepts without going into the mathematics behind them. It is advisable to refer to a book like Microeconomic Theory: A Mathematical Approach by Henderson and Quandt for mathematical portions. This book expects basic knowledge of economic concepts and it would not make sense unless you have a grasp of theory from an introductory economics book.", "page": "HS20005: Micro Economics-I"}, {"chunk_id": "16d84d69", "title": "Additional Resources", "text": "Books referred to in course\nIntermediate Microeconomics by Hal R. Varian (not to be confused with Microeconomic Theory by the same author which has much rigorous maths)\nMicroeconomics by R. Pindyck and D. Rubinfeld (primary book for Microeconomics-II)\nFor mathematical portions\nMicroeconomic Theory: A Mathematical Approach by Henderson and Quandt\nMicroeconomics by H. Gravelle and R. Rees", "page": "HS20005: Micro Economics-I"}, {"chunk_id": "51b09132", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NC413 | NC413\nTuesday | NC413 | NC413\nWednesday\nThursday\nFriday", "page": "HS20005: Micro Economics-I"}]