[{"chunk_id": "info_36593b", "title": "HS30047: French - Quick Facts", "text": "HS30047\nCourse name | French\nOffered by | Humanities & Social Sciences\nCredits | 3\nL-T-P | 3-0-0\nProfessor(s) | Prof. Anuradha Choudry\nPrevious Year Grade Distribution\n9 17 19 10 4 1 EX A B C D P F | 9 | 9 | 17 | 17 | 19 | 19 | 10 | 10 | 4 | 4 | 1 | 1 | EX | A | B | C | D | P | F\n9 | 9 | 17 | 17 | 19 | 19 | 10 | 10 | 4 | 4 | 1 | 1\n9\n17\n19\n10\n4\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "HS30047: French"}, {"chunk_id": "dc0a36b0", "title": "Concepts taught in class", "text": "French alphabets, Basic words, Verbs and conjugating their various form, Genders, Plurals, Various Tenses, Adjectives, Basic Pronouns. The professor also focusses on teaching students the proper pronunciation of French. A part of course is also dedicated on covering parts of French culture like sports, arts, French revolution, cuisines, Wines etc. which will be presented by the students (in groups) in form of 15 minute presentations (graded).", "page": "HS30047: French"}, {"chunk_id": "1e4407f4", "title": "Student Opinion", "text": "The professor is very good, attend all the classes for enjoyment (also because attendance carry marks). Listen to French music while studying for the exam, watch French movies, TV series etc. Enjoy the course as you learn French.", "page": "HS30047: French"}, {"chunk_id": "d27a9609", "title": "How to Crack the Paper", "text": "Usually, the marks distribution changes from year to year. The following was the one in 2019 Spring -\n• MidSem = 20\n• EndSem = 30\n• Attendance = 10\n• Play = 15\n• Presentation and Report = 15\n• Poem = 10\nAttend all the classes. Greater than 8 absence and you get dereg'ed. Also the attendance carry marks.\nThe Play and PPT were group activities, make sure you practice both at least once. These are easy marks.\nAs for Midsems, make sure you can answer basic questions about the activities asked to do (Just read it, no use memorizing it). Simple Translations are asked.\nTo score higher, make sure that you learn the gender along with the words you learn, their plurals and be well versed the Present, Perfect and Imperative Tense of Verbs of GRP 1 and 2.\nFor Endsems, it will be similar as midsems with addition of irregular verbs adverbs, prepositions, framing moderately difficult sentences, passage - based question answering. Be comfortable with the important verbs like Avoir, Etre, Faire, Aller and the three verb forms. The questions will be asked in French itself, make sure that you go through the previosu years papers so that you can understand what exactly is being asked.", "page": "HS30047: French"}, {"chunk_id": "1b1813fc", "title": "Additional Resources", "text": "Hugo's French in 3 months", "page": "HS30047: French"}]