[{"chunk_id": "info_7d1059", "title": "ID60006: Sea And Inland Port Infrastructure - Quick Facts", "text": "ID60006\nCourse name | SEA AND INLAND PORT INFRASTRUCTURE\nOffered by | Ranbir and Chitra Gupta School of Infrastructure Design and Management\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | {{{semester}}}", "page": "ID60006: Sea And Inland Port Infrastructure"}, {"chunk_id": "987f106a", "title": "Syllabus mentioned in ERP", "text": "Introduction: Ports and harbours as the interface between the water and land infrastructure- an infrastructure layer between two transport media The fundamentals: Wave conditions inside harbour; water circulation; breakwaters, jetties & quay walls; mooring, berthing and ship motion inside the port; cargo handling – bulk material storage & handling Design issues: Sea port layout with regards to (1) wave action (2) siltation (3) navigability berthing facilities, design of port infrastructures with regards to (1) cargo handling (2) cargo storage (3) integrated transport of goods, planning multipurpose port terminals. Port operations: Allowable wave conditions for cargo handling, wave conditions for human safety on quays and breakwaters, forecasting/nowcasting of wave & current conditions for port operations, dredging and navigability, hazard scenarios; VTMS & management of computerized container terminal, safety & environment (handling of fire, oil spill, rescue, etc.). Inland Waterways and ports: Maintenance of waterways, construction of environmentally engineered banks, dredging, processing and storing of polluted dredged materials, development of river information services, planning, design and construction of inland port infrastructure, renovation of inland port infrastructure. Sustainability: Global trade and port restructuring/ reforms, impact of possible climate change scenarios, sustainable development strategies for cities and ports.", "page": "ID60006: Sea And Inland Port Infrastructure"}]