[{"chunk_id": "info_b4230a", "title": "IE40011: Intelligent Control - Quick Facts", "text": "IE40011\nCourse name | Intelligent Control\nOffered by | Instrumentation Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | Autumn", "page": "IE40011: Intelligent Control"}, {"chunk_id": "7e98daae", "title": "Syllabus mentioned in ERP", "text": "Introduction and motivation. Approaches to intelligent control. Architecture for intelligent control. Symbolic reasoning system, rule-based systems, the AI approach. Knowledge representation. Expert systems. Concept of Artificial Neural Networks and its basic mathematical model, McCulloch-Pitts neuron model, simple perceptron, Adaline and Madaline, Feed-forward Multilayer Perceptron. Learning and Training the neural network. Data Processing: Scaling, Fourier transformation, principal-component analysis and wavelet transformations. Networks: Hopfield network, Self-organizing network and Recurrent network. Neural Network based controller Case studies: Identification and control of linear and nonlinear dynamic systems using Matlab-Neural Network toolbox. Stability analysis of Neural-Network interconnection systems. Genetic Algorithm: Basic concept of Genetic algorithm and detail algorithmic steps, adjustment of free parameters. Solution of typical control problems using genetic algorithm. Concept on some other search techniques like tabu search and ant-colony search techniques for solving optimization problems. Introduction to crisp sets and fuzzy sets, basic fuzzy set operation and approximate reasoning. Introduction to fuzzy logic modeling and control. Fuzzification, inferencing and defuzzification. Fuzzy knowledge and rule bases. Fuzzy modeling and control schemes for nonlinear systems. Self-organizing fuzzy logic control. Fuzzy logic control for nonlinear time-delay system. Implementation of fuzzy logic controller using Matlab fuzzy-logic toolbox. Stability analysis of fuzzy control systems.", "page": "IE40011: Intelligent Control"}]