[{"chunk_id": "016d7557", "title": "Illumination", "text": "Illumination (also popular as Illu ) is a tradition followed by every hall of residence at IIT Kharagpur during the Diwali festival every year. Large grid structures (called chatai) made of bamboo stripes are used as a framework on which wire loops are mounted to support earthen lamps, known as Diyas. The Diyas form a pattern based on a theme decided by the respective student hall. The event is attended by students from different halls of residence, alumni, faculty, and guests of honor from outside the institute. Judges are selected from amongst the faculty and take multiple routes to visit the different halls, starting at the Technology Students' Gymkhana (TSG) .\nOn the day of Diwali, prior to the arrival of the chief guests, judges, and other officials, mounted Diyas are lit up to showcase the intricate pictorial description. Based on the Illu theme for a given hall, it is decorated using backlit panels (handmade from chart and Diyas), ornate flower patterns, and symbolic Diya arrangements.\nPreparations for Illu starts several weeks before Diwali and involves active collaboration between the residents and staff of a hall, with a separate committee often being formed from the senior batches to develop designs, strategize, and execute the event.", "page": "Illumination"}, {"chunk_id": "3287951c", "title": "The Origins of Illumination", "text": "Back in 1981, certain innovative students from the Azad Hall of Residence decided to celebrate Diwali by lighting scores of Diyas on giant chatais. In characteristic fashion, the Nehru Hall of Residence decided to make a General Championship event out of it- calling it the Bigyan Sinha Memorial Cup. Up to the year 2013, the top 3 halls were chosen for the best showcases by the Gymkhana (TSG) and were awarded a pot of Rasgulla. While the competition was dropped in the year 2014-15, the student community continued celebrating Illu with the same zeal.\nThe Rangoli event is synonymous with Illu, where large sand art pieces are designed and created using Rangoli powder. Most halls produce designs that measure in excess of 80 square meters.", "page": "Illumination"}, {"chunk_id": "cfe490f7", "title": "Styles", "text": "Over years, each student hall has developed a unique art style, each highly anticipated for the theme and execution style. For example, the Rajendra Prasad Hall of Residence is known for their negative solid-filling style of the chatais , while Azad Hall is known for elaborate mythological-themed designs. Several halls have begun incorporating ultraviolet colors into their Rangoli designs, rendering different images when viewed under normal light and ultraviolent light.", "page": "Illumination"}, {"chunk_id": "8d41ad7c", "title": "Gallery", "text": "Preparations for Illumination | The buddha, ILLU 2014 | Rangoli made by colors in LBS Hall, 2014 | ILLU celebration in LBS Hall, 2014", "page": "Illumination"}]