[{"chunk_id": "info_f0ae66", "title": "IM31012: Optimisation And Heuristic Methods - Quick Facts", "text": "IM31012\nCourse name | Optimisation And Heuristic Methods\nOffered by | Industrial & Systems Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n8 12 9 10 7 3 2 EX A B C D P F | 8 | 8 | 12 | 12 | 9 | 9 | 10 | 10 | 7 | 7 | 3 | 3 | 2 | 2 | EX | A | B | C | D | P | F\n8 | 8 | 12 | 12 | 9 | 9 | 10 | 10 | 7 | 7 | 3 | 3 | 2 | 2\n8\n12\n9\n10\n7\n3\n2\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "IM31012: Optimisation And Heuristic Methods"}, {"chunk_id": "2764a4fb", "title": "Syllabus mentioned in ERP", "text": "Prerequisites: IM21003 Operations Research-IGenetic Algorithm: Mechanism, Appraisal of GA performance, Data structure, Procedures, Operations and techniques in genetic search, Computer implementation, Applications.Neural Networks: Introduction, multi-layer networks, recurrent networks, learning paradigms.Data Envelopment Analysis (DEA): Definitions, Relative efficiency measurement, Solutions to the DEA Model, Dual DEA Model, DEA issues. Fuzzy optimization: Soft constraints, Approximate reasoning, Multi-criteria soft decision modelling, Interactive approach, Developing expert systems using fuzzy logic.Simulated Annealing: Metropolis algorithm, Heat Bath Algorithm, Fast simulated annealing, Very fast simulated annealing, Mean field annealing.Chaos: complexity and simplicity, evolution of possibilities, simple models of chaos, strange attractors, deterministic chaos, self-organization, synergistics.Evolutionary computing: hybrid intelligent system, evolutionary dynamics, evolutionary engineering and its application.Booksâ¢Goldberg D.E., Genetic Algorithms in Search Optimization and Machine Learning, Addison Wesley, Reading, MA, USA, 1989.â¢Stamatios V. Kartalopoulos, Understanding Neural Networks and Fuzzy Logic â Basic Concepts and Applications, Prentice Hall of India, New Delhi, 2002â¢Deb K., Multi-Objective Optimization Using Evolutionary Algorithms, Chichester, 2002. â¢Rajasekaran S. and G.A. Vijayalakshmi Pai, Neural Networks, Fuzzy Logic, and Genetic Algorithm â Synthesis and Applications, Prentice Hall of India, New Delhi, 2003â¢Ramanathan R. (2003), An Introduction to Data envelopment Analysis â A Tool for Performance Measurement, Sage Publications, New Delhi.", "page": "IM31012: Optimisation And Heuristic Methods"}]