[{"chunk_id": "info_5f8631", "title": "IM31007: Production Planning And Control - Quick Facts", "text": "IM31007\nCourse name | Production Planning And Control\nOffered by | Industrial & Systems Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n4 4 12 7 15 13 1 EX A B C D P F | 4 | 4 | 4 | 4 | 12 | 12 | 7 | 7 | 15 | 15 | 13 | 13 | 1 | 1 | EX | A | B | C | D | P | F\n4 | 4 | 4 | 4 | 12 | 12 | 7 | 7 | 15 | 15 | 13 | 13 | 1 | 1\n4\n4\n12\n7\n15\n13\n1\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "IM31007: Production Planning And Control"}, {"chunk_id": "2e140ee7", "title": "Syllabus mentioned in ERP", "text": "Prerequisite: IM21003 Operations Research-1Demand forecasting: Long and Shortterm demand forecasting methods, Regression analysis and smoothing methods, Estimation of trend, cycle, and seasonality components, Analysis of forecast error and computer control of forecasting systems.Production-distribution system design: Plant location and capacity scheduling, Multiple plant production facility design.Aggregate planning and master production scheduling, Aggregation techniques, Aggregate capacity scheduling, Disaggregation of aggregate plan. Master production scheduling: Analytical and computer integrated solution techniques, Operations scheduling and control: Basic sequencing and scheduling techniques, Dispatching rules, Progress chasing and Updating of production schedules.Design of production planning and control systems: system design for continuous and intermittent production systems, Integration of master production, Material requirement and Shop scheduling systems.Books.S.L. Narasimhan, D.W. Mc Leavy, and P.J. Billington, Production Planning and Inventory Control, PHI, 2nd Edition.R.Peterson, and E.A. Silver, Decision Systems for Inventory Management and Production Planing, John Wiley and Sons.C.C. Holt, F. Modigliani, J.F. Muth, and H.A. Simon, Planning Production, Inventories, and Workforce, Prentice Hall, NJ.G.W. Plossi, and O.W. Wright, Production and Inventory Control, Prentice Hall, NJ.", "page": "IM31007: Production Planning And Control"}, {"chunk_id": "f03308b3", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | ISE-E1\nTuesday\nWednesday | ISE-E1 | ISE-E1\nThursday | ISE-E1\nFriday", "page": "IM31007: Production Planning And Control"}]