[{"chunk_id": "info_750d16", "title": "IM31005: Quality Design And Control - Quick Facts", "text": "IM31005\nCourse name | Quality Design And Control\nOffered by | Industrial & Systems Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n5 3 13 12 13 6 2 EX A B C D P F | 5 | 5 | 3 | 3 | 13 | 13 | 12 | 12 | 13 | 13 | 6 | 6 | 2 | 2 | EX | A | B | C | D | P | F\n5 | 5 | 3 | 3 | 13 | 13 | 12 | 12 | 13 | 13 | 6 | 6 | 2 | 2\n5\n3\n13\n12\n13\n6\n2\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "IM31005: Quality Design And Control"}, {"chunk_id": "3229c607", "title": "Syllabus mentioned in ERP", "text": "Prerequisites: IM21003 Operations Research-1 History and Evolution of Quality Control and Management.Management of Quality: Meaning of Management of Quality, Quality Engineering, Strategic Management of Quality, Management Programs for Quality, Fundamentals of Total Quality Management (TQM), Quality Loop, Quality System Standards (ISO 9000).Probability Models for Quality Control, Descriptive Statistics, Sampling, and Inferences.Statistical Process Control (SPC): (a) Control Chart Principles: Causes of Variation, Statistical Aspects of Control Charting, Concept of Rational Subgrouping, Detecting Patterns on Control Chart, (b) Control Charts for Attributes: p, np, c, u, and U charts, (c) Control Charts for Variables: R, X, S, and X charts, (d) Special Control Charts: Cusum, Trend, Modified and Acceptance, Moving Average, Geometric Moving Average, and Multivariate Control Charts, (e) Specifications and Tolerances: Natural Tolerance Limits and Specification Limits, Process Capability Ratios, and Process Capability Analysis.Acceptance Sampling: (a) Fundamental Concepts, (b) Acceptance Sampling by Attributes: Single, Double, Multiple, and Sequential Sampling Plans, MIL-STD-105E, Dodge-Romig, and ANSI-ASQC-Z1.4 Plans, Continuous Sampling Plans, (c) Acceptance Sampling by Variables: Types of Plans, Plans for a Process Parameter, Plans to Control the Lot Percent Nonconforming, MIL-STD414 and ANSI/ASQC Z 1.9. Reliability Prediction and Life Testing: Reliability of a System, Exponential Model in Reliability, Life Testing using Exponential and Weibull Models, Fundamentals of Maintenance Management, Concept of Total Productive Maintenance (TPM).Product and Process Design: (a) Experimental Designs: Completely Randomized Design, Randomized Block Design, Latin Square Design, (b) Factorial Experiments, (c) Taguchi Methods in Design and Quality Improvement: Taguchi Philosophy, Loss Function, S/N Ratio and Performance Measures, Experimental Design and Parameter Design in Taguchi Methods.Textbook.Mitra, A.Fundamentals of Quality Control and Improvement, Prentice-Hall, 2nd Edn.(1998), ISBN 0-13-645086-5References: Duncan, A. J., Quality Control and Industrial Statistics, Richard D. Irwin, 5th ed. (1986).Montgomery, D. C., Introduction to Statistical Quality Control, John Wiley, 3rd ed. (1996).Banks, J., Principles of Quality Control, John Wiley, 1989.Grant, E. L. and Leavenworth, R. S., Statistical Quality Control, McGraw Hill, 5th ed.(1988)", "page": "IM31005: Quality Design And Control"}, {"chunk_id": "5a358d9f", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | QEDM-Seminar Room\nThursday | QEDM-Seminar Room\nFriday | QEDM-Seminar Room | QEDM-Seminar Room", "page": "IM31005: Quality Design And Control"}]