[{"chunk_id": "info_06a675", "title": "IM60021: Production Planning And Inventory Control - Quick Facts", "text": "IM60021\nCourse name | Production Planning And Inventory Control\nOffered by | Industrial & Systems Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n1 1 1 4 EX A B C D P F | 1 | 1 | 1 | 1 | 1 | 1 | 4 | 4 | EX | A | B | C | D | P | F\n1 | 1 | 1 | 1 | 1 | 1 | 4 | 4\n1\n1\n1\n4\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "IM60021: Production Planning And Inventory Control"}, {"chunk_id": "394f68c1", "title": "Syllabus mentioned in ERP", "text": "Production Planning & Control Systems : Classification, activities and matching of PPC system with the Firm. Basic material and Information Flow. Material Requirements Planning and Lot Sizing. Just-In-Time Production. Capacity planning: tools and techniques. Production Control principles and techniques. Short-range forecasting techniques. Independent demand Inventory Management. EOQ Models and order timing decisions, Safety Stock and reorder level decisions. Order quantity and reorder point. Interactions with other functions and multi-item management. Distribution Requirement Planning. Spare parts inventory control. Books •S.L. Narasimhan, D.W. Mc Leavy, and P.J. Billington, Production Planning and Inventory Control, PHI, 2nd Edition. •R.Peterson, and E.A. Silver, Decision Systems for Inventory Management and Production Planing, John Wiley & Sons. •C.C. Holt, F. Modigliani, J.F. Muth, and H.A. Simon, Planning Production, Inventories, and Workforce, Prentice Hall, NJ. •G.W. Plossi, and O.W. Wright, Production and Inventory Control, Prentice Hall, NJ. •Starr, K. K. and D. W. Miller, Inventory Control: Theory and Practice, Prentice Hall •Silver, E. A., D. F. Pyke and R. Peterson, Inventory Management and Production Planning and Scheduling, John Wiley, 3rd ed., 1998.", "page": "IM60021: Production Planning And Inventory Control"}, {"chunk_id": "5d6ef647", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | ISE-C3\nTuesday | ISE-C3 | ISE-C3\nWednesday\nThursday | ISE-C3\nFriday", "page": "IM60021: Production Planning And Inventory Control"}]