[{"chunk_id": "info_f6bd1c", "title": "IM60052: Logistics And Supply Chain Management - Quick Facts", "text": "IM60052\nCourse name | Logistics And Supply Chain Management\nOffered by | Industrial & Systems Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n2 1 EX A B C D P F | 2 | 2 | 1 | 1 | EX | A | B | C | D | P | F\n2 | 2 | 1 | 1\n2\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "IM60052: Logistics And Supply Chain Management"}, {"chunk_id": "90c9c25d", "title": "Syllabus mentioned in ERP", "text": "Prerequisite: IM21003 Operations Research-1 Nature and scope of logistics, Logistics environment, Logistic decisions: facility location, transportation, storage and material handling, Logistics information systems, Logistics audit and control.Introduction to SCM- Principles and issues, Inbound and outbound logistics: Supply chain as a source of competitive advantage, Supply chain coordination- procurement, vendor development, reduced sourcing and supplier partnership, Managing inventory in SCM and Risk pooling, coordinated inventory decision, Coordinated pricing decision, coordinated product and process designDistribution strategies- customer service, physical distribution planning, Material handling, Facility and warehousing decision, Strategic considerations for supply chain: Porters industry analysis and value chain models, the concept of total cost of ownership, Supply chain management strategies, Logistics strategies and global supply chain management, Measuring effectiveness of supply chain management, Operations research Models for operational and strategic issues in supply chain management, Value of information sharing in supply chain management, The Bullwhip effect and supply chain management game. E supply chain and its performance. Case Studies in supply chain managementBooks Business Logistics/Supply Chain Management, Ronald Ballou, Pearson Education.The Management of Business Logistics A Supply Chain Perspective, Coyle, Bardi, and Langley, Thomson Asia.Designing and Managing the Supply Chain, David Simchi Levi, Philip Kaminsky, Edith Simchi Levi, Tata McGraw Hill. Logistics: An Introduction to Supply Chain Management, Walters, Palgrave Macmillan.", "page": "IM60052: Logistics And Supply Chain Management"}, {"chunk_id": "c5a4aede", "title": "External links", "text": "• Supply Chain Management Govt Approved Courses", "page": "IM60052: Logistics And Supply Chain Management"}, {"chunk_id": "edbc6501", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | ISE-E1 | ISE-E1 | ISE-E1\nTuesday | ISE-E1\nWednesday\nThursday | ISE-E1\nFriday | ISE-E1", "page": "IM60052: Logistics And Supply Chain Management"}]