[{"chunk_id": "info_45d0ca", "title": "IM60059: Financial Engineering - Quick Facts", "text": "IM60059\nCourse name | Financial Engineering\nOffered by | Industrial & Systems Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n7 10 13 5 7 6 EX A B C D P F | 7 | 7 | 10 | 10 | 13 | 13 | 5 | 5 | 7 | 7 | 6 | 6 | EX | A | B | C | D | P | F\n7 | 7 | 10 | 10 | 13 | 13 | 5 | 5 | 7 | 7 | 6 | 6\n7\n10\n13\n5\n7\n6\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "IM60059: Financial Engineering"}, {"chunk_id": "90ebad4c", "title": "Syllabus mentioned in ERP", "text": "Prerequisite: IM21003 Operations Research-I The Black-Scholes Equation ÃÂ¢ÃÂÃÂ Background, Definitions, Hedging strategies, Brownian Motion, Geometric Brownian motion with drift, Ito s Lemma, The Black-Scholes Analysis, Hedging in Continuous Time, The option price.Monte Carlo Methods - Monte Carlo Error Estimators, The Box-Muller Algorithm, Low Discrepancy Sequences, Correlated Random Numbers, The Brownian Bridge The Binomial Model, No-arbitrage Lattice Derivative Contracts on non-traded Assets and Real Options - Derivative Contracts, A Forward Contract, Convenience Yield. Discrete Hedging - Delta Hedging, Gamma Hedging, Vega Hedging Jump Diffusion - The Poisson Process, The Jump Diffusion Pricing Equation Mean Variance Portfolio Optimization - The Portfolio Allocation Problem, Adding a Risk-free asset, Individual Securities. TextÃÂ¢ÃÂÃÂ¢Options, Futures, and Other Derivatives, J C Hull, Prentice Hall of India, Sixth Edition, 2007ÃÂ¢ÃÂÃÂ¢Principles of Financial Engineering, S N Neftci, Academic Press, Elsevier, 2004.ÃÂ¢ÃÂÃÂ¢An Introduction to Computational Finance without Agonizing Pain, Peter Forsyth 2005, www.scicom.uwaterloo.ca/paforsyt", "page": "IM60059: Financial Engineering"}, {"chunk_id": "7f2c0185", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | ISE-C1\nThursday | ISE-C1\nFriday | ISE-C1", "page": "IM60059: Financial Engineering"}]