[{"chunk_id": "info_741279", "title": "IM60054: E-Business - Quick Facts", "text": "IM60054\nCourse name | E-Business\nOffered by | Industrial & Systems Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n4 8 10 13 4 3 1 EX A B C D P F | 4 | 4 | 8 | 8 | 10 | 10 | 13 | 13 | 4 | 4 | 3 | 3 | 1 | 1 | EX | A | B | C | D | P | F\n4 | 4 | 8 | 8 | 10 | 10 | 13 | 13 | 4 | 4 | 3 | 3 | 1 | 1\n4\n8\n10\n13\n4\n3\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "IM60054: E-Business"}, {"chunk_id": "e0240f7f", "title": "Syllabus mentioned in ERP", "text": "Prerequisite: NoneManaging Business in the Digital World: Introduction, How IT has changed the concepts of traditional MIS with examples and case studies. Basic understanding of e-business building blocks, Emerging e-Business models ÃÂ¢ÃÂÃÂ B2B, B2C, C2C etc., Case-studies on e-auctions, electronic markets, electronic procurement, automated supply chains, e-marketing, e-customer relationship management, e-finance systems, and negotiations support systems.Evaluation of E-Business Infrastructure and Capacity Planning: Quantitative analysis of authentication and payment services, Capacity planning methodologies, Performance models for e-business sites, Modelling web-server workload.Techniques for Achieving Competitive Advantage: Collecting userbehaviour data, Web mining, user modelling, Recommender and personalisation systems, Website design benchmarking and usability, Dynamic pricing, Software agents, Web services, Web matrices.Mathematical Models for E-Business Systems: Online auctions: Types of auctions ÃÂ¢ÃÂÃÂ English auctions, sealed-bid auctions, reverse auctions, and double auctions, Game theoretic models for auctions. Online negotiation: negotiation theory, negotiation support system, negotiation models in e-supply chain systems, Models for managing online reputation and trust.Information economy, Policy and law, Fraud, trust and privacy issues.Books1Scaling for E-Business: Technologies, Models, Performance, and Capacity Planning, Daniel A. MenascÃÂÃÂ©, Virgilio A. F. Almeida, Prentice Hall 2Management Information Systems- Managing Information Technology in EBusiness Enterprises, James A. Brien, TMH 3Auction Theory, Vijay Krishna, Academic Press", "page": "IM60054: E-Business"}]