[{"chunk_id": "info_eae41e", "title": "IM60041: Technology Management - Quick Facts", "text": "IM60041\nCourse name | Technology Management\nOffered by | Industrial & Systems Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | Autumn", "page": "IM60041: Technology Management"}, {"chunk_id": "f70c5ec1", "title": "Syllabus mentioned in ERP", "text": "Technology management – Scope, components, and overview. Technology and environment, Technology and society, Technology Impact analysis, environmental, social, legal, political aspects, methods or techniques for analysis – steps involved. Technology policy strategy: Science and technology Policy of India, implications to industry. Technology forecasting – need, methodology and methods – trend Analysis, Analogy, Delphi, Soft System Methodology, Mathematical Models, Simulation, and System Dynamics. Technology Choice and Evaluation – Methods of analyzing alternate technologies, Techno-economic feasibility studies, Need for multi-criteria considerations such as, social, environmental, and political, Analytic hierarchy method, Fuzzy multi-criteria decision making, and other methods. Technology Transfer and Acquisition – Import regulations, Implications of “Uruguay Round”, and WTO, Bargaining process, Transfer option, MOU. Technology Adoption and Productivity – Adopting technology-human interactions, Organizational redesign and re-engineering, Technology productivity. Technology Absorption and Innovation – present status in India, Need for new outlook, Absorption strategies for acquired technology, Creating new/improved technologies, Innovations. Technology Measurement. Technology Audit.\nText •From Knowledge Management To Strategic Competence: Measuring Technological, Market and Organisational Innovation (Second Edition), edited by Joe Tidd (SPRU, University of Sussex, UK) •Market-Oriented Technology Management by Fred Phillips, Springer •Technology Management – Lecture Notes, Ed. K. Vizayakumar, IIT, Kharagpur. Reference Books •Management of Technology (Hardcover) by Tarek Khalil, Maximilian von Zedtwitz, Georges Haour, Louis A. Lefebvre, Pergamon. •Management of Technology: Key Success Factors for Innovation and Sustainable Development by Laure Morel- Guimaraes, Tarek Khalil, Yasser A Hosni , Elsevier Science. •Technology Management:Text and International Cases by Norma Harrison, Danny Samson , McGraw-Hill/Irwin; 1 edition, 2001, ISBN: 0072383550", "page": "IM60041: Technology Management"}]