[{"chunk_id": "info_40e9c5", "title": "IM60056: Applied Multivariate Statistical Modeling - Ii - Quick Facts", "text": "IM60056\nCourse name | Applied Multivariate Statistical Modeling - Ii\nOffered by | Industrial & Systems Engineering\nCredits | 4\nL-T-P | 4-0-0\nPrevious Year Grade Distribution\n2 7 11 3 9 5 EX A B C D P F | 2 | 2 | 7 | 7 | 11 | 11 | 3 | 3 | 9 | 9 | 5 | 5 | EX | A | B | C | D | P | F\n2 | 2 | 7 | 7 | 11 | 11 | 3 | 3 | 9 | 9 | 5 | 5\n2\n7\n11\n3\n9\n5\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "IM60056: Applied Multivariate Statistical Modeling - Ii"}, {"chunk_id": "00c4b084", "title": "Syllabus mentioned in ERP", "text": "Generalized linear Models (GLM) – The role of link function, parameter estimation and inference in the GLM, prediction and estimation with GLM. Logistic regression analysis – Representation of binary dependent variable, estimating logistic regression model, assessing overall fit, interpretation of results, validations, and case examples. Poisson and Negative Binomial Regression Models – Objectives, design and assumptions, estimation, diagnostic tests, and interpretation of results. Log-linear models - Log-linear models for two-way, three-way, and multi-way tables, fitting a loglinear model, relationship with logit analysis on categorical variables. Linear Mixed Models (LMMs)- Specifications of LMMs, the marginal linear model, estimation, model selection, model building strategies, and model adequacy checking. Hand on experience through EXCEL, MATLAB and SPSS. Textbooks and References •John P Hoffmann., Generalized linear models, Pearson, New York, 2004,204 pp. •Douglas C Montgomery, Elizabeth A Peck and G Geoffrey Vining, Introduction to linear regression analysis, Wiley India, 2006, 641 pp. •Hair J.F., Anderson R.E., Tatham R.L., Black W.C., Multivariate data analysis with readings, Prentice Hall, Englewood Cliffs, New Jersey 07632, 1995, 745 pp. •Agresti A. Analysis of ordinal categorical data, John Wiley & Sons, New York, 1984, 287 pp. •Anderson S., Aquier A., Hauck W.W., Oakes D., Vandaele W., and Weisberg, H.I., Statistical methods for comparative studies, John Wiley & Sons, New York, 1980, 287 pp. •Brady T West, Kathleen B Welch and Andrzej T Galecki, Linear mixed models, Chapman and Hall/CRC, London, 2007, 353 pp.", "page": "IM60056: Applied Multivariate Statistical Modeling - Ii"}]