[{"chunk_id": "info_e82734", "title": "IM60062: Six Sigma Fundamentals And Applications - Quick Facts", "text": "IM60062\nCourse name | Six Sigma Fundamentals And Applications\nOffered by | Industrial & Systems Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n8 23 21 15 12 EX A B C D P F | 8 | 8 | 23 | 23 | 21 | 21 | 15 | 15 | 12 | 12 | EX | A | B | C | D | P | F\n8 | 8 | 23 | 23 | 21 | 21 | 15 | 15 | 12 | 12\n8\n23\n21\n15\n12\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "IM60062: Six Sigma Fundamentals And Applications"}, {"chunk_id": "b044ba03", "title": "Syllabus mentioned in ERP", "text": "Introduction to Six Sigma: Definitions and success stories, six sigma framework, DMAIC – the six sigma improvement process, statistics and six sigma, difference between six sigma and TQM. Preparing for Deployment: Elements of successful deployment, personal requirements – champions, black belts, and green belts, and focusing on deployment – customer focus, project selection, and QFD. Six Sigma Tools: Exploratory tools – Charts, diagrams, and metrics, Data collection and monitoring tools – primary and secondary data, instrument design and sample survey, gage R&R, and attribute measurement systems, and SPC, Analysis tools – Diagrams, Hypothesis testing, ANOVA, correlation and regression (linear and logistic), and FMECA. Six Sigma Methodology (DMAIC): Define – objectives, process thinking, process mapping, balanced scorecard, project selection and tracking, Measure – objectives, measurements (discrete vs continuous), measurement as a process, baseline estimation, performance metrics, and measurement system analysis, Analysis – objectives, value stream analysis, analyzing sources of variations, and determining process drivers, Improve – objectives, defining new process, benchmarking, prioritizing and selecting a solution, and corrective action matrix, Control – objectives, more on SPC, visual control, best practices and lessons learned, and documenting process changes. Case studies: Selective cases with hands on exercises. Textbooks and References •Keller, P. (2005). “Six Sigma Demystified”. Tata McGraw-Hill, New Delhi. •Breyfogle, F. W. III, Cupello, J. M. and Meadows, B. (2001). “Managing Six Sigma”. John Wiley and Sons, New York. •Pyzdek, T. (2003). “Six Sigma Handbook”. McGraw-Hill, New York.", "page": "IM60062: Six Sigma Fundamentals And Applications"}]