[{"chunk_id": "info_9a001c", "title": "IM60061: Applied Multivariate Statistical Modeling - I - Quick Facts", "text": "IM60061\nCourse name | Applied Multivariate Statistical Modeling - I\nOffered by | Industrial & Systems Engineering\nCredits | 4\nL-T-P | 4-0-0\nPrevious Year Grade Distribution\n3 10 11 17 3 5 EX A B C D P F | 3 | 3 | 10 | 10 | 11 | 11 | 17 | 17 | 3 | 3 | 5 | 5 | EX | A | B | C | D | P | F\n3 | 3 | 10 | 10 | 11 | 11 | 17 | 17 | 3 | 3 | 5 | 5\n3\n10\n11\n17\n3\n5\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "IM60061: Applied Multivariate Statistical Modeling - I"}, {"chunk_id": "44697987", "title": "Syllabus mentioned in ERP", "text": "APPLIED MULTIVARIATE STATISTICAL MODELLING â I4-0-0 4Definitions and basic concepts of multivariate modelling â variate, type of variables, measurement scale, measurement error, multivariate measurement; types of multivariate techniques, classification of multivariate techniques, guidelines for multivariate analysis, structured approach to multivariate model building, and cases for multivariate modelling.Multivariate basics â multivariate descriptive statistics, statistical distance, multivariate normal distribution and its properties, examining data and outliers detection, and multivariate sampling distributions.Comparison of several multivariate means â paired comparisons.Multivariate modelling of variance (MANOVA) â Univariate procedure, objectives, design issues and assumptions, estimation of MANOVA model, goodness of fit, interpretation of results, validations, and case examples. Multiple linear regressions - Objectives, design and assumptions, estimating the regression model and assessing overall model fit, interpreting the regressing variate, validation of results, stepwise and hierarchical regression, and case examples. Principal component analysis â Objectives, population principal components, method of estimation, interpretation of components, and case examples.Discriminant analysis â Objective, design and assumptions, estimating discriminant model and assessing overall fit, results and validations, case examples.Factor analysis - Objectives, design issues and assumptions, orthogonal factor model, method of estimation, principal component analysis, maximum likelihood method, factor rotation, factor scores, interpretation of factors, and case examples.Path Analysis and Structural equation modelling â Developing modelling strategy, confirmatory and competing models, stages in structural equation modelling, developing a theoretically based model, constructing path diagram, converting path diagram to structural equations, input matrix, measurement model, LISREL, goodness of fit criteria, and case examples.Hand on experience through EXCEL, MATLAB and SPSS.Textbooks and Referencesa.Johnson R.A. and Wichern D.W., Applied Multivariate Statistical Analysis, Pearson Education, Delhi, 2002, 767 pp. b.Hair J.F., Anderson R.E., Tatham R.L., Black W.C., Multivariate data analysis with readings, Prentice Hall, Englewood Cliffs, New Jersey 07632, 1995, 745 pp. c.Agresti A. Analysis of ordinal categorical data, John Wiley and Sons, New York, 1984, 287 pp. d.Anderson S., Aquier A., Hauck W.W., Oakes D., Vandaele W., and Weisberg, H.I., Statistical methods for comparative studies, John Wiley and Sons, New York, 1980, 287 pp.", "page": "IM60061: Applied Multivariate Statistical Modeling - I"}, {"chunk_id": "51931980", "title": "How to Crack the Paper", "text": "Whatever he teaches in class are available in NPTEL lectures, go through them during the entire semester. Solve enough questions before going to the exam. Almost 60% of the paper are numerical in which you will get super confused if you haven't practiced. 40% paper is theory in which you will be easily able to score if you have followed his lectures.", "page": "IM60061: Applied Multivariate Statistical Modeling - I"}, {"chunk_id": "8bb97b94", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | ISE-C1\nTuesday | ISE-C1 | ISE-C1\nWednesday\nThursday | ISE-C1\nFriday", "page": "IM60061: Applied Multivariate Statistical Modeling - I"}]