[{"chunk_id": "74e31363", "title": "Context", "text": "If you have a piece of MATLAB code that requires high compute power, it is recommended that you take a remote server from the Meghamala Service: IIT Kharagpur and run your MATLAB code on the remote server. The following are the steps to install MATLAB on a remote server in KGP", "page": "Install MATLAB on a remote server(KGP)"}, {"chunk_id": "bbea0361", "title": "Steps", "text": "• Getting License: Since MATLAB is a proprietary software, installing it requires a license. You need to mail [ ] asking for the MATLAB license. You will receive 2 files named - FIK.txt and network.lic\n• Copy those two files on the remote server using scp command .Copy the files preferably in the home directory.\n• SSH into the server.\n• Download the Linux ISO image of MATLAB on the server using wget command. For example if you want to install MATLAB 2021B version, run the following command on the server.\nwget http://swrepo.iitkgp.ac.in/Matlab2021B/Linux/R2021b_Linux.iso\n5. Mount the ISO image on a directory(make sure that directory has enough space, at least 50 GB) using the following command. Here we are mounting in a new directory called mathworks created in the the directory /media\nsudo mount -o loop R2021b_Linux.iso /media/mathworks\n6. In the /media/matworks directory, you will find many files. Among them, you will find the file called installer_input.txt\n7. Copy the contents of the file - installer_input.txt and paste them in a new file with preferably same name in a different directory(for example in home ). This installer_input.txt contains the MATLAB installation options, which need to be edited. The file is copied to a different location(like here home ) and edited there because one can't edit the installer_input.txt file in the mounted location - /media/mathworks\n8. Open the installer_input.txt present in home directory and edit the following lines\nYou can edit the options according to your usage. Here we assume that the machine username is ubuntu. Create a directory named matlab in home directory. We will be installing matlab in this directory. Hence path to this directory is the destinationFolder\ndestinationFolder=/home/ubuntu/matlab\nCopy the text in the FIK.txt file,(file copied on the server in the second step) which is the format of xxxxx-xxxxx... and paste the key\nfileInstallationKey=12345-24564-.....\nagreeToLicense=yes\nLog files to check if installation is successful or not\noutputFile=/tmp/mathworks_ubuntu.log\nPath to network.lic file, which was copied on to the server using scp in the second step\nlicensePath=/home/ubuntu/network.lic\n9. Now to install matlab as per the above options, move to the directory /media/mathworks , where MATLAB iso image was mounted. To install run the following command\nsudo ./install -inputFile /home/ubuntu/installer_input.txt\nThe process will take some time. You can check the status of download at the file - /tmp/mathworks_ubuntu.log\n(Mar 16, 2022 18:16:44) Exiting with status 0\n(Mar 16, 2022 18:16:44) End - Successful\n10. To run matlab as a executable, add an alias in the ~/.bashrc file\nalias mat=/home/ubuntu/matlab/matlab/bin/matlab\nReload the session using the command - source ~/.bashrc\n11. To check if matlab is installed or not, try running the command matlab -help", "page": "Install MATLAB on a remote server(KGP)"}, {"chunk_id": "8f3151cc", "title": "Troubleshooting", "text": "• Sometimes the installation process fails because the directory might not have enough space. Please recheck the issue. From time to time monitor the log file.\n• In case of permission issues, try running the same command using sudo", "page": "Install MATLAB on a remote server(KGP)"}, {"chunk_id": "164ef88c", "title": "Usage", "text": "To run a MATLAB code on a long time, it would be a good idea to run the script in the background using a tool called tmux .\nFollow the steps.\n• Move to the directory where your code is present\n• Open a new tmux session, using the command tmux new\n• Open MATLAB without desktop using the command - matlab -nodesktop\n• You get access to MATLAB's command window\n• Run the script you wish to run\n• Save the workspace variables in a .mat file by runnning the following command in MATLAB command window - save('script_vars.mat')\n• scp the .mat file to your machine\n• Load the .mat file on MATLAB, installed on your personal machine using - load('script_vars.mat')\n• You can now write code to analyse the data in .mat file", "page": "Install MATLAB on a remote server(KGP)"}, {"chunk_id": "41db4a56", "title": "Contact", "text": "If you face any issues while following the above instructions, feel free to contact Raghavendra Kaushik( [email protected] )", "page": "Install MATLAB on a remote server(KGP)"}]