[{"chunk_id": "f1571f5b", "title": "Internet and LAN", "text": "IIT Kharagpur operates the largest academic network in the eastern region of India. Internet access is provided through both wired and wireless connections from academic areas, halls of residences, and the residential complex.", "page": "Internet and LAN"}, {"chunk_id": "bb6d816f", "title": "VPN", "text": "Access to restricted applications (WhatsApp, Messenger, Torrents, etc.) can be gained through the use of VPN applications .\nFollowing is a non-exhaustive list of working VPNs:\n• Windows: Psiphon\n• MacOS: FreeVPN Org , Hotspot Shield VPN\n• Linux: Self hosted OpenVPN\n• Android: Psiphon\n• iOS: Psiphon\n• Router: OpenVPN hosted on Azure/AWS/DigitalOcean Server\nYou can self host OpenVPN server on AWS / Azure / DigitalOcean for free for 12 months per service:\n• Tutorial to setup OpenVPN on Azure Server - https://www.youtube.com/watch?v=OISyfkvxUaQ\n• Tutorial to setup OpenVPN on AWS Server [ 1 ] - https://iitkgp-network.netlify.app/#/general/vpn", "page": "Internet and LAN"}, {"chunk_id": "1660d9ed", "title": "DC / DC++", "text": "Main article: DC", "page": "Internet and LAN"}, {"chunk_id": "1aecba72", "title": "Windows", "text": "DC++ is one of the most popular DC clients for Windows. After installing the software, set the current proxy to direct connection, set manual configuration to Active mode and upload 100 GB or more data to get access to DC. Connect to the current HUB address. You can also follow the windows quick start guide from here . ApexDC is a good alternative to DC++ that works well.", "page": "Internet and LAN"}, {"chunk_id": "d732a2c4", "title": "Linux", "text": "LinuxDC++ is a Linux port of DC++. Though it is primarily aimed at Linux, it has been shown to work on other Unix-based operating systems as well. Another alternative is Eiskaltdcpp-qt which has a slightly better interface. Download any one of them from Software centre. Configure the client as the same way as windows DC++", "page": "Internet and LAN"}, {"chunk_id": "9863b5ff", "title": "OS X", "text": "To use DC on Mac OS X you can use Shakespeer . Just Download it and after installing it goto preferences and then identity and choose your nick, then in share choose location for download and incomplete folder and add files. Now click connect hub button and enter the hub address.", "page": "Internet and LAN"}, {"chunk_id": "37df4a10", "title": "DNS", "text": "IIT KGP has it's own DNS servers which is used by default. The network does not allow requests to any other DNS servers like Google DNS or Cloudflare DNS . To use these, you need to setup a VPN, the steps for which is given under VPN section of this article.", "page": "Internet and LAN"}, {"chunk_id": "43bd811a", "title": "Software Repository", "text": "The CIC has a vast software repository that provides software like SolidWorks for CAD; IDEs like NetBeans or DevC++; Adobe Creative Suite products like Dreamweaver (Web Designing), Photoshop (Image Manipulation), Illustrator ( Graphic Design) etc ; MATLAB and many more. To access it Go to Run and enter the following address there: http://144.16.192.212\nFor Serial Keys visit the CIC official website. The instructions for certain software have been provided", "page": "Internet and LAN"}, {"chunk_id": "3a2a25fd", "title": "Other Repository", "text": "• IIT Kgp Library Online Public Access Catalogue (OPAC) Search\n• Doctorates' Information System\n• VOD video on demand intranet courses link, within IIT Kharagpur\n• Online access of IIT Kgp institute's Ph.D e-theses & Courses Exam Old Question papers.\n• Previous year Course Q papers (or) search in DC++, local LAN\n• Comprehensive Research Information System (CRIS)\nDisable proxy for all the above instances", "page": "Internet and LAN"}, {"chunk_id": "529d55bb", "title": "See Also", "text": "• Institute proxies\n• HiT Hi FiT Hai\n• DC", "page": "Internet and LAN"}, {"chunk_id": "de267945", "title": "References", "text": "↑ https://github.com/metakgp/iit-kgp-network", "page": "Internet and LAN"}]