[{"chunk_id": "info_d2a446", "title": "IP63101: Constitutional Law Of India - Quick Facts", "text": "IP63101\nCourse name | CONSTITUTIONAL LAW OF INDIA\nOffered by | Rajiv Gandhi School of Intellectual Property Law\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | {{{semester}}}", "page": "IP63101: Constitutional Law Of India"}, {"chunk_id": "18337618", "title": "Syllabus mentioned in ERP", "text": "Constitution- what it means; what is Preamble, Constitutional keys, Fundamental Rights, relation with Directive Principles and Fundamental Duties, Right to equality: privatisation and its impact on affirmative action; Empowerment of women.; Freedom of press and challenges of new scientific development; Emerging regime of new rights and remedies; Right of minorities to establish and administer educational institutions and state; Secularism and religious fanaticism; Separation of powers: stresses and strain; Democratic process; Social and Economic RightsFederalism-Essentials, Creation of new statesAllocation and share of resources - distribution of grants in aid-The interstate disputes on resources; Rehabilitation of internally displaced persons.Centres responsibility and internal disturbance within States.-- Directions of the Centre to the State under Article 356 and 365-Federal Comity : Relationship of trust and faith between Centre and State- relationship in sphere of planning and development; Special status of certain States- Tribal Areas, Scheduled Areas; State : Need for widening the definition in the wake of liberalization; Right to Constitutional remedies, Amendments of the Constitution.Reference:1.Duncan Derret, The State, Religion and Law in India (1999), Oxford University Press.2.H.M. Seervai, Constitutional Law of India (1996), Tripathi.3.D.D. Basu, Shorter Constitution of India (1996), Prentice Hall of India (P) Ltd.4.M.P. Jain, Indian Constitutional Law (1994), Wadhwa.5.K C Wheare, Federal Government, (1963) Oxford University Press.", "page": "IP63101: Constitutional Law Of India"}]