[{"chunk_id": "info_2545dd", "title": "IQPS - Quick Facts", "text": "Intelligent Question Paper Search\nLink | https://qp.metakgp.org\nGithub | https://github.com/metakgp/iqps\nMaintainer(s) | Harsh Khandeparkar, Dipam Sen", "page": "IQPS"}, {"chunk_id": "6b58d796", "title": "IQPS", "text": "See also: Category:Projects\nIQPS (Intelligent Question Paper Search) is a tool for searching and uploading previous year question papers. It was inspired by and is the successor of MFQP .", "page": "IQPS"}, {"chunk_id": "5e649701", "title": "Paper Upload", "text": "Question papers for End Semester Exams, Mid Semester Exams, Class Tests and Supplementary Exams can be uploaded by users to the website. The following steps are to be followed:\n• Go to https://qp.metakgp.org/upload\n• Upload your question paper PDFs (at most 10).\n• For each paper uploaded, IQPS will try to guess the details of the paper (Course Code, Semester, Exam Type, etc.). Click on the Edit (pencil) icon next to each paper, and check all the details, filling any missing data.\n• Once you ensure that all details are correct, click on \"Upload\". This adds the papers to IQPS. Once admins approve your paper, others can find them on IQPS and benefit from them!\nYear Guidelines: The \"Year\" field is to be set to the year in which the exam was held. For example: An autumn semester exam for the session 2024-25 should have the year set to 2024, whereas a spring semester exam for the same session will have year 2025.", "page": "IQPS"}, {"chunk_id": "e115338b", "title": "Admins", "text": "Not to be confused with: Community Admin\nAn IQPS admin is someone who has access to the admin dashboard, which can be used to approve, edit or delete papers. The project maintainer must be an admin.\nFor onboarding new admins:\n• A new admin (who is not a member of the GitHub organisation) can be added by updating the GH_ADMIN_USERNAMES environment variable, which is a comma separated list of usernames of GitHub accounts of the admins.\n• A member of the GitHub organisation can be made an admin by inviting them to the \"IQPS Admins\" team on GitHub.\nA screenshot of the UI for editing and approving papers on the admin dashboard of IQPS.", "page": "IQPS"}, {"chunk_id": "e373e658", "title": "Paper Approval", "text": "Papers uploaded by users move to an review stage, where admins need to approve the paper before it is searchable publicly. To approve papers:\n• Go to the admin dashboard: https://qp.metakgp.org/admin (Only accessible to admins)\n• List of unapproved papers are shown. To approve a paper, click on the Edit (pencil) icon next to the paper. A edit view for the paper opens. On the left, there is a preview of the paper PDF. It can be expanded to take up the full screen by clicking on the Expand icon. In the center, there are options to edit details of the paper, and its approval status (Approved/Unapproved). On the right, there is a listing of \"Similar Papers\". A paper is similar to another paper if they share the same course code, year, semester and exam type. In the listing, similar papers which are approved are highlighted green.\n• Ensure all the details of the paper are correctly filled. Choose \"Approved\" for the approve status, and click on \"Update Details\" to approve the paper.", "page": "IQPS"}, {"chunk_id": "95b855b5", "title": "'Note' field", "text": "In the edit options, a 'note' field exists which can be used to indicate additional information about the paper. Papers for Supplementary exams should have the note field set to \"Supplementary\". Other uses of the field include mentioning tests having conducted in multiple slots, or different papers conducted for different groups (e.g. different papers for first year and second year).", "page": "IQPS"}, {"chunk_id": "e6073518", "title": "Similar Papers", "text": "When approving a newly uploaded paper, the listing of similar papers shows other existing PDFs that are potentially for the same question paper. This is helpful in preventing accidentally having two PDFs for the same question paper. IQPS finds similar papers by looking for papers with the same Course Code, Year, Semester and Exam Type as the paper being edited. Similar papers which are approved will be highlighted in green, while unapproved papers will not be highlighted.\nBefore looking at the similar papers, ensure that the paper being approved has all the correct metadata, otherwise the similar papers listed may be irrelevant.\nNote that the papers shown under the listing aren't guaranteed to be the same paper as the one being edited, due to many reasons. Two papers being similar can mean any of the following: (In what follows, 'original paper' refers to the paper being edited / approved, and 'similar paper' refers to one of the papers listed under the listing)\n• The original paper and similar paper are for the same question paper.\n• The original paper is mislabelled (wrong metadata)\n• The similar paper is mislabelled (wrong metadata)\n• The original paper and the similar paper differ in the \"Note\" field (e.g. the similar paper is for a main exam whereas the original paper is for a supplementary exam, or vice versa). In this case no admin decision is required since everything is correctly labelled and no duplicate paper exists.\nThus, it is recommended to compare the contents of the PDFs of the original and similar paper(s) to identify the reason.", "page": "IQPS"}, {"chunk_id": "9a47cd33", "title": "Managing duplicated papers", "text": "In case the similar paper is for the same question paper (Case 1), the admin has to choose which version to keep. Here are some general guidelines to determine which version to choose in case multiple PDFs exist.\n• All questions and relevant information must be legible. The scan of the PDF must be of good quality.\n• Generally, scanned PDFs from the library question paper archive are of higher quality (and thus preferred) than those uploaded by users, but this is not always the case.\n• A PDF containing both questions and answers/solutions for the paper is preferred over one having only questions (since it is more helpful for the user).\n• An original typeset PDF of the question paper is preferred over a scanned PDF of the paper.\nIn other cases where some paper is mislabelled, the admin must fix the metadata for that paper.", "page": "IQPS"}, {"chunk_id": "7dada53f", "title": "Replacing papers", "text": "Each similar paper listed on the right has a checkbox next to them which can be used to replace papers with the one being approved. While approving a paper, check the boxes for all those papers which needs to be replaced. Then, approve the paper (click on \"Update Details\"). This will approve the paper, and delete the papers which were selected for replacement.", "page": "IQPS"}, {"chunk_id": "7c9c745d", "title": "Architecture", "text": "The main web-app has a Rust backend and a React frontend. It uses a PostgreSQL database as its primary data store. The backend and the database is hosted on the server . The frontend is hosted on Vercel.\nAnother service, called the 'crawler' is a Go script which crawls and downloads papers from the library question papers archive for a given year and semester, and spits out an archive with the PDFs and the metadata. Correspondingly, there is a Rust script 'import-papers', which can import the papers from the archive into the database.", "page": "IQPS"}]