[{"chunk_id": "info_11d407", "title": "IT30037: Introduction To Internet - Quick Facts", "text": "IT30037\nCourse name | Introduction To Internet\nOffered by | Computer Science and Engineering\nCredits | 3\nProfessor(s) | K.S. Rao\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | {{{semester}}}", "page": "IT30037: Introduction To Internet"}, {"chunk_id": "33516c46", "title": "Syllabus", "text": "• Introduction: Complexity of Data communication networks, Need for layered/modular architecture, Circuit/Packet/Message switching, Layering concept, OSI reference model, TCP/IP model.\n• Physical layer: Fundamentals of signals, Concepts of analog and digital signals, Bandwidth, Data rate Vs Bandwidth, Transmission losses, Channel capacity, Digital transmission (Encoding techniques), Analog transmission (brief about ASK/FSK/PSK/QAM), A/D conversion, Transmission media (brief), Multiplexing (TDM/FDM).\n• Data link layer: Framing (flag-based), Parity check codes, ARQs (stop-and-wait, go-back-n and selective-repeat).\n• Medium access control layer: ALOHA, CSMA, Collision free, limited contension, CSMA/CA and Ethernet.\n• Network layer: Connection less Vs connection oriented services, Routing protocols: shortest path, flooding, distance vector and link state routing. IPv4 header, Fragmentation and IP addressing.\n• Transport layer: Transport service premitives, Elements of transport protocols (addressing, connection establishment, connection release, flow control and buffering, multiplexing and crash recovery), UDP, TCP (intorduction to TCP, TCP service model, TCP protocol, TCP segment header, TCP connection establishment, release and management, TCP transmission policy, TCP congestion control and TCP timer management.\n• Application layer: Client-server model, concurrent and iterative servers,(Fourouzan 3ed)DNS, TELNET, FTP E-mail and WWW.\n• Network security: Basic network attacks, Basics of cryptography: principles of symmetric (private) key and asymmetric (public) key cryptography, substitution and transposition ciphers, Symmetric key cryptosystems: DES and AES, Public key cryptosystems: RSA, Diffie-Hellman cryptosystem, Man-in-middle attack. Security services: Message confidentiality, Message integrity, Message authentication, Digital signature, Entity authentication and Key management symmetirc key and public key distribution), Security in the Internet: IPSec, SSL/TLS, PGP, VPN and Firewalls.\nText Books:\n• Data Communications and Networking, 4ed, by Behrouz A. Forouzan\n• Data and Computer Communications, 8ed, by William Stallings\n• Computer Networks, 4ed, by Andrew S. Tanenbaum\n• Data Networks, 2ed, Dimitri P. Bertsekas and Robert G. Gallage", "page": "IT30037: Introduction To Internet"}, {"chunk_id": "22320b1a", "title": "Student Opinion", "text": "This course will be particularly useful if you want to go into the field of computer networks. For EECE students, this course will provide a glimpse of Analog and Digital Communication basics.\nIt may take time to understand the concepts.\nSyllabus is quite big and learning is time taking.\nMarking and Grading is very lenient.", "page": "IT30037: Introduction To Internet"}, {"chunk_id": "a7dfcebc", "title": "How to Crack the Paper", "text": "Thoroughly go through the main text book- Behrouz Forouzan.\nDont leave any part untouched.\nSolve the back problems and tutorials. Course instructor doesn't solve tutorials, so it is your responsibility to get your doubts cleared by him.\nDo keep in hand the solution manual of the textbook, easily available on the internet.\nFor problem solving or understanding, you may watch Youtube videos on GATE-CS (Computer Networking).", "page": "IT30037: Introduction To Internet"}, {"chunk_id": "23ced373", "title": "Classroom resources", "text": "Official Website: http://cse.iitkgp.ac.in/~ksrao/cou-iti-1.html", "page": "IT30037: Introduction To Internet"}, {"chunk_id": "791e069d", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | NC243\nThursday | NC243\nFriday | NC243", "page": "IT30037: Introduction To Internet"}]