[{"chunk_id": "88f6fa1f", "title": "KGP Lingo", "text": "This page lists slang words and phrases used at IIT Kharagpur.", "page": "KGP Lingo"}, {"chunk_id": "c93359cf", "title": "Common Words", "text": "These are some of the common words (not in alphabetic order)\n• Load - n. Tension; v.i. To Have Tension.\n• Peace - excl., n., v.i., To be tension-free. A tension-free state.\n• 2.2 - n. A 2.2 km circular track at the centre of the campus, or a run of it.\n• C.G. - abbr. Short-form of C.G.P.A. abbr. Short for Center of Gravity. A punishment/prank where your room's contents are moved around to cause grief to you on your return.\n• Tech-M - n. Technology Market , a market inside the campus.\n• DepC - v.t., v.i. Department change\n• DC++ - n. The Direct Connect network used for file-sharing through LAN. See DC .\n• Maggu - n. Student who mugs.\n• Makhana - v.t. To spoil a job. To do something insincerely. To play spoil-sport.\n• Machana - v.t. To do an excellent job in something.\n• Stud - n. Any student who is good in academics as well as other fields like sports, etc.\n• Tempo - n. Enthusiasm and vigour.\n• Tempo shout - v.i. To shout in a singing manner \"KGP Ka Tempo High Hai\". Of KGP or of some similar affiliations like Hall such as \" X ka tempo high hai\" for X Hall of Residence; n. The shout \"KGP Ka Tempo High Hai\".\n• Junta - n. The human population. Of IIT-KGP or elsewhere.\n• Dep - n. Department\n• Prof - n. Professor.\n• V.P. - abbr., n. Vice President of Gymkhana.\n• P.S.I. - abbr., n. Pehchanane Se Inkaar (Refusing recognition). To ignore someone or to forget deliberately.\n• Fakka - n. An F-grade in any subject, meaning fail.\n• Faccha - n. A first year male student. Usu. a B. Tech. Student.\n• Facchi - n. A first year female student. Usu. a B. Tech. Student.\n• G.P.L. - adv. Rejection. v.i., n. The act of kicking someone's behind.\n• Funda - n. The basic knowledge of anything.\n• Happa - n. Hall President.\n• FacAd - n. Faculty Advisor.\n• H.O.D. - abbr., n. Head of Department.\n• Lodu - n. A person who takes lot of load. See Load.\n• Pakau - v.t. Boring.\n• Illu - n. Illumination(on Dipawali). A competition involving all Halls for best illumination and rangoli on Dipawali.\n• O.P. - abbr., n. Orientation Period. More commonly used word for ragging in IIT-KGP. It includes bonding with junior students and testing their Hall-funda. A commonly used synonym is I.P. (Interaction Period).\n• Intro - n. Introduction. Generally a brief speech involving one's name, department, city, hobbies, etc.\n• P.P.O. - abbr., n. Pre-Placement Offer. Job offers given by companies before the placement officially begins.\n• P.P.T. - abbr., n. Pre-Placement Talks. Talks held by companies when they come for selecting students via the placement process.\n• T.O.A.T. - abbr., n. Tagore Open Air Theatre .\n• T.L.S.H.Y. - abbr. n. Teri Life Sahi Hai Yaar (your life is awesome)\n• Panji - n. A C.G.P.A. in between 5 and 6.\n• Chhagi - n. A C.G.P.A. in between 6 and 7.\n• Satti - n. A C.G.P.A. in between 7 and 8.\n• Atthi - n. A C.G.P.A. in between 8 and 9.\n• Nehli - n. A C.G.P.A. greater than 9.\n• Dehli / Dassi - n. A C.G.P.A. of 10.\n• D.P. - abbr., n. Durga Puja. The vacation in its duration.\n• Banda - n. Any boy.\n• Bandi - n. Any girl.\n• Bhajan - n. A euphemism for sexually explicit media files.\n• Bhaat - n. Bekar Chat. A useless talk in a group whose sole purpose is to pass time. Also a regular magazine drafted by first year students trying to copy Junk.\n• Batti - n. The Electrical Engineering Department. Also, the students of it.\n• Ghaasi - n. A student of Agriculture Engineering Department.\n• Hathora / Mechenchi - n. The Mechanical Engineering Department. Also, the students of it.\n• Indu - n. The Industrial Engineering & Management Department. Also, the students of it.\n• Machuara - n. The Ocean Engineering and Naval Architecture Department. Also, the students of it.\n• Meta - n. The Metallurgy and Materials Science Department. Also, the students of it.\n• Lohar - n. A student of Metallurgy and Materials Science Department.\n• G.C. - abbr., n. General Championship. Either of the Soc-n-cult, Sports, Technology or Hall Affairs.\n• Fight - n., v.t., v.i. Difficulty in achieving something.\n• Chhedis / 6dis - n. A dhaba just outside campus.\n• D.O.S.A. - abbr., n. Dean Of Student Affairs .\n• Acads - n. Academics.\n• Archi - n. The Architecture Department. Also, the students of it.\n• Taapna - v.t., v.i. Copying assignments or examination answer-scripts from any person.\n• Soc-cult - n. Social and Cultural Activities.\n• Secy - n. Secretary. A typical student post at the Gymkhana or hall council.\n• Room-baap - n. The student(male) who occupied someone's room in the previous year.\n• Room-maa - n. The student(female) who occupied someone's room in the previous year.\n• R.D.C. - abbr., n. Rural Development Centre. The central office of N.S.S.\n• B.C. Roy - n. Bidhan Chandra Roy, former Chief Minister of West Bengal. Many establishments in including a hospital , a hall , and the central square are named after him.\n• Adhyan -n. Any male student who posts too much on social media platforms\n• Matka - n. Any M. Tech. male student.\n• Matki - n. Any M. Tech. female student.\n• S.F. - abbr., n. Spring Fest , the annual cultural festival of IIT-KGP.\n• Hapa - n. See Happa.", "page": "KGP Lingo"}, {"chunk_id": "c78503de", "title": "Other Words", "text": "These are other Lingo words in Alphabetic order:\n• 11 - n. Ha-Ha (a laugh). Adopted from its shortcut in Age of Empires.\n• A.I.R. - abbr., n. All India Rank. See Hawa.\n• A.O.E . - n. The Age of Empire game.\n• App - v.i. To apply to universities (usually abroad).\n• Apping - v.i. See App.\n• Arbit - adj. Arbitrary.\n• A. Team - n. The Action team formed during SF.\n• Aunties - n. A grocery store located just outside IIT campus. Named after the lady running the store.\n• Baapi - n. An intellectual belonging to the BTDS.\n• Baddy - n. The sport of Badminton; adj. Related to the sport.\n• Basic - n. An usual activity or characteristics of an individual, place, or any other entity.\n• Bangy - n. Bangalore.\n• Baski - n. The sport of Basketball; adj. Related to the sport.\n• Bhaatu - n. A person who is very talkative. See Bhaat.\n• Bhatnagar - n. The Bhatnagar Auditorium.\n• B.T.D.S. - abbr., n. Bengali Technology Dramatics Society .\n• Cali - n. Calibre.\n• Cancer Puff - n. The last few millimetres of Sutta .\n• Candi - n. Candidate (For elections).\n• C.D. - n. Short-form of Cold Drink. Used for any cold beverage.\n• C.G.P.A. - abbr., n. Cumulative Grade Point Average. An index of a students performance in academics which reflects performance throughout the studies in IIT-KGP.\n• C.I.C. - abbr., n. The Computers and Informatics Centre . It is situated in Takshashila .\n• C.L. - abbr., n. Central Library.\n• C.S. - abbr., n. The Computer Science Department. abbr., n. Counter Strike (First-person shooter game).\n• Convo - n. Convocation.\n• D.A.S.A - abbr., n. Direct Admission of Students Abroad. A special route for N.R.I. sponsored candidates to enter the IITs. Involves less competition than J.E.E. Such students in IITs called DASAites. Use deprecated after the program was scrapped.\n• D.C. - abbr., n. Disciplinary Charge. Due to inappropriate conduct of student. The Committee hence formed (Disciplinary Committee). n. The file sharing software \"DC++\".\n• Despo - n. Desperate.\n• Dhantin - n. Post party lit scenes.\n• Diro - n. Director of IIT-KGP.\n• Disco - n. Short for Disciplinary Committee.\n• D.L. - abbr., n. Dreamland Restaurant.\n• D.O.A.A. - abbr., n. Dean Of Academic Affairs . Responsible for academics of students. He is the main responsible person in any Research and Development work taken up by the institute.\n• Dude - n. Dual Degree Students.\n• E.T.D.S. - abbr., n. English Technology Dramatics Society.\n• E.T.M.S. - abbr., n. Eastern Technology Music Society.\n• Fatka - n. Loss.\n• Fattu - n. Meek. Coward.\n• Footer - n. A match of Football or (rarely) the sport itself.\n• Frust - v.t. Frustrated. Generally due to academics and lack of female population. Also Frustoo.\n• Frustoo - v.t. See Frust.\n• Fundoo - adv. Something having very strong conceptual background; excl. Something great.\n• Gawd - n. An achiever in any field, academics or otherwise. See also: Stud.\n• G.I. - abbr., n. Short for Garden Inn.\n• G.I.H. - abbr., n. The Great India Hotel. Located approximately 15 kilometres away, along the IIT Bypass Road.\n• G.M.A.T. - Short-form of \"G Mein Apar Tension\". A person who takes lot of load (synonym of Lodu).\n• G.Sec. - abbr., n. General Secretary. Of Halls or Gymkhana. In Gymkhana, always a third year student.\n• GolB - n. The Gol Bazaar Market.\n• GolC - n. The circle (Gol Chakkar) just outside the Main Building of the Institute. Also known as Bidhan Chowk.\n• Gult - n. Telugu. A Telugu-speaking person. Originated by reading the word 'Telugu' backwards when written in Telugu.\n• Hall - n. (Halls Of Residence). Word used for hostel in IIT-KGP. The latter is rarely used. The Halls accommodate students who study in IIT-KGP. All Halls have their separate Mess, Canteens, Grocery & Stationery Shops, etc. There are separate halls for B.Tech students, M.Tech students, Business Management students and Research Scholars.\n• Halu - adv. Hallucinated.\n• Harry's - n. A dhaba/restaurant on the IIT Main Road.\n• Hawa - n. AIR. J.E.E. All India Rank.\n• H.J.B. - abbr., n. See J.C.B.\n• H.L. - abbr., n. Hall Library\n• H.P. - abbr., n. Hall President\n• H.T.D.S. - abbr., n. Hindi Technology Dramatics Society.\n• Huhaa - v.t. Something extremely great in magnitude. Ex: Huhaa tempo\n• I.G. - abbr., n. Indira Gandhi Hall Of Residence. A senior female students B. Tech. Hall.\n• Insti - n. Institute. Used to refer the main building of IIT-KGP.\n• I.P. - abbr., n. Interaction Period. See O.P.\n• J.A.M. - abbr., n. The event of Just a Minute, in which you are required to speak for a minute. n. Jamshedpur.\n• J.C.B. - abbr., n. Acharya Jagadish Chandra Bose Hall Of Residence. B. Tech and Research Scholar male students Hall. Shares the same premises with Homi Jehangir Bhabha (H.J.B.) Hall Of Residence\n• Kam-akal - n. A student of Chemical Engineering Department.\n• Kela - adv. Failure.\n• Kholu - n. The top ranked general category student admitted through JEE in any department/specialization.\n• K.L.P.D. - abbr., adv. Rejection. Especially for the case when success was imminent.\n• Kol - n. Kolkata.\n• Lallu - n. See L.L.R.\n• L.B.S - abbr., n. Lal Bahadur Shastri Hall of Residence\n• L.G.B. - abbr., n. Little Green Bastards. A small insect that is attracted towards light. Often found in groups of over hundred, causing extreme irritation to students.\n• L.L.R. - abbr., n. Lala Lajpat Rai Hall Of Residence. A senior male students B. Tech. Hall. Commonly used word for it and its residents is lallu.\n• L.S. - abbr., n. The Little Sisters Restaurant.\n• Maraoed - v.t. The act of doing something. viz. we maroed bhaat, maraod mugga, maroed bunk, maroed funda.\n• Maska - n. The 2 year M.Sc. students. n. The Maths & Computing Stream. Also, the students of it.\n• M.B.M. - abbr., n. Masters Of Business Management. A Hall of Business management students. Associated with V.G.S.O.M.\n• Menty - n. The Maintenance Secretary of any Hall.\n• M.M.M. - abbr., n. Madan Mohan Malviya Hall Of Residence.\n• M.S. - abbr., n. Meghnad Saha Hall Of Residence. A senior male students B. Tech. Hall\n• M.T. - abbr., n. Mother Teresa Hall Of Residence. A female students M. Tech. Hall.\n• M.T.R. - n. See Midtown Restaurant.\n• N.M.S.T. - abbr., n. Nehru Museum of Science and Technology. Located in Old Building\n• N.S.O. - abbr., n. National Sports Organization.\n• N.S.S. - abbr., n. National Service Scheme.\n• Old Campus - n. See PAN Loop.\n• On/Off - n. In/Out of the involvement.\n• Orientation - n. See O.P.\n• Pact - n. The agreement between Halls to support candidates from other's Hall for a similar support in return.\n• PAN Loop - n. The set of Halls: Patel , Azad and Nehru and area bounded by them. These were the first to be constructed hence known as Old Campus.\n• P.D. - abbr., n. The Punjabi Dhaba. Located in Gol Bazaar.\n• PremB - n. Prem Bazaar.\n• Prem Gali - n. The road joining Chemical Engineering and Ocean Engineering & Naval Architecture Department.\n• Presi - n. President of the Gymkhana.\n• P. Team - n. The publicity team formed during Spring Fest.\n• Rassa - n. A male research scholar.\n• Rassi - n. A female research scholar\n• Rep - suf., n. Representative.\n• Reskee - n. Research Scholars.\n• RGSOIPL - abbr., n. Rajiv Gandhi School of Intellectual Property Law. A Law School in IIT Kharagpur.\n• R.K. - abbr., n. Radhakrishnan Hall Of Residence. A senior male students B. Tech. Hall.\n• R.P. - abbr., n. Rajendra Prasad Hall Of Residence. A senior male students B. Tech. Hall.\n• S.A.M. - abbr., n. Sir Ashutosh Mukerjee Hall Of Residence. A hall for management students studying in V.G.S.O.M. Shares same premises with Gokhale Hall.\n• Schol - n. Scholarship, usually during Apping.\n• Scholar's Avenue - n. The road leading from the IIT Main Gate about which most of the Halls are situated. n. The Official Students' Newspaper.\n• S-Com - n. The Steering Committee of Spring Fest.\n• Sem - n. Semester.\n• Senti - n., v.i. Sentiments. Sentimental.\n• S.G.P.A. - abbr., n. Semester Grade Point Average. An index of a students performance in academics which reflects his performance in a particular semester.\n• S.M.S.T. - abbr., n. School of Medical Sciences and Technology.\n• S.N. - abbr., n. Sarojini Naidu Hall Of Residence. A female students B. Tech. Hall. Residents are called SNites.\n• S.Q. - abbr., n. Summer Quater. A special course organized by IIT-KGP for students who fail to clear subjects in previous semesters, so that they need not repeat next year.\n• S.R.I.C. - abbr., n. Sponsored Research and Industrial Consultancy\n• S.T.E.P. - abbr., n. Science and Technology Entrepreneur's Park.\n• Tam - n. Tamil. A Tamil-speaking person.\n• T.D.S. - abbr., n. Technology Dance Society.\n• Tech - pre., adj. Technology. An adjective used frequently with anything associated with IIT-KGP.\n• T.F.P.S. - abbr., n. Technology Filmmaking & Photography Society.\n• T.H.O.K. - abbr., n. Thick Heads Of KGP. A student of Electronics and Electrical Communications Engineering Department.\n• Tinku - n. An Egg-Poach-Burger. A specialty of Chhedis.\n• TLE - adv. Individual's capacity is exceeded.\n• T.L.S.H.Y. - abbr. n. Teri Life Sahi Hai Yaar (your life is awesome)\n• Tumpa - abbr., n. Typically Uncivilized Midnaporean People's Association, or Tribal Uncivilized Midnaporean People's Association. People who belong to Midnapur district.\n• T.S.G. - abbr., n. See Gymkhana.\n• Tut. - n. Tutorials.\n• T&P - abbr., n. The Training and Placement section. Now known as CDC .\n• Uddu - n. An Oriya-speaking person.\n• V.G.S. - abbr., n. Vishveshwaraiyya Guest House.\n• V.G.S.O.M. - abbr., n. Vinod Gupta School Of Management.\n• Vikramshila - n. One of the recently built academic complex to take over/compliment the role of Main Building.\n• Volu - n. Volunteer.\n• Vortex - n. A dance competition between different Halls organized by L.L.R. Hall.\n• V.S. - abbr., n. Vidyasagar Hall Of Residence. An M. Tech. Hall.\n• V.S.R.C. - abbr., n. Vikram Sarabhai Residential Complex. A residential complex for regular M.S. and Ph.D student as well as Assigned Project Scientists. Under S.R.I.C.\n• W.T.M.S. - abbr., n. Western Technology Music Society.\n• Z.H. - abbr., n, Zakir Hussain Hall Of Residence. A research scholar Hall.", "page": "KGP Lingo"}, {"chunk_id": "b5d30e4f", "title": "Key", "text": "• abbr. - Abbreviation\n• adj. - Adjective\n• adv. - Adverb\n• excl. - Exclamation\n• n. - Noun\n• pre. - Prefix\n• suf. - Suffix\n• usu. - Usually\n• v.i. - Verb(intransitive)\n• v.t. - Verb(transitive)", "page": "KGP Lingo"}, {"chunk_id": "d061ef0c", "title": "Reference", "text": "↑ \"IIT Kgp dictionary\" .", "page": "KGP Lingo"}]