[{"chunk_id": "info_8a0cb8", "title": "KGPellence - Quick Facts", "text": "Founded | Jun 2023 ( 2013 )\nFounders | Devesh , Hariom\nApp Link | Click here\nContribute Resource | [email protected]\nSlogan | 𝗔𝗰𝗮𝗱𝗲𝗺𝗶𝗰 𝗘𝘅𝗰𝗲𝗹𝗹𝗲𝗻𝗰𝗲 𝗦𝗶𝗺𝗽𝗹𝗶𝗳𝗶𝗲𝗱", "page": "KGPellence"}, {"chunk_id": "98865f22", "title": "KGPellence", "text": "KGPellence is a comprehensive platform designed to provide IIT KGP students with all the resources and guidance they need to succeed and excel in academic and campus life. It aims to enhance student welfare and support students across all years and departments in every possible way.\nFrom Metakgp Wiki\nFeatures ➤ Resource Access: KGPellence provides access to over 600 organized courses , including slides, notes, previous year questions (PYQs) and their solutions, topper tips, and recommended books, covering all departments and every academic year, including minor, elective, and breadth courses. ➤ Lost & Found Updates: Post your lost belongings on our platform for a better chance of finding them. This feature helps you recover misplaced items by connecting you with others who might have found them, ensuring you don't lose valuable possessions. Tip: Share on whatsapp Community too. ➤ Everything about Placements and Internships through CDC Guidance Tab: CDC Senior Resources: Access a comprehensive collection of placement questions of various companies from Inter IIT Placements (2015 - 2022). Profiles Guidance & Resources : Find resources and guidance for various career profiles including Consulting, Data, Finance, SDE & Product. About CV & CDC: Get a detailed CV-making guide, 100+ Seniors Resume, information about different companies, CDC rules and guidelines. ➤ Campus Convenience : KGP Bus Services : Find schedules and routes for campus bus services to make commuting easier. Toto Contacts : Access contact information for Toto services for convenient on-campus transportation. Institute Amenities and Places : Discover various amenities and key places around the campus, including dining options, study areas, and recreational facilities. Health Guidance : Receive information and tips on maintaining your health and well-being while at college. ➤ Wealth of Academic and Non-Academic Guidance : Fresher and Kgpian Guidance : Resources specifically designed to help new students and current students navigate their academic journey and campus life. Placement Blogs : Insights and tips on preparing for placements and securing job opportunities. Society, Scholarship, and Department Insights : Information about various student societies, available scholarships, and departmental details to help you make informed decisions and maximize your college experience. ➤ Marketplace : Utilize our marketplace to buy, sell, and trade items with fellow students. Whether you need textbooks, daily essentials, cycles, electronics, or other items, the marketplace provides a convenient platform within the campus community. ➤ Peer Connection : Engage with fellow students through our chat features, allowing you to clear doubts, seek guidance, and share knowledge. This fosters a collaborative learning environment and helps students benefit from each other's experiences and expertise. ➤ Noticeboard Updates : Stay updated with the latest Campus notifications, event updates, and other essential information. KGPellence keeps you informed about important campus events and announcements, ensuring you never miss out on crucial updates. Other Welfare Initiatives ➤ Community Building: Fundae & Discussion : Academic Welfare Coordinators will solve your general queries and share useful tips and insights, also engage in general discussions. CHEM Sem : Students can post their chemistry-related queries and discuss them with batchmates. Phy Sem : Students can share their physics queries and engage in discussions with peers. Coding Group : Collaborate and discuss on coding related queries and share programming knowledge. Lost & Found : Post and find lost items within the community. Welfare Coordinators (2nd Year) Founders: Devesh , Hariom Year 2022-23 2023-24 2024-25 2025-26 Name Hariom Ritil Ranjan Vedant Sharma Abhinav Tiwari Important Links If you have other important resources, whether departmental courses or CDC-related, please contribute here. It'll be helpful for fellow Kgpians. Contribute here: [email protected] Contact us: [email protected] Linkedin: https://in.linkedin.com/company/kgpellence", "page": "KGPellence"}]