[{"chunk_id": "eecfb00a", "title": "Events", "text": "The events in Kshitij 2016 are certified by renowned organizations such as IEEE, ASME, ASCE, Code-chef, Sayen/CEE\nSome of the flagship events in Kshitij include:\nLaws of Motion: An aircraft designing event certified by Institution of Mechanical Engineers (IMechE).\nB-Plan: Business Plan competition in Kshitij is aimed at encouraging the budding entrepreneurs all around the world to unleash their inventive potential, and flesh out ideas spanning multiple dimensions.\nASME SDE: Student Design Exposition is an open hardware modelling competition certified by the American Society of Mechanical Engineers.\nEureka: An IEEE certified Paper presentation event.\nCode-O-Shuffle: Kshitij in association with Code-chef, embraces the real scrutiny of the programming prowess of the participants.\nEmbetronix: It is an embedded electronics circuit design competition.\nRobowars: Kshitij in association with Combat Robotics India, invites all the tech enthusiasts to participate in the the war of Robosapiens.", "page": "Kshitij 2016"}, {"chunk_id": "b45e8e95", "title": "Guest Lectures", "text": "Shoojit Sircar: An Indian film director and producer. He directed Yahaan (2005), Vicky Donor (2012) and Madras Cafe (2013) and produced Aparajita Tumi (2012). He won the National Film Award for Vicky Donor.\nDilip Chhabria: He is a critically acclaimed automobile engineer and designer. The founder of DC Design, he is also credited with designing the car which featured in movie Taarzan: The Wonder Car.\nCarlo Cottarelli: A well-known economist of all times, Mr.Carlo Cottarelli, an Italian economist, currently serving as an Executive Director of the International Monetary Fund.\nV.S.Sampath: Former Chief Election Commissioner of Election Commission of India.\nAbhas Mitra: An Indian astrophysicist best known for his distinct views on several front-line astrophysics concepts, particularly black holes and Big Bang Cosmology.\nHatim Zaghloul: Co-founder of Wi-LAN Inc. Best known for the inventions of WOFDM and MCDSSS.\nSanjeev Sanyal: An Indian economist, bestselling writer, environmentalist, and urban theorist. Deutsche Bank's Ex-Global Strategist, he is widely regarded as one of Asia's leading economists.", "page": "Kshitij 2016"}, {"chunk_id": "3b9bf7e3", "title": "Exhibitions", "text": "To introduce the youth to the latest advances in technology and to give them a glimpse of the changing times, several intriguing exhibitions are showcased during the fest.\nWall-E Bot: Developed by Prof. Khalilur Rhaman and his research students of BRAC University Bangladesh , this project presents in detail an electrically operated mechanical robotic system based on an animated character of Pixar’s WALL-E.\nThought Controlled Prosthesis: It is a technique from Sweden for implanting thought-controlled robotic arms and their electrodes directly to the bones and nerves of amputees and simultaneously control several joints and motions, as well as to receive direct neural feedback on their actions.\nManav: Manav and Manav MINI are India 's first 3D printed humanoid robot which were developed in the laboratory of A-SET Training and Research Institutes by Mr. Diwakar Vaish.\nJinnbot and Kitty : Jinn from Switzerland , is taller, stronger, complex than other humanoids. Delivered with additional hardware and software, jinn can interact in reality.\nXombie: Xombie NX (NXT Version) from Malaysia , operates itself through the evergreen technology used by bats that is ultrasonic sound. It helps Xombie to detect the obstacles.", "page": "Kshitij 2016"}, {"chunk_id": "b098ed09", "title": "Mega Shows", "text": "The East India Comedy: A group of Indian stand-up comedians that performs comedy shows, organizes comedy workshops, corporate events and scripts movie and television shows.\nThe Magic Show by David and Leeman: David Blatter and Leeman Parker, the duo magicians are AWARD WINNING comedy magicians from Los Angeles.\nFreelusion: It is a spectacular mixture of contemporary dance trends and 3D projection mapping.", "page": "Kshitij 2016"}]