[{"chunk_id": "info_8ba31a", "title": "Ktj - Quick Facts", "text": "File:Kshitij Logo.png\nType | Student run Non-Profit Organization\nFounded | 2004 ( 2004 )\nPlace | Kharagpur, India\nMajor events | ROBOWARS\nPrize money | ₹ 65 Lakhs\nSlogan | Think. Create. Enjoy\nWebsite | ktj .in", "page": "Ktj"}, {"chunk_id": "a1ddefa5", "title": "Ktj", "text": "Kshitij is the annual techno-management fest of IIT Kharagpur , one of India’s premier technical institutions. [ 1 ] [ 2 ] Started in the year 2004, the idea of Kshitij was conceived with the aim to provide the technically inclined youth a national-level platform, where their talent and expertise would be recognized and duly rewarded. [ 3 ] Having grown exponentially since its nascent years, Kshitij receives overwhelming participation from the student community all over the world. [ 4 ] [ 5 ] The official website of Kshitij, ktj .in , is in fact the largest student run website, receiving 8 million clicks in its 2012 edition. [ 6 ] [ 7 ]\nKshitij organizes a wide range of events encompassing every genre of technology and management with the aim to infuse a scientific and rational temperament in the young minds. [ 8 ] World-renowned organizations like ACM , IEEE , ASME , ASHRAE and IMechE certify numerous events of the fest. To address the issues plaguing our present society, Kshitij also undertakes social initiatives in association with the foremost NGOs of the country. [ 9 ] Workshops are conducted at several locations all over the country, to help the participants gain hand-on experience and enhance their technical skills. Culminating in a four day extravaganza, Kshitij also organizes many inspiring guest lectures , exhibitions and megashows. [ 10 ] [ 11 ]\nKshitij 2015 was held from 30th January to 2nd February 2015,that saw a total participation of over 65,000 and an amount of Rs 65 lac was offered as prize money. [ 12 ] Kshitij 2016 will be held from 21st January to 24th January 2016. [ 13 ]", "page": "Ktj"}, {"chunk_id": "58256299", "title": "History and Growth", "text": "Initially named Ideon, Kshitij started in its present form in 2004. 260 participants from outside the campus took part in the first edition of the fest. In 2005, this figure increased to 1400, including participants from abroad as well. Since then, Kshitij has grown to become Asia’s largest techno-management fest. Kshitij 2012 witnessed a participation of 50,000 students from all over the world and the prize money amounted to 60 lacs. This year Kshitij will celebrate 13 years of its making. [ 14 ]", "page": "Ktj"}, {"chunk_id": "4af80389", "title": "Certifications", "text": "Many of the events in Kshitij 2016 have certifications from various organisations and institutions. These are:\n• Association for Computing Machinery (ACM): ACM, the world’s largest and oldest scientific and educational computing society, which develops resources that advance computing as a science and profession, certifies Overnite ACM ICPC Multi Provincial Programming Contest. The society serves as a membership of computing professionals and students in many countries in all areas of industry, academia, and government thus uniting the world's computer educators, researchers and professionals to inspire dialogue and address the field's challenges.\n• Institute of Electrical and Electronics Engineers (IEEE) : The Institute of Electrical and Electronics Engineers (IEEE) is the world’s largest professional association dedicated to advancing technological innovation and excellence for the benefit of humanity. IEEE and its members inspire a global community through IEEE’s highly cited publications, conferences, technology standards, and professional and educational activities. IEEE certifies the event Eureka in Kshitij.\n• American Society of Heating, Refrigerating and Air-Conditioning Engineers (ASHRAE): ASHRAE certifies Kryotech, an event to design the complete HVAC (heating, ventilation and air conditioning) system for the industry.\n• American Society of Mechanical Engineers (ASME): ASME, a professional body known for setting codes and standards for mechanical devices, certifies the Kshitij event ASME Student Design Competition. Through this event, ASME provides a platform for budding technocrats to touch the horizons in the field of robotic design and intelligent automation.\n• Institution of Mechanical Engineers (IMechE) : The Institution of Mechanical Engineers (IMechE) certifies the events Laws of Motion and Nightshift. The association of IMechE with these events aims at improving the world through engineering and nurturing new talents, helping them build their careers and take on the challenges that, when solved, will make a difference to all.\n• American Institute of Chemical Engineers (AIChE) : The American Institute of Chemical Engineers (AIChE) is a professional organization for chemical engineers. AIChE was established in 1908 with the purpose of establishing chemical engineers as a profession independent from chemists and mechanical engineers.", "page": "Ktj"}, {"chunk_id": "64142e89", "title": "Flagship Events", "text": "Laws of Motion : This aircraft design event certified by the Institution of Mechanical Engineers IMechE is one of the most famous events of Kshitij, which receives participation from students all over the country.\nEureka : An IEEE certified technical paper presentation event.\nOvernite : The ACM ICPC Multi-provincial programming contest is certified by ACM , world’s largest and most prestigious scientific and educational computing society.\nASME SDE : Student Design Exposition is an open hardware modelling competition certified by the American Society of Mechanical Engineers.\nB-Plan : This event gives aspiring entrepreneurs a wonderful opportunity to present an executive summary of their business idea before angel investors and venture capitalists. Offering impressive incubation prize money, B-Plan has helped many students to kick-start their dream business.\nEmbetronix : It is an embedded electronics circuit design competition spread over two rounds.\nNightshift : An adaptation of the popular Discovery Channel show, Junkyard Wars, this event is also certified by IMechE .\nIDP : It is Kshitij’s very own Industrial Design Problem competition. Conducted in association with reputed industrial organizations, it gives participants a chance to give solutions to real time problems faced by industries, though in their scaled down version.\nThe Verdict : The national-level Moot Court competition of Kshitij, it is conducted in association with the Indian Bar Association.", "page": "Ktj"}, {"chunk_id": "3bb1974a", "title": "Robotix Events", "text": "Main article: Robotix (competition)\nThere is a complete genre called Robotix , [ 15 ] which has many events based on amateur robotics.The events for Kshitij 2015 are:\nCascade : Build a manually controlled robot capable of traversing vertical rods while shooting terrorists\nSkyfall : Build a robot that is capable of picking up packages on a pier and depositing it on the given ship by traversing the arena either aquatically or by zipline.\nMinefield : Build a semi-autonomous robot capable of detecting hidden metal mines and rescuing stranded victims using gesture recognition in a minefield.\nStep Up : Build an autonomous robot that is capable of traversing a grid and arranging the blocks placed on nodes in the increasing order of height.\nAug-Hit : Build an Image Processing robot that can play the Break Bricks game.\nSudocode : Write a code to optimize your strategy to find and destroy enemy bunkers in a jungle. Write a code to find and attack enemy troops in the jungle.", "page": "Ktj"}, {"chunk_id": "0b0d7593", "title": "Guest lectures", "text": "Each year, Kshitij invites illustrious dignitaries from all over the world to share their valuable insights. The guests for Kshitij in its previous editions include :\nAlan Emtage : Father of the Internet Search Engine\nDov Frohman : Former VP- Intel, Inventor of EPROM\nD. Richard Hipp : Architect of SQLite and Fossil SCM\nBedabrata Pain : Director, Inventor of CMOS Image Sensor\nSir Robin Knox-Johnston : First to perform a solo non-stop circumnavigation of the globe\nDr. Subir Gokarn : Former Deputy Governor, Reserve Bank of India\nDr. Jacob Cohen : Chief Scientist,NASA\nClaude Vallee : Chairman SPSC, CERN\nNawazuddin Siddiqui: Critically Acclaimed Actor\nKrishnaswamy Kasturirangan: Former Director - ISRO\nSatyajit Bhatkal: Creator - Satyameva Jayate, Assistant Director - Lagaan", "page": "Ktj"}, {"chunk_id": "be2d7cc9", "title": "Workshops", "text": "In keeping with its vision of fostering the spirit of science and technology among the students, Kshitij organises elucidatory workshops both during the festival and in the days prior to the festival. These workshops help the participants in keeping up with the recent developments in the technical and corporate world, from the very experts in the field. Being highly informative and interesting the workshops are known to attract enthusiastic participation from students. The workshops are organised in association with reputed organisations and are conducted free of cost.\nDuring the fest, interactive workshops are conducted in Kharagpur on a wide variety of topics. These workshops are presented by the experts in the respective fields, giving the participants a unique opportunity to develop an insight and gain hands-on experience.\nThe Kshitij Team organises a series of external workshops in various cities prior to the festival. These workshops aimed at reaching out to the student fraternity all over the country, provide a platform for the participants to identify, exchange, plan and elaborate emerging ideas and high-quality research.", "page": "Ktj"}, {"chunk_id": "0a9f6eea", "title": "Exhibitions", "text": "To introduce the youth to the latest advances in technology and to give them a glimpse of the changing times, several intriguing exhibitions are showcased during the fest. The exhibitions of the past have been a huge success among the participants, motivating them to think beyond boundaries.", "page": "Ktj"}, {"chunk_id": "f97d3002", "title": "Tech4Fun", "text": "For the recreation of the participants after participating in the various events, Kshitij hosts light, fun-filled activities like:\n• TechQuila: The energetic stage amidst the Arena\n• Snappit: Photography event", "page": "Ktj"}, {"chunk_id": "8ff07ba5", "title": "See Also", "text": "• The Main website of Kshitij( ktj.in ) remains active only during and around the time of fest. Visit Kshitij, IIT Kharagpur to get the latest information about the largest techno-management fest of Asia anytime anywhere\n• List of guest lectures in Kshitij\n• Spring Fest", "page": "Ktj"}, {"chunk_id": "79614622", "title": "References", "text": "↑ Fritz, Ben (2010-10-14). \"Budding engineers, managers to attend Kshitij at IIT-Kharagpur\" . Los Angeles Times ( Tribune Company ) . Retrieved 2010-10-16 . ↑ IIT Kharagpur , Indian Institute of Technology Kharagpur. ↑ \"IIT-Kharagpur invites students for techno-management fest\" . Times of India. 2013-10-14 . Retrieved 2013-10-14 . ↑ Kshitij -Techno management fest . Knowafest.com. November 2011. [ dead link ] ↑ \"Kshitij 2011 - Techno Management Fest, IIT Kharagpur, Kharagpur, West Bengal, January 28-31 2011\" . Knowafest.com. 2011. ↑ IIT-Kharagpur organises techno-management fest IIT-Kharagpur organises techno-management fest ↑ IIT Gandhinagar students gear up for Kshitji ↑ Fritz, Ben (2012-10-24). \"Online events ahead of techno management fest at IIT Kharagpur.\" . Los Angeles Times (Times of India) . Retrieved 2012-10-24 . ↑ \"FEATURES / EDUCATION PLUS : IIT-Kharagpur gears up for Kshitij\" . Chennai, India: The Hindu. 2012-10-29 . Retrieved 2012-12-22 . ↑ Fritz, Ben (2012-10-31). \"IIT Gandhinagar students gear up for Kshitji\" . Times of India (Times of India) . Retrieved 2012-10-31 . ↑ \"Campus chitchat: Kshitij 2013 in February\" . Indian Express. 2012-12-04 . Retrieved 2012-12-22 . ↑ \"Robot festival at IIT-Kharagpur - The Times of India\" . The Times Of India . ↑ \"Call next Android Lassi, demand IITians\" . DNA India. 2013-10-14 . Retrieved 2013-10-14 . ↑ ↑ Robotix 2015 .", "page": "Ktj"}, {"chunk_id": "bc4b6fa2", "title": "External links", "text": "• Documentary Kshitij 2020\n• Documentary Kshitij 2018\n• Documentary Kshitij 2017\n• Documentary Kshitij 2016\n• Documentary Kshitij 2015\n• Documentary Kshitij 2014\n• Documentary Kshitij 2013\n• Documentary Kshitij 2012\n• Documentary Kshitij 2011\n• Documentary Kshitij 2010\n• Technology Student's Gymkhana\n• Robotix official website", "page": "Ktj"}]