[{"chunk_id": "df7643ff", "title": "Lean In", "text": "‘Lean In’ is a revolution that originated with Sheryl Sandberg's book, Lean In: Women, Work, and the Will to Lead . In her famous bestseller, the celebrated COO of Facebook lists issues women face in the workplace and how we can tackle them effectively. This has led to the formulation of several Lean In Chapters all around the world.\nA Lean In Chapter is a group of women working together in a college, office or colony and holds regular sessions called Lean In Circles for productive discussions. Lean In, IIT Kharagpur Chapter has grown over a five years old since its inception by IIT Kharagpur alumnus, Ayushi Mrigen, who organised our first Lean In Circle meet-up — a Google Women Techmakers workshop.", "page": "Lean In"}, {"chunk_id": "2c1428e8", "title": "What it Does?", "text": "While Kharagpur has a plethora of opportunities to learn and grow, sometimes being a part of the gender minority can prove to be overwhelming. In order to target this, and to create a peer group among girls of similar interests, Lean In organizes workshops targeting specific skills. It aims at bringing together the girls of IIT Kharagpur to a common platform where they can find people with common interests, learn from each other, form teams and collaborate to work on projects. It provides a conducive environment for learning, growth and inspiration to serve as role models for others.", "page": "Lean In"}, {"chunk_id": "62cfa226", "title": "Skill Series", "text": "It has organized two sessions so far in the Skill Series, covering Competitive Coding and Communicating With Confidence. These workshops were headed by seniors of IIT Kharagpur who are experienced in the respective field or have worked in the specific area.\nIn the Competitive Coding session, two Google interns introduced the concept of competitive coding, why it is beneficial and various resources that can be used to practice it. With an overwhelming response, the session also included a call with one of the best competitive coders of India who has a work experience of eleven years at Google.\nThe Communicating With Confidence session taught how body language, tone and attention to verbal and non-verbal communication affect the fruitfulness of a conversation. The session also highlighted breaking down an idea to its fundamentals and ensuring relevance of information being delivered.", "page": "Lean In"}, {"chunk_id": "5003aa5c", "title": "Career Series", "text": "It organized a Management Consulting webinar with a former analyst of McKinsey & Company. Various topics were covered such as the definition of consulting, profile requirements for recruitment in a consultancy firm as well as the challenges that come with it. The session was informative and gave the girls an idea of the pros and cons of consultancy, helping them understand whether they wanted to venture into the field and how suitable it might be for them as a career option.", "page": "Lean In"}, {"chunk_id": "461c7c6c", "title": "Mentorship Series", "text": "Lean In collaborated with the male and female alumni of IIT Kharagpur, doing exceedingly well in their respective fields and asked them to mentor female students at IIT Kharagpur. One alumnus was allotted as a personal mentor to each of the girl students who applied for the program.", "page": "Lean In"}, {"chunk_id": "2254a76d", "title": "TFQ and SAP Labs", "text": "Lean In collaborated with The Female Quotient in 2019 to set up an FQ Lounge at IIT Kharagpur and is glad to soon start an FQ lounge now at the IIT Kharagpur campus.\nAn event was conducted on 31st August 2019 with the aim to showcase women leaders in diverse fields and highlight the power of women invested in each others’ success for collective growth. An eminent patent attorney and biologist for a guest talk, Dr. Sudeshna Sarkar, Head, Computer Science & Engineering Department at IIT Kharagpur and Dr. Arpi Mardirossian from University of Southern California were invited to join the webinar. Collaborating with SAP Labs, it organized a Design Thinking Workshop on the UN Sustainable Development Goals by Mr. Rahul Sachdev, Head SAP Next-Gen India Subcontinent.\nIt has also conducted sessions on various topics such as Work Life Balance, Negotiating Skills for Women and so on. The girls who are part of Lean In IIT Kharagpur Chapter have benefited immensely in their skills training through our workshops and mentorship program. They have gained a rock-solid education about tackling gender bias in society and are hopeful to grow into successful individuals contributing significantly towards society.", "page": "Lean In"}, {"chunk_id": "1e8bcea0", "title": "2023-24", "text": "• Nandini Bajaj\n• Ragini Laskar\n• Sruthi Mahalakshmi\n• Thoravi Pise", "page": "Lean In"}, {"chunk_id": "dd096a50", "title": "Useful Resources", "text": "• https://shegazette.github.io/SheGazetteWebsite/\n• https://medium.com/lean-in-iit-kharagpur\n• https://www.instagram.com/leanin_iitkgp", "page": "Lean In"}, {"chunk_id": "743d42dc", "title": "References", "text": "• https://medium.com/lean-in-iit-kharagpur/lean-in-iit-kharagpur-chapter-cae9706f5c18", "page": "Lean In"}]