[{"chunk_id": "cfe0f84b", "title": "Life Fellows", "text": "Life Fellows at IIT Kharagpur are successful people who have been a support and guidance towards the development of IIT Kharagpur.", "page": "Life Fellows"}, {"chunk_id": "0ed61eae", "title": "Eligibility", "text": "This section is empty. You can help by adding to it .", "page": "Life Fellows"}, {"chunk_id": "97df11d3", "title": "Life Fellows List", "text": "The current list of life fellows are [ 1 ] :", "page": "Life Fellows"}, {"chunk_id": "938879ef", "title": "Purnendu Chatterjee (Since 2003)", "text": "Dr. Purnendu Chatterjee is the Chairman of Chatterjee Group, which makes long-term strategic investments in public and private companies, with primary focus in telecommunications and information technology industries. Chatterjee Group is the lead promoter of Haldia Petrochemicals, Ltd., a world-scale petrochemical complex in India. Other areas of investments include : Outsourced technology-based services, real estate, aviation, and financial services. United States and India are the major areas of focus. Dr. Chatterjee's unique background combines expertise in technology, management consulting and international investing. He serves on the Board of Haldia Petrochemicals Ltd., Financial Technologies International Inc., Call Sciences Inc., TCG Software, Chembiotek Research International, and other companies. [ 2 ]\nPrior business associations have been with the internationally renowned investor, George Soros, in addition to being an advisor to the Quantum Group of Funds managed by Soros Fund Management. At McKinsey & Company where Dr. Chatterjee was a Principal, he led major strategy and organizational assignments for chief executive officers of large industrial companies in the U.S., Europe, and Japan. [ 2 ]\nDr. Chatterjee received a B.Tech. from the Indian Institute of Technology Kharagpur and both Masters and Doctorate degrees in Operations Research from the University of California, Berkeley. He was a research associate at the Stanford Research Institute. [ 2 ]\nDr. Chatterjee is a founding member of the Indian School of Business and Advanced VLSI Design Laboratory at IIT Kharagpur. He is also a Trustee of Asia Society; TiE (The Indus Entrepreneurs); Center for the Advanced Study of India, University of Pennsylvania; President of the TiE Tri-State; and a Board member of I-Create; US - India Business Council; and member of the Council on Foreign Relations. [ 2 ]", "page": "Life Fellows"}, {"chunk_id": "7d56cd50", "title": "Brijendra Kumar Syngal (Since 2003)", "text": "Sri Brijendra Kumar Syngal, Vice Chariman, BPL Communications Limited is an alumnus of IIT Kharagpur with an illustrious career spanning over four decades as a leading telecommunication expert and administrator in the country. Sri Syngal obtained B.Tech (Hons) and M.Tech degrees from IIT Kharagpur in 1961 and 1962, respectively. He was the Chairman and Managing Director of Videsh Sanchar Nigam Limited, the leading provider of international telecommunication services in India, from 1991-98. Under his stewardship, VSNL grew into one of the top ten listed companies within the private and public sectors in India. [ 3 ]\nBefore joining BPL Communication, he also served as Chairman of Reliance Telecom Limited from 1998-2001. His initiatives over the two years at Reliance resulted in defining the vision and the strategy in the area of Telecomm for the group. In recognition of his outstanding contributions to the field of telecommunications, he has received a large number of awards which include \"Partners in Progress\" award by the Govt. of Maharashtra, \"International Excellence Award\", \"Telecomm Man of the Decade\" award. He has played a major role in the International Telecommunication arena shouldering responsibilities like Chairman, Commonwealth Telecommunications Organization, London; Councillor for India, INMARSAT Council, London; Governor, INTELSAT Board, Washington D.C., to name a few. [ 3 ]\nSri Syngal is actively associated with IIT Kharagpur as a member of the Advisory Committee of G. S. Sanyal School of Telecommunications. He was instrumental in setting up VSNL sponsored Chair on Information Technology and a number of scholarships for undergraduate students at IIT Kharagpur. [ 3 ]", "page": "Life Fellows"}, {"chunk_id": "cb1e494b", "title": "Satyendranath Das (Since 2003)", "text": "Born in 1926, Dr. Satyendranath Das, obtained M. Sc. degree in Applied Physics from Calcutta University and Ph.D. in Microwave Physics from London University. Dr. Das taught Electronics at several Universities in India, U.K. and U.S.A. and has served Government, Industries like Loral, TRW, Lockheed and research institutions in U.S.A. He was a member of the U.S. delegation to International Telecommunication Union Committee Consultative, International Radio meetings and 1979 World Administrative Radio Conference. Dr. Das holds 26 patents and has published several research papers in international journals. He is currently retired and settled in U.S.A. [ 4 ]\nDr. Das has taken number of steps to support research and development at IIT Kharagpur and at a few other institutions in West Bengal. He was instrumental in sending eminent experts to deliver Labanyamayee Das Seminar lectures in the Institute. Dr. Das donated fund to set up Rajendranath Das Chair in Integrated Circuits in the Computer Science & Engineering Department of the Institute. He also provided fund for creating Labanyamayee Das Molecular Genetics R&D Laboratory in the Biotechnology Department of the Institute. [ 4 ]\nDr. Das is actively involved in sponsoring awards and scholarships to meritorious students in West Bengal. He has been providing financial support to academic and research programmes in a number of schools in the state and also to Narendrapur College, Ramakrishna Mission Institutions, Jadavpur University and Calcutta University. [ 4 ]", "page": "Life Fellows"}, {"chunk_id": "2b1ad996", "title": "Anadi Sankar Gupta (Since 2003)", "text": "Born on 1st November, 1932, Dr. Anadi Sankar Gupta obtained M.Sc. in Applied Mathematics with First Class from Calcutta University in 1954, Ph.D. degree in Mathematics in 1958 from IIT Kharagpur and D.Sc. degree in Mathematics in 1966 also from this Institute. [ 5 ]\nProfessor Gupta was one of the most renowned Professors of Mathematics of this Institute. He was elected a Fellow of Indian National Science Academy in 1980 and in 1990 a Fellow of National Academy of Sciences. He was the President of Annual Congress of the Indian Society of Theoretical and Applied Mechanics in 1985, Annual Congress of the National Society of Fluid Mechanics and Fluid Power in 1990 and Annual Congress of Indian Mathematical Society in 1999. Dr. Gupta wrote a book named \"Calculus of Variations with Applications\" published by Prentice Hall of India, New Delhi. [ 5 ]\nProfessor Gupta was honoured with the prestigious S. S. Bhatnagar award in 1972. He is the recipient of F.I.C.C.I. award in 1978, P. L. Bhatnagar Memorial Lecture award of Indian Mathematical Society in 1995 and Professor Vishnu Vasudeva Narlikar Memorial Lecture award of INSA in 2003. Even after his retirement in 1993, Dr. Gupta is actively involved in research and is rendering his valuable services to the Institute as Emeritus Professor and is currently INSA Honorary Scientist in the Department of Mathematics. [ 5 ]", "page": "Life Fellows"}, {"chunk_id": "827f2758", "title": "Vinod Gupta (Since 2002)", "text": "Main article: Vinod Gupta\nMr. Vinod Gupta, Chairman and CEO, infoUSA Inc. (formerly American Business Information, Inc.) graduated from liT Kharagpur in 1967. Thereafter he went to the USA to do an MS in Agricultural Engineering and obtained a Master's degree in Business Administration from the University of Nebraska in 1972. After a stint as Marketing Research Manager in Commodore Corporation, Mr. Gupta founded his own business company, American Business Information Inc. with a capital of 100 dollars. Within a short time the company began to flourish because of the unique information services it offered to American businessmen. [ 6 ]\nMr. Gupta's power of organization and breadth of vision is nothing short of extraordinary. This has been recognized through the many awards and honours he has received in the USA. Only a few can be mentioned here (1) Doctor of Humane Letters by University of Nebraska, 1999 (2) Member of Board of Trustees of the John F. Kennedy Center for the Performing Arts (Appointed by the President of the United States, William Jefferson Clinton) (3) He was nominated and confirmed to be the u.s. Counsel General to Bermuda. He was nominated to be the U.S. Ambassador to Fiji, due to business pressures, he withdrew his nomination. (4) Business Leadership award 1991 (by the Alumni Association of the College of Business Administration of the University of Nebraska) (5) Entrepreneur of the Year 1989 (by the Nebraska for Productivity and Entrepreneurship, University of Nebraska). [ 6 ]\nFor the past many years Mr. Gupta has been offering a scholarship for the best performance in Humanities and Social Sciences among B. Tech student. In 1992 Mr. Gupta gave two million dollars to the Institute for setting up the Vinod Gupta School of Management, which has already emerged as a front-ranking business school. He continues to support the school by encouraging sponsorship to Indian students for doing project work in American industries. By forming the Technology Foundation, Mr. Gupta set in motion a vital and vibrant interaction between IIT faculty, administration and the alumni abroad. He has provided various kinds of assistance to IIT students and pays regular visits to the school to discuss and chalk out constructive plans. [ 6 ]", "page": "Life Fellows"}, {"chunk_id": "37f3dbf3", "title": "Arjun Malhotra (Since 2002)", "text": "Main article: Arjun Malhotra\nMr. Arjun Malhotra, Chairman and CEO, TechSpan, Inc., USA, is one of the most distinguished alumni of IIT Kharagpur. A graduate in Electronics and Electrical Communication Engineering of the batch of 1970, he excelled in academics as well as extra-curricular activities and was awarded the highly coveted B.C Roy Gold Medal for all-round performance. He was the General Secretary, R.P. Hall in 1968-69 and was elected the General Secretary, Sports, of the Students' Gymkhana in 1969-70. Mr. Malhotra made his mark through his strong leadership qualities, which were perhaps seeded during his school days at Doon School. [ 7 ]\nAs a pioneer in Information Technology, Mr. Malhotra's name has almost become a byword for innovation and enterprise. Starting with a modest venture, Microcomp Ltd., with five friends in 1975 and an equity of Rs 1.75 lacs, Mr. Malhotra went on to create the HCL Limited, fired by a steady vision and strong resolve. This was followed by the creation of other organizations like Hindustan Instruments Ltd, Hindustan Reprographics Ltd, Hindustan Telecommunication Ltd, NIIT Ltd, and Far East Computer Private Ltd, Singapore. [ 7 ]\nIn 1989, Mr. Malhotra set up HCL America Inc in Sunnyvale, USA which evolved to become HCL Technologies. Today the group has an employee strength of 8500, with its revenues soaring to several thousand crores of rupees. Mr. Malhotra's ceaseless entrepreneurial spirit today finds expression in TechSpan, the 12-year old Distributed ConsultingTM IT services company. [ 7 ]\nMr Malhotra has made outstanding contributions to his alma mater by founding the G.S. Sanyal School of Telecommunication, named after his Professor and former Director, liT Kharagpur for advanced research in electronics. He has also helped actively in setting up the campus communication network and VLSI Laboratory. He acts as a great source of inspiration to the faculty and researchers during his annual visits to the school. [ 7 ]", "page": "Life Fellows"}, {"chunk_id": "cb1d2efd", "title": "Bijoy G. Chatterjee (Since 2002)", "text": "Mr. Bijoy G. Chatterjee, Director, Systems Research, National Semiconductor Corporation, USA is not an IIT Kharagpur alumnus, but it would be difficult to find a truer and more selfless friend of the Institute. He has made significant contributions to the infrastructure development and promotion of industrially relevant research at th is Institute and fostered its collaboration with internationally reputed institutions. Mr. Chatterjee obtained his BSEE degree from BIT, Sindri, and his MSEE from Berkeley, California. [ 8 ]\nMr. Chatterjee was a member of the team from US universities who pioneered Computer Science education at IIT Kanpur. He also worked at Union Carbide and Tata Consultancy Services. He was the founding secretary of the Indian Computer Group in 1964, which later became the Computer Society of India. He developed software for Operating Systems, Language Processors and Data Base Management System during the late sixties and the early seventies. He was responsible for the integration, operation and enhancement of Illiac IV, the legendary parallel computer at Ames Research Center. He spent fifteen years developing and running the Advanced Technology Laboratory of TRW at Sunnyvale, CA. [ 8 ]\nIt was Mr. Chatterjee who first conceived the possibility of setting up a world class VLSI Design Laboratory at IIT Kharagpur. He persuaded the IIT foundation to provide funds for the project and urged successfully five major internationally acclaimed industries (National Semiconductor Corporation, Sun Microsystems, Agilent Technologies, Cadence and Synopsys) to support it technically. He continues to help the project by providing strategic advice and facilitates collaboration with top US universities. Mr. Chatterjee has helped the departments of CSE, ECE and EE to initiate research programmes in cutting edge areas of technology and has been instrumental in obtaining funding close to one million dollars for such programmes in the last three years. He initiated collaboration between Kharagpur and US universities with the visit of liT faculty and students to GaTech, UMich and UW. He arranged courses at Kharagpur by international experts and introduced faculty and students to eminent scientists in the USA. He is now working on development of a joint program between Kharagpur and leading US universities where US students will come to IIT Kharagpur for training. [ 8 ]", "page": "Life Fellows"}, {"chunk_id": "53ac485f", "title": "Suhas S. Patil (Since 2002)", "text": "Dr. Suhas S. Patil is founder and Chairman Emeritus of Cirrus Logic Inc. a leading semiconductor company in USA. Founded by him in 1984, Cirrus Logic is recognized for creating the fabless business model of semiconductor companies. Cirrus Logic brought to fruition VLSI design methodology work Dr. Patil did at the Massachusetts Institute of Technology and at the University of Utah. [ 9 ]\nSuhas S. Patil received his B.Tech. degree in Electronics and Electrical Communication Engineering from IIT Kharagpur in 1965. He completed a Doctor of Science degree in Electrical Engineering form MIT in 1970. He joined MIT as Assistant Professor in 1970. While at MIT, Dr. Patil also served as Assistant Director of Projects MAC (Multi-Access Computer), the largest computer science laboratory in USA at that time, where modern time-sharing was developed. He is author of 40 publications and recipient of several patents. [ 9 ]\nDr. Patil is a founder and the first president of The Indus Entrepreneurs (TiE) a global non-profit organization teaching and fostering entrepreneurship. He serves on the Board of Trustees of The Computer History Museum, The Tech Museum and the World Affairs Counsel of Northern California. He is an investor in and Chairman of Cradle Technologies a semiconductor startup company in Silicon Valley. [ 9 ]\nAn honorary doctoral degree was conferred upon him in 1995 at the 41st annual convocation. He is the main architect in the conceptualization of the campus wide network and has been one of the major contributor and fund-raisers for the same. The funds generated by his team were also used for procurement and distribution of subsidized computers to the students of this Institute. [ 9 ]", "page": "Life Fellows"}, {"chunk_id": "9087cd8f", "title": "G. S. Sanyal (Since 2006)", "text": "Main article: G.S. Sanyal\nOver the years, Professor Sanyal has contributed immensely to the development of higher technological education of the country, in general, and IIT Kharagpur in particular, through his continuous association with the Institute since 1954 till date. [ 10 ]\nProfessor Sanyal has committed himself passionately to the social welfare including the use of technology for rural upliftment. For this scholarship, patriotism and innate love of students, Professor Sanyal's name has become a byword among generations of learners at IIT Kharagpur. This love has been repaid in ample measure, as evidenced in the setting up of the G. S. Sanyal School of Telecommunication by one of his former students, Sri Arjun Malhotra, now a Life fellow of the Institute. His meritorious contribution to the field of Communication Engineering has been recognised by the Institute through the award of D. Sc. (Doctor of Science) Honorius Causa in the 49th Convocation. [ 10 ]", "page": "Life Fellows"}, {"chunk_id": "a5c7cbdb", "title": "References", "text": "↑ Life Fellows list at IIT Kharagpur ↑ 2.0 2.1 2.2 2.3 Life Fellow Page of Dr. Chatterjee ↑ 3.0 3.1 3.2 Life Fellow Page of Shri Syngal ↑ 4.0 4.1 4.2 Life Fellow Page of Sandyenranath Das ↑ 5.0 5.1 5.2 Life Fellow Page of Anadi Sankar Gupta ↑ 6.0 6.1 6.2 Life Fellow Page of Vinod Gupta ↑ 7.0 7.1 7.2 7.3 Life Fellow Page of Arjun Malhotra ↑ 8.0 8.1 8.2 Life Fellow Page of Bijoy Chatterjee ↑ 9.0 9.1 9.2 9.3 Life Fellow Page of Suhas Patil ↑ 10.0 10.1 Life Fellow Page of G.S.Sanyal", "page": "Life Fellows"}]