[{"chunk_id": "d7ff4d04", "title": "Introduction - Why IPFS", "text": "Sometimes, users might required to add PDF files in a wiki article. But files generally consume a lot of space on the server. Hence, a simpler solution would be to upload the PDF somewhere and put its reference link in the article. General solution might be to upload a PDF in one's cloud storage accounts like Google Drive or Dropbox. But there are chances that in future the link to the file may be broken due to reasons like user's account getting banned or user deleting the file accidentally. So, it is necessary to have a place, where the PDF is uploaded permanently, and link is valid forever.\nIPFS [ 1 ] solves our problems here. IPFS is a peer to peer file storage system. A file uploaded in IPFS cannot be deleted [ 2 ] . So, the link in the article will never be broken. This article follows a step by step guide on how to upload a file using IPFS and access it using a link, which can be put in the wiki article.", "page": "Link PDF files as links in metakgp wiki (using IPFS)"}, {"chunk_id": "7bb0bdd7", "title": "Step by Step guide", "text": "• Visit the site - https://anarkrypto.github.io/upload-files-to-ipfs-from-browser-panel/public/\n• Click on CHOOSE FILES button and upload the file\n• Click on the Upload at the bottom of the page, as shown here\n• On the Right hand side, in a grey background text area, you can see a JSON with key names - path, hash, size.\n• Copy the hash value to the clip board, as shown here .\n• The file can be viewed at the URL https://ipfs.io/ipfs/HASH_WHICH_YOU_JUST_COPIED , as show here\n• You can reference the above link in the wiki article.\n• Not Just PDF files, you can also upload images, videos too.", "page": "Link PDF files as links in metakgp wiki (using IPFS)"}, {"chunk_id": "63efd8b6", "title": "Further Reading", "text": "• Introductory video on IPFS\n• IPFS docs\n↑ IPFS Powers the Distributed Web ↑ Can I delete my content from the network? - Help - discuss.ipfs.io", "page": "Link PDF files as links in metakgp wiki (using IPFS)"}]