[{"chunk_id": "7bdee30d", "title": "List of Departments", "text": "This article or section is in the process of an expansion or major restructuring. You are welcome to assist in its construction by editing it as well. If this article or section has not been edited in several days , please remove this template. This article was last edited by 203.110.242.41 ( talk | contribs ) 2 years ago. ( Update )", "page": "List of Departments"}, {"chunk_id": "ab05971a", "title": "Aerospace Engineering", "text": "Aerospace Department IIT Kharagpur\nThe department was set up in 1965 leading to B.Tech (Hons.) degree after a high power committee appointed by GOI stressed the need for manpower training in the field of Aeronautical Engineering. Over the years, the department has built up laboratories in the areas of aerodynamics, structures and propulsion. A Centre of Excellence for Composite Structures Technology, funded by ARDB, has been established in 1999. Some major thrust areas of the future are Aerospace Control Systems, Aero-Servo-Elasticity, Aerothermo-Mechanics, Industrial Aerodynamics, Air Breathing Propulsion, Composites, Computational Fluid Dynamics, Non-destructive testing and Wind Energy. Currently, the research efforts of the faculty are supported by a large number of projects sponsored by ARDB, ADA, ISRO, DST, AICTE, MHRD and many other organisations", "page": "List of Departments"}, {"chunk_id": "99d212d7", "title": "Research Areas", "text": "Smart and Composite Structures\nUncertainty Quantification in Aircraft Analysis & Design\nJet controls.\nAerospace structures\nNonlocal elasticity\nFEM\nFGM\nSmart Structures\nComposite materials and nano-composites\nOptimization\nFGM Plates and Shells\nComposite and Smart Structures\nStructural Dynamics & Aeroelasticity\nDesign & Development of MR fluid damper & Landing Gear Dynamics\nStructural Health Monitoring\nComposite Structures\nMicro Air Vehicle\nComputational Aerodynamics Experimental Aerodynamics\nFluid Mechanics\nAerodynamics\nAeroacoustics\nLarge Eddy Simulation\nFluid-Structure Interaction\nComputational fluid dynamics and flight mechanics\nFlight Dynamics Controls System-Identification Neural Networks\nCombustion and propulsion\nFault Detection and Isolation\nGlobal Navigation Satellite Systems (GNSS)\nCombustion of Solid Fuels and Energetic Particles\nPath Planning of Autonomous Vehicles\nDroplet and Spray Combustion\nExperimental Methods in Combustion\nAtomization and Sprays\nSystem Identification/Parameter Estimation - Neural Networks\nFlight Dynamics & Control and Flight Testing\nDesign Guidance and Control of Rockets Parafoil UAV MAV WIG-Craft etc.\nNumerical simulation of compressible and chemically reacting flows\nCombustion Driven Shock Tunnel\nLaser spectroscopy (new field)\nTwo-Phase Flow Computations\nDNS\nLES\nCompressible turbulence\nTurbulence-radiation interaction\nTurbulent reacting flows\nhigh performance computing\nSolid Mechanics\nHydrodynamics.\nAero-acoustics.\nShock-Boundary Layer Interactions.\nRadiative heat transfer\nCombustion\nTrajectory Optimization\nDubins Vehicle\nObstacle Avoidance\nEstimation Theory\nUAV", "page": "List of Departments"}, {"chunk_id": "1b4ba071", "title": "Agricultural & Food Engineering", "text": "The department, the first of its kind in the country was set up in 1952 on the recommendation of the Dhar Committee appointed by the Board of Governors. As one of the larger departments of IIT Kharagpur, it covers a wide range of areas dealing with Post-Harvest Technology, Dairy and Food Engineering, Farm Machinery and Power Workshop, Aqua-Cultural Engineering. Sponsored research projects and development activities deal with Integrated Rainwater Management, Soil Tillage, Utilisation of Fly ash, Ergonomic Database for Agricultural Equipment, Integrating Remote Sensing Data with Distributed Hydrological Models, Model Pilot Plant for producing industrial enzymes etc. The department has filed several patent application based on its developmental work.", "page": "List of Departments"}, {"chunk_id": "43196075", "title": "Research Areas", "text": "Microalgal Biofuel\nBiodegradable Polymers (Polyhydroxyalkanoates) from Cyanobacteria\nBioremediation with Microalgae\nBioactives from Microalgae\nRecirculatory Aquacultural Systems\nPost Harvest & Food Process Engineering\nHigh Pressure Processing of High Value Perishable Commodities\nDesign Optimization\nFarm Machinery & Power\nErgonomics & Safety\nWatershed Management\nNon-point Source Pollution of Soil & Water\nClimate Change Effect on Agriculture\nRainwater Managment\nPost Harvest Engineering\nMechanized Food Processing and Food Engineering\nDairy and Food Process Engineering\nCage for mariculture\nHydrological modelling & Watershed management\nCrop yield modelling\nClimate change analysis & applications in water and crop management\nMicro Irrigation\nGreenhouse Technology\nFlood Forecasting\nDesign Flood Estimation\nFlood Inundation Modeling and Hazard Assessment\nRemote Sensing and GIS Applications in Surface Water Hydrology\nHydrological Modeling\nValue based education\nFunctional Foods\nStarch based edible and biodegradable film\nDiversion from phenolics to volatile terpenoids biosynthesis in transformed roots of carrot\nDevelopment of farm Implements\nBiofuel production and hybrid power generation\nRice Transplanter\nTea Process Machinery\nIrrigation and Water Management\nHydrological Modelling\nGroundwater Management using RS-GIS and MCDM Techniques\nBasin-wide Simulation-Optimization Modeling of Groundwater Systems\nInverse Modeling for Aquifer Parameter Estimation\nRainwater Harvesting and Artificial Recharge\nUtilisation and isolation of bioactive component from food waste\nDigital soil mapping and hyperspectral remote sensing\nWater and solute transport\nUnsaturated zone hydrology\nAeration Technology\nWater quality modelling and management\nBiofiltration Technology\nSustainable & Precision Production Agriculture\nClimate Change Adaptations & Mitigations\nCrop Growth & Yield Simulation\nAlgal Food Biotechnology\nFood Biotechnology\nBioenergy\nEnzymology & its Biotechnological applications\nProtein Chemistry\nDairy & Food Process Engineering\nDevelopment of low cost - farm level processing equipment\nGrain Storage Technology\nRural and cottage industries machinery\nRTE Health Foods & Nutraceuticals\nInnovative Food Processing Technologies\nHorticultural & Plantation Crop Products Processing\nFood Safety & Quality Control\nHigh pressure processing of high value perishables\nIntegrated Land and Water Resources Planning and Management\nWater Conservation and Reuse for Climate Resilient Agriculture\nCold Storage\nCA and MA storage of fruits and vegetables\nIrrigation System Mangement\nDevelopment and Transfer of Rural Technnlogy\nSoil Science & Plant nutrition\nSoil less culture Organic farming Tea production and processing\n1 Tractor power systems 2. Traction modelling 3. Precision agriculture\nBy-product utilization\nTillage and Traction\nHeat and Mass transfer during drying of food products\nMathematical modeling and simulation in food drying process\nCO2 mitigation in solar dryers\nCO2 capture and storage\nProcess Systems Analyses and Simulations\nRemote Sensing & GIS Applications in Water Resources and Watershed Management\nFood Science and Technology\nCryogenic grinding of spices\nSoil-Tool Interaction\nPrecision Agriculture\nUnderstanding molecular oscillations of scent volatiles emission in evening blooming flowers\nArtificial Intelligence and Evolutionary Algorithms\nEvaluating metabolic perturbations in genetically-engineered root cultures of tobacco\nWaste utilization in aquaculture\nEcology and environmental pollution\nChemical-free farming\nMind and consciousness\nStress management and control\nDiscrete Element Analysis of grinding\nCFD analysis of temperature distribution in precooler\nIdentification of flavour trait(s) in Darjeeling tea accessions by targeted metabolomics\nFood Process Engineering\nPlant Tissue Culture Engineering\n1.Agronomy 2.Post-harvest Technology 3.Forest Weed & Water Management 4.Food Laws & Standards\nAgricultural water and waste management\nIrrigation hydraulics and modeling\nNonpoint source agricultural pollution\nNanomaterials in Agriculture\nGrain Storage Structures and Stored Grain Quality\nTraction and tillage performance improvement in walking tractor\nGroundwater Investigation-Recharge Analysis and Seawater Intrusion\nNon-thermal Methods of Food Processing\nAquacultural Engineering\nSelection of superior scented rice cultivars through targeted metabolomics\nPlant Image Analysis\nImpact of LED on Plant Morphogenesis\nVibration based Structural Health Monitoring (SHM)\nFarm Machinery and Renewable Energy\nWSN in Water Management\nWater and Energy Conservation in Food Processing Industries\nCyanobacterial Biofertilizer\nMicrowave application in popping of grain\nPneumatic polishing of rice\nImprovement of floral scent in evening-blooming plants by induced mutagenesis\nUltrastructural analysis of floral tissues for understanding scent volatiles emission\nMeasurement and modeling in agricultural systems\nContaminant transport\nTransport Processes in Food Engineering\nPackaging and Storage Studies\nNumerical Modelling\nSustainable Agricultural Production\nDesign and Developments of Products\nField Investigation and Modeling of Flow and Transport Processes in Vadose-Zone Systems", "page": "List of Departments"}, {"chunk_id": "a4e4ec9d", "title": "Computer Science & Engineering", "text": "The Department of Computer Science and Engineering at the Indian Institute of Technology Kharagpur, was formed in 1980. Since its inception, the department has been recognised all over the world for excellence in research and teaching. The department has a thriving research environment with active research groups in the areas of Algorithms and Theory, Artificial Intelligence, Bioinformatics, Complex and Social Networks, Data and Web Mining, Formal Methods, Information and System Security, Software Engineering, and Systems and Networking. Graduates from the department are heavily recruited by both academia and industry, and alumni of the department occupy top positions in both academia and industry all over the world.\nYou can refer to the Department of Computer Science & Engineering 's wiki to get more information.", "page": "List of Departments"}, {"chunk_id": "25711edb", "title": "Geology & Geophysics", "text": "Starting in 1952, the department expanded to allied areas of applied geology, and exploration geophysics. The department recorded commanding achievements through collaborative work with various organisations like ONGC, GSI, OIL, UCIL, DAE etc. The sponsored projects undertaken by the department include crustal evolution and geochronology of Singbhum, central, Rajasthan and southern Indian cratons, experimental petrology, gold and uranium mineralisation, mineral magnetics, Himalayan orogeny and sedimentation, stable isotopes in Phanerozoic climate change, evolution of Ganges delta, hydrology of Bengal basin and coastal aquifers, seismic tomography and deep crustal structure, seismic hazard and microzonation, near surface geophysics, archaeology of eastern India and Indus valley civilisation, planetary investigation of meteorites and mars, and consultancy projects in ground water assessment, river chemistry, seismic hazard and mining geology. The department hosts two DST national facilities of stable isotope and electron probe micoanalysis, and a state of the art non-traditional and radiogenic MC-ICP MS laboratory. Besides, the department hosts a spectrum of modern analytical and field equipment namely, X-ray diffractometer, Raman laser, FTIR, gas and ion chromatographs, liquid scintillation counter, fluid inclusion stages, magnetic susceptibility Kappa bridge etc. The geophysics laboratory hosts magneto-telluric, and array of geophysical equipment including gravimeter and resistivity meters, radiation dosimeters, large number of seismometers and a nationally networked broadband seismic observatory. The department has well equipped engineering geology and remote sensing laboratories. The department has made fundamental contributions in dating oldest rocks in India, Precambrian orogeny and metamorphism, Himalayan evolution and Cenozoic climate change, arsenic pollution in Bengal basin, crustal structure below Himalayas, sesimic microzonation of major cities, geotechnical properties of rocks, coastal geomorphology, theoretical electromagnetics, discovering martian analogues and unravelling the oldest roots of Indus valley civilisation. The faculty members are fellows of national science academies, recipient of national geoscience award, and in editorial boards of prestigeous international journals", "page": "List of Departments"}, {"chunk_id": "92c732f1", "title": "Department of Ocean Engineering & Naval Architecture", "text": "Department of Ocean Engineering & Naval Architecture\nBeing the first of its kind in the country, the department was established in 1952. during the last 60 years of its existence, the department has made significant contributions to the development of shipbuilding and shipping industries in the country including the Indian Navy, Indian Coastal Guard, DRDO and other allied organisations. The department and its alumni have important and strategic links with universities round the world and major shipyard and dock organizations in our country. In addition to teaching and training at the various levels of bachelors, masters and doctoral programs, the Department is also actively involved in various research and industrial projects sponsored by government, research organizations and industry. Some of the sponsored projects include Standard Hull Design for Mechanised Craft, Energy Audit of Ships and Scheduling of Propeller Maintenance, Development of Design Rules for Composite Ships and Boats, Computation of 3D Ship Motion and Sea Load. Ocean Engineering & Naval Architecture is a discipline that embraces diverse areas of engineering sciences. In a broad sense, this discipline is concerned with design, development, operation and planning of systems that operate in the marine and ocean environment. Areas of study under this include marine vehicles for cargo and passenger transportation, offshore activities, ocean mining, ocean and marine hydrodynamics, harnessing of non-conventional energy sources etc., reflecting the diversity of the field. In order to provide a multidisciplinary knowledge base, the course curriculum is framed by integrating many disciplines in engineering sciences, physical sciences, mathematics, humanities and management. The academic programs prepare students for a highly rewarding career in this rapidly expanding field. The academic and research programs are designed emphasizing on cutting edge knowledge in the subject areas of marine structures, hydrodynamics, ocean environment, hydroelasticity, offshore technology, design of marine vehicles & systems, coastal engineering, marine production and planning, coastal processes. Various laboratories of the Department provide opportunity to the students to gain valuable practical `on-hand’ experience. Laboratory work and design projects are incorporated extensively throughout the academic curriculum by means of the core and elective courses.", "page": "List of Departments"}, {"chunk_id": "d52478dd", "title": "Research Areas", "text": "Ship dynamics\nMathematical modelling\nCoastal Hydrodynamics\nWave and Tidal Energy\nComputational Weld Mechanics and Welding Technology\nShip Structures Structural Engineering Composite Materials Naval Architecture.\nFree Surface Hydrodynamics\nMarine Hydrodynamics\nMarine Structural Engineering\nWind-Wave Modeling\nMarine Acoustics\nCoastal Processes\nCoastal Sediment Dynamics\nPhysical & Dynamical Oceanography\nMarine Design and Production\nWave past porous structures\nMarine Dynamics\nVibrations\nHydroelasticity\nPort & Harbour Engineering\nOcean Wave Climate Projections\nDynamics of Marine Vehicles\nSeakeeping and Maneuvering\nBoundary value problems\nWave-Structure Interaction\nWave Energy Converters\nHydroelasticity of Floating Structures and Ships\nTurbulence Modeling in Oceanography\nComputational Fluid Dynamics\nMarine operation for subsea installation\nStructural vibration control\nWave Structure Interaction\nStructural Health Monitoring\nFluid Structure Interaction\nComposite Structures\nTidal energy", "page": "List of Departments"}, {"chunk_id": "6ec135bc", "title": "Thrust Areas", "text": "CFD, Coastal Marine Hazards, Marine and Ocean Hydrodynamics, Numerical Hydrodynamics, Ocean Structures, Marine structural analysis, Ocean Wave & Circulation Modeling, Marine Design, Coastal Processes, Storm Surge Prediction & Tsunamis, Suspended Sediment Dynamics, Hydroelasticity, Marine Acoustics.", "page": "List of Departments"}, {"chunk_id": "0702268a", "title": "Facilities", "text": "1 Ship Hydrodynamics Laboratory - The laboratory consists of a towing tank 150m long, 4m wide and 2.5m deep and equipped with a towing carriage of maximum speed of 6m/sec. The towing carriage has resistance and propulsion dynamometers with NI based hardware to control the carriage speed and Labview based data acquisition system. A 2D wave maker, single paddle, wetback type with AWACS (Automatic Wave Absorption and Control System) that can generate regular and irregular waves up to 40cm wave height and up to 3 sec wave period is installed at one end of the towing tank. The laboratory has a GPRS linked, Motion Recording Unit (MRU) that can record all 6 DoF. The hydrodynamics laboratory conducts resistance, propulsion and seakeeping experiments for ship models. The laboratory also has a 3-D velocity component measuring unit (acoustic type) for measuring flow dynamics around submerged body /sediment flow. The laboratory has underwater load cells for measuring mooring loads on floating structures\n2 Circulating Water Tunnel - A circulating water tunnel with a test section of 6m long, 2m wide, 1.5m deep and water speed of 1m/sec with flow control facilities enables studies of flow around floating and submerged bodies as well as measurement of sediment transportation.\n3 Welding and Marine Construction Laboratory - This laboratory is equipped with various welding units, namely submerged arc welding, shielded metal arc welding, friction stir welding and gas welding. The laboratory also has a set up plate forming using line heating. The welding units have suitable computer support for data acquisition and analysis. Work carried out in this laboratory is in the area of welding simulation, residual stress, weld induced distortion and control.\n4 Structure and Vibration Laboratory - The laboratory is equipped with a 50kN Universal Testing Machine complete with all accessories to carry out experiments with tensile, compressive and bending loads. The equipment also has a multipoint digital strain data logger.\n5 Model Making Workshop - To support the experimental activities for the above mentioned laboratories, the Department has a well-equipped workshop to fabricate ship models and other accessories for experiments. The models are made of wax, wood, fibre glass, perspex, foam, etc.\n6 The Department also has a Computational Hydrodynamics Laboratory (sponsored by Naval Research Board) and a CAD Laboratory. In addition, there are two more RS and MTech laboratories. Each research scholar is provided with a desktop computer along with required accessories including internet connection. The laboratories of the Department are equipped with various softwares like WAMIT, ORCAFLEX, NAPA, MAXSURF, MULTISURF, SHIPFLOW, CD-ADAPCO, STAAD, ANSYS Aqua, SIMO, Symbols Grapher, Rhinoceros, FLUENT, Midas Civil for structural analysis, Photomodeler for programmatic measurements, ADCIRC, SACS etc. The Department is continuously upgrading the hardware and software facilities of all the laboratories with state of the art instruments and data acquisition systems.", "page": "List of Departments"}, {"chunk_id": "9da6ace6", "title": "Physics", "text": "Quality Engineering Design and Manufacturing", "page": "List of Departments"}, {"chunk_id": "cac9f4c3", "title": "Rajiv Gandhi School of Intellectual Property Law", "text": "The Rajiv Gandhi School of Intellectual Property Law was born in 2006 within the precincts of the 2200 acre lush, green campus of Indian Institute of Technology (IIT), Kharagpur. This school enjoys the rare distinction of being the only law school within the IIT system. It offers a 3 year residential LLB course with an Honors in Intellectual Property Law. In the three years of stay the students receive a firm grounding in general laws and are exposed to intellectual property laws from the second year onwards. The laws relating to Copyright, Patents, Trademarks and Designs are as much a part of the curriculum as the Commercial Laws, Corporate Laws or Criminal Law. Students are well equipped in practical aspects of Patent drafting, Patent search, legal research, legal drafting, mooting etc. A minimum of Three months of internship is mandatory and most of the students have completed quality internships at notable firms and companies. Nine students from the current placement and internship batch have even cleared the Patent agent exam. Students actively participate and bring laurels in debate and moot court competitions.", "page": "List of Departments"}, {"chunk_id": "6545a724", "title": "Ranbir and Chitra Gupta School of Infrastructure Design and Managemen t", "text": "\"Large infrastructure projects require strong, interdisciplinary technical and management skills. It has therefore become imperative that Institutes bestowed with solid foundations in engineering, architecture, and management skills should initiate academic programmes to develop trained manpower in this upcoming area of infrastructure design and management. Indian Institute of Technology Kharagpur has a vantage position with regard to its existing faculty and academic programmes in the areas of engineering, architecture and management. The institute, with its numerous academic departments, centers and schools with academic programmes in such wide ranging areas such as law, management, architecture and engineering, is in a uniquely advantageous position to contribute to the nation's goal of building world-class infrastructure.\"\nFaculty\nAnkhi Banerjee\nArkopal Kishore Goswami\nBharath Haridas Aithal\nSwati Maitra", "page": "List of Departments"}, {"chunk_id": "474323f5", "title": "Vinod Gupta School of Management", "text": "↑ http://www.iitkgp.ac.in/academics/?page=acadunits&&dept=NA ↑ http://www.iitkgp.ac.in/academics/research.php?deptcode=NA ↑ http://www.iitkgp.ac.in/academics/thrust.php?deptcode=NA ↑ http://www.iitkgp.ac.in/academics/facilities.php?deptcode=NA\nRajiv Gandhi Shcool of IP Law", "page": "List of Departments"}]