[{"chunk_id": "info_889388", "title": "MA10001: Mathematics-I - Quick Facts", "text": "MA10001\nCourse name | Mathematics-I\nOffered by | Mathematics\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n172 264 285 209 162 182 44 EX A B C D P F | 172 | 172 | 264 | 264 | 285 | 285 | 209 | 209 | 162 | 162 | 182 | 182 | 44 | 44 | EX | A | B | C | D | P | F\n172 | 172 | 264 | 264 | 285 | 285 | 209 | 209 | 162 | 162 | 182 | 182 | 44 | 44\n172\n264\n285\n209\n162\n182\n44\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "MA10001: Mathematics-I"}, {"chunk_id": "ce27be40", "title": "Syllabus mentioned in ERP", "text": "Differential Calculus (Functions of one Variable): Rolle s theorem, Cauchy s mean value theorem (Lagrange s mean value theorem as a special case), Taylor s and Maclaurin s theorems with remainders, indeterminate forms, concavity and convexity of a curve, points of inflexion, asymptotes and curvature. Differential Calculus (Functions of several variables): Limit, continuity and differentiability of functions of several variables, partial derivatives and their geometrical interpretation, differentials, derivatives of composite and implicit functions, derivatives of higher order and their commutativity, Euler s theorem on homogeneous functions, harmonic functions, Taylor s expansion of functions of several variables, maxima and minima of functions of several variables - Lagrange s method of multipliers. Ordinary Differential Equations: First order differential equations - exact, linear and Bernoulli s form, second order differential equations with constant coefficients, method of variation of parameters, general linear differential equations with constant coefficients, Euler s equations, system of differential equations. Sequences and Series : Sequences and their limits, convergence of series, comparison test, Ratio test, Root test, Absolute and conditional convergence, alternating series, Power series. Complex Variables: Limit, continuity, differentiability and analyticity of functions, Cauchy-Riemann equations, line integrals in complex plane, Cauchy s integral theorem, independence of path, existence of indefinite integral, Cauchy s integral formula, derivatives of analytic functions, Taylor s series, Laurent s series, Zeros and singularities, Residue theorem, evaluation of real integrals.", "page": "MA10001: Mathematics-I"}, {"chunk_id": "93d29205", "title": "Student Opinion", "text": "BOOKLET TYPE QUESTION CUM ANSWER SCRIPT: Enough space is provided so don't be worried except if you have the habit of cutting the entire answer and doing it again and again.\n1 online class test and attendance for TA marks. Attend classes regularly, understand concepts, see problem solving methods in tutorials, attempt Previous Year Papers and most important practise from Kreyzig ( http://instructor.sdu.edu.kz/~merey/Advanced%20Engineering%20Mathematics%2010th%20Edition.pdf ) Jain and Iyengar or BS Grewal ( https://drive.google.com/file/d/0ByWcF5oBacJEV3BfZzljdGh2YVU/view?usp=sharing ). more than enough.\nProfessor Jeetender Kumar's videos on NPTEL: https://www.youtube.com/playlist?list=PLbRMhDVUMngeVrxtbBz-n8HvP8KAWBpI5\nDr. Gajendra Purohit {GAWD OF ENGINEERING MATHS ON YOUTUBE-SHORT AND TO THE POINT} https://www.youtube.com/channel/UC_4NoVAkQzeSaxCgm-to25A", "page": "MA10001: Mathematics-I"}, {"chunk_id": "7868b57f", "title": "Additional Resources", "text": "Instiinfo Repository\ncalculus 3 in https://tutorial.math.lamar.edu/ -> good for conceptual quick reference", "page": "MA10001: Mathematics-I"}]