[{"chunk_id": "info_3dc449", "title": "MA10002: Mathematics-Ii - Quick Facts", "text": "MA10002\nCourse name | Mathematics-Ii\nOffered by | Mathematics\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n227 231 246 219 160 191 29 EX A B C D P F | 227 | 227 | 231 | 231 | 246 | 246 | 219 | 219 | 160 | 160 | 191 | 191 | 29 | 29 | EX | A | B | C | D | P | F\n227 | 227 | 231 | 231 | 246 | 246 | 219 | 219 | 160 | 160 | 191 | 191 | 29 | 29\n227\n231\n246\n219\n160\n191\n29\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "MA10002: Mathematics-Ii"}, {"chunk_id": "4300432a", "title": "Syllabus mentioned in ERP", "text": "Linear Algebra: Algebra of matrices. Vector spaces - linear dependence of vectors, basis, linear transformations, rank and inverse of a matrix, solution of algebraic equations - consistency conditions, Hermitian, skew Hermitian and unitary matrices, bilinear forms, eigenvalues and eigenvectors. Numerical solution of system of linear equations â Gauss, Gauss-Jordan elimination and Gauss-Seidel iteration methods. Integral Calculus: Fundamental theorem of integral calculus, mean value theorems, evaluation of definite integrals - reduction formulae. Convergence of improper integrals, tests of convergence, Beta and Gamma functions - elementary properties. Differentiation under integral sign, differentiation of integrals with variable limits - Leibnitz rule. Rectification, double and triple integrals, computations of area, surfaces and volumes, change of variables in double integrals - Jacobians of transformations, integrals dependent on parameters - applications. Vector Calculus: Scalar and vector fields, level surfaces, directional derivative, Gradient, Curl, Divergence, Laplacian, line and surface integrals, theorems of Green, Gauss and Stokes, line integrals independent of path. Numerical Analysis: Finite differences, Newtons forward and backward interpolation formulae, central difference interpolation formulae. Trapezoidal and Simpsons 1/3rd rules for numerical integration. Solution of polynomial and transcendental equations - bisection, Newton-Raphson and regula-falsi methods.", "page": "MA10002: Mathematics-Ii"}, {"chunk_id": "5f933416", "title": "Concepts taught in class", "text": "Absolute Grading Same as in ERP.", "page": "MA10002: Mathematics-Ii"}, {"chunk_id": "2b70675c", "title": "Student Opinion", "text": "BOOKLET TYPE QUESTION CUM ANSWER SCRIPT: Enough space is provided so don't be worried except if you have the habit of cutting the entire answer and doing it again and again.\nProfessor Jeetender Kumar's videos on NPTEL: https://www.youtube.com/playlist?list=PLbRMhDVUMngeVrxtbBz-n8HvP8KAWBpI5\n1 ONLINE TEST and attendance for TA marks. Attend classes regularly, understand concepts, see problem solving methods in tutorials, attempt Previous Year Papers and most important practise from Jain and Iyengar or BS Grewal ( https://drive.google.com/file/d/0ByWcF5oBacJEV3BfZzljdGh2YVU/view?usp=sharing ). more than enough.\nDr. Gajendra Purohit {GAWD OF ENGINEERING MATHS ON YOUTUBE-SHORT AND TO THE POINT} https://www.youtube.com/channel/UC_4NoVAkQzeSaxCgm-to25A", "page": "MA10002: Mathematics-Ii"}, {"chunk_id": "ffc6a3d7", "title": "How to Crack the Paper", "text": "This subject is a bit more difficult than the first semester because of the topics. However if you are consistent with tutorials and classes then you can easily score good in the exams. The marks of attendance are counted in the teacher's evaluation.", "page": "MA10002: Mathematics-Ii"}, {"chunk_id": "283fef9f", "title": "Additional Resources", "text": "Instiinfo Repository", "page": "MA10002: Mathematics-Ii"}]