[{"chunk_id": "info_cf9d5b", "title": "MA20101: Transform Calculus - Quick Facts", "text": "MA20101\nCourse name | Transform Calculus\nOffered by | Mathematics\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n112 134 112 83 93 100 23 EX A B C D P F | 112 | 112 | 134 | 134 | 112 | 112 | 83 | 83 | 93 | 93 | 100 | 100 | 23 | 23 | EX | A | B | C | D | P | F\n112 | 112 | 134 | 134 | 112 | 112 | 83 | 83 | 93 | 93 | 100 | 100 | 23 | 23\n112\n134\n112\n83\n93\n100\n23\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "MA20101: Transform Calculus"}, {"chunk_id": "d32d1118", "title": "Syllabus mentioned in ERP", "text": "Prerequisite: void Laplace Transform : Definition of Laplace Transform, linearity property, conditions for existence of Laplace Transform. First and second shifting properties, Laplace Transform of derivatives and integrals, unit step functions, Dirac delta-function, error function. Differentiation and integration of transforms, convolution theorem, inversion, periodic functions. Evaluation of integrals by Laplace Transform. Solution of initial and boundary value problems. Fourier Series : Periodic functions, Fourier series representation of a function, half range series, sine and cosine series, Fourier integral formula, Parseval’s identity. Fourier Transform: Fourier Transform, Fourier sine and cosine transforms. Linearity, scaling, frequency shifting and time shifting properties. Self reciprocity of Fourier Transform, convolution theorem. Applications to boundary value problems. Brief Introduction of Z-Transform, Mellin transform\nand Wavelet Transform.", "page": "MA20101: Transform Calculus"}, {"chunk_id": "94e107c8", "title": "Student Opinion:-", "text": "It is a very important topic carrying vast applications in many engineering fields. This course don't have very much concepts rather you need a decent practice to grab the topic properly. Also you need to remember a good amount of theorems and formulas which you should be able to apply at proper place.\nDuring the course, if you want to study from books. Then it is strongly recommended that you follow only one book because you may find different conventions for Fourier transform, Inverse Fourier transform,Fourier Sine transform,Inverse Fourier Sine transform etc. in different books.This thing can even effect the answer of some questions. Therefore follow the convention from one book and practice accordingly.", "page": "MA20101: Transform Calculus"}, {"chunk_id": "4bdc8215", "title": "How to Crack the Paper", "text": "For exam, firstly you should practice class problems well. After that you can practice more questions from tutorials.If you do these two things properly and have clarity in your concepts, then your job is done.It is more than sufficient to score good marks in this course and you even don't need to study any book.\nDuring the exam, mention clearly your convention for Fourier transform, Inverse Fourier transform,Fourier Sine transform,Inverse Fourier Sine transform etc. before solving any question.", "page": "MA20101: Transform Calculus"}, {"chunk_id": "273fefec", "title": "Additional Resources", "text": "14ME Batch Course Repository", "page": "MA20101: Transform Calculus"}, {"chunk_id": "24582d3d", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NR422,NR321,NR421,NR322 | NR422,NR321,NR421,NR322\nTuesday | NR422,NR321,NR421,NR322\nWednesday\nThursday\nFriday", "page": "MA20101: Transform Calculus"}]