[{"chunk_id": "info_19d510", "title": "MA20104: Probability And Statistics - Quick Facts", "text": "MA20205\nCourse name | Probability And Statistics\nOffered by | Mathematics\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n5 14 32 53 140 249 116 EX A B C D P F | 5 | 5 | 14 | 14 | 32 | 32 | 53 | 53 | 140 | 140 | 249 | 249 | 116 | 116 | EX | A | B | C | D | P | F\n5 | 5 | 14 | 14 | 32 | 32 | 53 | 53 | 140 | 140 | 249 | 249 | 116 | 116\n5\n14\n32\n53\n140\n249\n116\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "MA20104: Probability And Statistics"}, {"chunk_id": "f3d3eaa6", "title": "Syllabus mentioned in ERP", "text": "Prerequisite: void Probability: Classical, relative frequency and axiomatic definitions of probability, addition rule and conditional probability, multiplication rule, total probability, Bayes’ Theorem and independence. Random Variables: Discrete, continuous and mixed random variables, probability mass, probability density and cumulative distribution functions, mathematical expectation, moments, moment generating function, Chebyshev’s inequality. Special Distributions: Discrete uniform, Binomial, Geometric, Poisson, Exponential, Gamma, Normal distributions. Functions of a Random Variable. Joint Distributions: Joint, marginal and conditional distributions, product moments, correlation, independence of random variables, bivariate normal distribution. Sampling Distributions: The Central Limit Theorem, distributions of the sample mean and the sample variance for a normal population, Chi-Square, t and F distributions. Estimation: The method of moments and the method of maximum likelihood estimation, confidence intervals for the mean(s) and variance(s) of normal populations. Testing of Hypotheses: Null and alternative hypotheses, the critical and acceptance regions, two types of error, power of the test, the most powerful test and Neyman-Pearson Fundamental Lemma, tests for one sample problems for normal populations.", "page": "MA20104: Probability And Statistics"}, {"chunk_id": "7345dce5", "title": "Concepts taught in class", "text": "An overview of the distributions used most commonly. Some professors might also go into what the applications for a given distribution are. Style of teaching might vary wildly across sections.\nBasic JEE level probability, Random Variables, Distributions, Estimators, Testing of Hypothesis.", "page": "MA20104: Probability And Statistics"}, {"chunk_id": "e99a30f6", "title": "Student Opinion", "text": "This course is important from a beyond the marks point of view. These distributions are everywhere, and being able to talk about them with a fair bit of knowledge is fairly important, no matter what field you go into. They are also very helpful outside of work when reading about distributions of general phenomenon or trying to understand what's wrong with polling / election predictions etc. If you don't have to take this course as a depth or breadth course, then take it as an additional. That way, it doesn't affect your grade and you can study as much as you want, or as little as you need to get by. - Icyflame ( talk ) 18:48, 5 November 2018 (IST) A pretty questionable opinion, not backed by data: But I've observed across batches that students of Prof Khare's classes understand the concepts and perform better compared to the students in other sections. - athityakumar ( talk ) 20:58, 6 November 2018 (IST)\nOne of the most useful topics I'm mathematics which need to be given much attention and time. Professors are good. But nothing is an alternative to regular self study.", "page": "MA20104: Probability And Statistics"}, {"chunk_id": "d236111d", "title": "How to Crack the Paper", "text": "# Know the basics of probability. There is a little bit of that in the beginning of this course, but it generally helps even with the later subject matter Know the construction of random variables well: This part is assumed to be understood once you move past the 1-2 lectures devoted to explaining what random variables are and why they are important. Once understood, random variables provide an abstract framework to think about distributions. So, even if you don't know the specifics of a distribution, at least you will be able to understand what's going on. Learn the basic distributions thoroughly. Know how to calculate the main metrics for each distribution, and the number of variables that are required to describe a given distribution complete. Learn the last part about hypotheses testing properly. This part is taught at the very end of the course and is definitely at least one full question in the final paper. Once understood, this is much much easier than distributions.\nBe regular in Class, get your theory prepared and Practice assignments and previous year papers.", "page": "MA20104: Probability And Statistics"}, {"chunk_id": "b9e45f9c", "title": "Classroom resources", "text": "Any Probability and Statistics book will do.", "page": "MA20104: Probability And Statistics"}, {"chunk_id": "e4752299", "title": "Additional Resources", "text": "Hoel, Port and Stone.....and.... Applied Statistics And Probability for Engineers by Douglas C Montgomery Google😁\nhttps://www.probabilitycourse.com/ has very good theory along with problems in each section. This is comprehensive enough for the course.", "page": "MA20104: Probability And Statistics"}]