[{"chunk_id": "info_115a69", "title": "MA20013: Discrete Mathematics - Quick Facts", "text": "MA20013\nCourse name | Discrete Mathematics\nOffered by | Mathematics\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n2 3 8 21 21 12 4 EX A B C D P F | 2 | 2 | 3 | 3 | 8 | 8 | 21 | 21 | 21 | 21 | 12 | 12 | 4 | 4 | EX | A | B | C | D | P | F\n2 | 2 | 3 | 3 | 8 | 8 | 21 | 21 | 21 | 21 | 12 | 12 | 4 | 4\n2\n3\n8\n21\n21\n12\n4\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "MA20013: Discrete Mathematics"}, {"chunk_id": "9d011947", "title": "Syllabus mentioned in ERP", "text": "Prerequisite: void Cartesian product, relations, domain and range, composition of relations, equivalence relations, partial ordering relation. Lattices. Functions Function as a relation, injection, surjection and bijection, composition of functions, identity and inverse function. Cardinality, characteristic function. Peano postulates and finite induction, example of proof by induction. Recursive definitions. Binary operation on a set, groupoid, commutative and associative binary operations, binary operation with identity. Semigroup, monoid. Boolean algebra - Axioms and properties, atomic structure of a finite Boolean algebra. Homomorphism and isomorphism. Disjunctive and conjunctive normal forms. Algebra of position. First order predicate calculus. Theory of groups - Axioms, properties, subgroup, cyclic group, cosets, Lagrange’s theorem. Rings, subrings, ideals, ring homomorphism. Finite field - Field of order p. (p is prime).", "page": "MA20013: Discrete Mathematics"}, {"chunk_id": "af2abcae", "title": "Concepts taught in class", "text": "Basic Number Theory(Recurrence relations) - Combinatorics(Pigeonhole Principle), Sets, Relations and Functions, Groups - Axioms, Theories, Graphs - Eulerian, Hamiltonian, Trees and Tree Algorithms", "page": "MA20013: Discrete Mathematics"}, {"chunk_id": "eb1503b2", "title": "Student Opinion", "text": "A very theoretical but interesting course. Professors do not provide lecture notes, hence one needs to be pretty regular to classes.", "page": "MA20013: Discrete Mathematics"}, {"chunk_id": "e43cb650", "title": "How to Crack the Paper", "text": "Question Papers usually involve a lot of proofs and less numeric problems to solve, hence one should be aware of the exact topics covered in class. Assignments are a good source of knowing the type of problems which may occur in the examinations.", "page": "MA20013: Discrete Mathematics"}, {"chunk_id": "b7a93214", "title": "Classroom resources", "text": "Kenneth H Rosen, Discrete Mathematics and its applications with combinatorics and graph theory and Gary Chartrand, Introductory graph theory", "page": "MA20013: Discrete Mathematics"}]