[{"chunk_id": "info_a606f6", "title": "MA20103: Partial Differential Equations - Quick Facts", "text": "MA20103\nCourse name | Partial Differential Equations\nOffered by | Mathematics\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n75 69 53 60 57 89 19 EX A B C D P F | 75 | 75 | 69 | 69 | 53 | 53 | 60 | 60 | 57 | 57 | 89 | 89 | 19 | 19 | EX | A | B | C | D | P | F\n75 | 75 | 69 | 69 | 53 | 53 | 60 | 60 | 57 | 57 | 89 | 89 | 19 | 19\n75\n69\n53\n60\n57\n89\n19\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "MA20103: Partial Differential Equations"}, {"chunk_id": "45abd34b", "title": "Syllabus mentioned in ERP", "text": "Prerequisite: void Review of power series solution of ODE, Frobenius series, Bessel functions and Legendre polynomials. Introduction to partial differential equations, linear and quasi-linear equations of first order. Classification of integrals. Lagrange’s Method of solution and its geometrical interpretation, compatibility condition, Charpits method, special types of first order equations. Second order partial differential equations with constant and variable coefficients, classification and reduction of second order equation to canonical form., characteristics. Cauchy problem, Cauchy’s, Neumann and Dirichlet problems. Fourier series solution of wave equation, vibrations of a string. Riemann’s method for hyperbolic equation. Method of separation of variables to solve heat equation, Laplace equation, Diffusion equation. Integral transform method to solve second order partial differential equations.", "page": "MA20103: Partial Differential Equations"}, {"chunk_id": "b406ace5", "title": "Concepts taught in class", "text": "Different methods of solving Partial Differential Equations, namely the Lagrange's method, Charpit's method, canonical form of PDEs, Dirichlet problems, Fourier Wave Solution, Riemann methods, Integral Transform Methods etc.", "page": "MA20103: Partial Differential Equations"}, {"chunk_id": "206d936e", "title": "Student Opinion", "text": "Not a very intuitive course. Just remembering the equations, methods and the cases where a particular method is required is enough.", "page": "MA20103: Partial Differential Equations"}, {"chunk_id": "36359a09", "title": "How to Crack the Paper", "text": "Being regular to classes and solving assignments provided by the course in-charge is enough. The paper pattern has remained similar over the years with a few nasty problems with very non-intuitive solutions scattered here and there.", "page": "MA20103: Partial Differential Equations"}, {"chunk_id": "bfded63f", "title": "Classroom resources", "text": "Professors usually do not make lecture notes publicly available, but can provide you their handwritten notes on requesting. Advanced Engineering Mathematics by Erwin Kreyszig pretty much covers the entire syllabus, even the Jain & Iyengar book with the same name suffices.", "page": "MA20103: Partial Differential Equations"}, {"chunk_id": "c9ee7167", "title": "Additional Resources", "text": "14ME Batch Course Repository", "page": "MA20103: Partial Differential Equations"}, {"chunk_id": "bd53d824", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NR321,NR421,NC141\nTuesday\nWednesday | NR321,NR421,NC141 | NR321,NR421,NC141\nThursday\nFriday", "page": "MA20103: Partial Differential Equations"}]