[{"chunk_id": "info_cd280a", "title": "MA30207: Design And Analysis Of Algorithms - Quick Facts", "text": "MA21007\nCourse name | Design And Analysis Of Algorithms\nOffered by | Mathematics\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n31 95 32 17 3 1 1 EX A B C D P F | 31 | 31 | 95 | 95 | 32 | 32 | 17 | 17 | 3 | 3 | 1 | 1 | 1 | 1 | EX | A | B | C | D | P | F\n31 | 31 | 95 | 95 | 32 | 32 | 17 | 17 | 3 | 3 | 1 | 1 | 1 | 1\n31\n95\n32\n17\n3\n1\n1\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "MA30207: Design And Analysis Of Algorithms"}, {"chunk_id": "492cfd89", "title": "Syllabus mentioned in ERP", "text": "Prerequisite: Programming and Data Structures Basic concepts of algorithms, Complexity, Asymptotic notations, Trees: Binary tree, Binary Search Tree, Tree traversals. Heap as data structure. Basic sorting algorithms: selection sort, insertion sort. Greedy algorithms: Coin change problem, activity selection, Minimum Spanning Tree, Single source shortest path, knapsack problem. Divide – and – Conquer technique: Merge sort, quick sort. Solving Recurrence relations. Dynamic programming: matrix chain multiplication, all pair shortest path algorithm, 0-1 Knapsack. Graph algorithms: Warshall’s algorithm, Depth First Search, Breadth First Search. Height Balanced Tree. Branch and Bound technique, Backtracking. NP completeness.", "page": "MA30207: Design And Analysis Of Algorithms"}, {"chunk_id": "3aebd739", "title": "Concepts taught in class", "text": "Data Structures - Trees, Graphs, Heaps, Hash Tables; Sorting Algorithms; Graph Algorithms - Minimum Spanning Tree, Dijkstra, Depth-First Search, Breadth-First Search, Floyd-Warshall etc.; Greedy Algorithms; Dynamic programming; Asymptotic analysis", "page": "MA30207: Design And Analysis Of Algorithms"}, {"chunk_id": "5b4d36a9", "title": "Student Opinion", "text": "Course content similar to any basic DS-Algo course such as Algorithms-I offered by the CSE Department, with examinations and grading being considerably easier. Prof. Sourav Mukhopadhyay is a genuinely helpful professor, who has no qualms in repeating each topic multiple times till one understands it. Final opinion - Take this course as an additional only if you want to get done with the least effort put in. Otherwise, would recommend Algorithms-I any day.", "page": "MA30207: Design And Analysis Of Algorithms"}, {"chunk_id": "f24486a0", "title": "How to Crack the Paper", "text": "Most questions in the mid-semesters and end-semesters are repeated from previous year papers, so having a look at those is recommended. Some questions are asked from the MIT-OCW assignment questions too", "page": "MA30207: Design And Analysis Of Algorithms"}, {"chunk_id": "92726248", "title": "Classroom resources", "text": "The teaching style is eerily similar to the course offered by Stanford, while slides are exactly the same. Any standard DS Algo book will do, eg: Introduction to Algorithms by Cormen, Leiserson, Rivest and Stein.", "page": "MA30207: Design And Analysis Of Algorithms"}, {"chunk_id": "36f0c465", "title": "Additional Resources", "text": "Practice solving problems on online platforms such as Codechef, Hackerrank, Leetcode, InterviewBit to get a good grip on the subject.", "page": "MA30207: Design And Analysis Of Algorithms"}, {"chunk_id": "cca0636d", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NR312\nTuesday\nWednesday | NR312 | NR312\nThursday\nFriday", "page": "MA30207: Design And Analysis Of Algorithms"}]