[{"chunk_id": "info_c5bd5b", "title": "MA31007: Mathematical Methods - Quick Facts", "text": "MA31007\nCourse name | Mathematical Methods\nOffered by | Mathematics\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n3 3 8 15 11 15 2 EX A B C D P F | 3 | 3 | 3 | 3 | 8 | 8 | 15 | 15 | 11 | 11 | 15 | 15 | 2 | 2 | EX | A | B | C | D | P | F\n3 | 3 | 3 | 3 | 8 | 8 | 15 | 15 | 11 | 11 | 15 | 15 | 2 | 2\n3\n3\n8\n15\n11\n15\n2\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "MA31007: Mathematical Methods"}, {"chunk_id": "63656b42", "title": "Syllabus mentioned in ERP", "text": "Prerequisite: voidTwo-point boundary-value problems, Green's functions, Construction of Green's functions, Nonhomogeneous boundary conditions, SturmLiouville Systems, Eigen values and Eigen functions, Eigenfunction expansions and completeness.; Hypergeometric equation and functions, Properties of hypergeometric functions, Legendre equation and Legendre polynomial, Generating function for Legendre polynomial, Recurrence relations between Legendre polynomials,Rodrigueâs formula. Orthogonality of Legendre polynomial, Associated Legendre equation and Legendre function, Bessel equation and its solution, Bessel functions, Modified Bessel function, Generating function for Bessel function, Recurrence relations between Bessel functions, Orthogonality of Bessel functions.; Autonomous systems, Stability for Linear systems with constant coefficients, Linear plane autonomous systems, perturbed systems, Method of Lyapunov for nonlinear systems. Limit cycles of Poincare.; Coordinate transformations, Definition of Tensors, Summation convention, Kronecker Delta, Covariant, contravariant and mixed tensors. Fundamental operations with tensors, the line element and metric tensor, length of a vector, Christoffelâs symbols, the covariant derivative, tensor form of gradient, divergence and curl. Examples from continuum mechanics, elasticity, plasticity, fluids", "page": "MA31007: Mathematical Methods"}, {"chunk_id": "bdf4bb33", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | NC333\nThursday | NC333\nFriday | NC333", "page": "MA31007: Mathematical Methods"}]