[{"chunk_id": "info_de0a13", "title": "MA31009: Computer Organisation And Architecture - Quick Facts", "text": "MA31009\nCourse name | Computer Organisation And Architecture\nOffered by | Mathematics\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n5 8 13 17 12 EX A B C D P F | 5 | 5 | 8 | 8 | 13 | 13 | 17 | 17 | 12 | 12 | EX | A | B | C | D | P | F\n5 | 5 | 8 | 8 | 13 | 13 | 17 | 17 | 12 | 12\n5\n8\n13\n17\n12\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "MA31009: Computer Organisation And Architecture"}, {"chunk_id": "0128ecd8", "title": "Syllabus mentioned in ERP", "text": "Prerequisite: voidComputer arithmetic, point representations, introduction to CISC processor architecture, instruction set and addressing modes. Hardware design principles, polling of processors, memory types and interfacing and timing I/O handling, interrupts and DMA and device interfaces-CRT, floppy disk, HDD, optical disk, serial interfaces and data acquisition, operating system concepts and architectural support- privileged mode, software interrupts, memory hierarchy and virtual memory, multi-processors concept, cache memory, pipe lining and introduction, RISC processors, super scalar processors. Resource scheduling problems-their solutions and analysis, storage management, secondary storage, virtual memory, segmentation and paging. Concurrent processes and their synchronization abstractions. Producer â consumer problems, mutual exclusion and dead-lock, properties of concurrent programs, critical section problem, semaphores, test and set, atomic operations, security and recovery.", "page": "MA31009: Computer Organisation And Architecture"}, {"chunk_id": "d27442eb", "title": "Student Opinion", "text": "Autumn 2019\nTaught by: Pawan Kumar\nMost of the coursework was based on logical thinking and only after 5-6 lectures, the problems made us use the things he taught in class. Attendance was a major factor in grade distribution, as well as going to department for assignments on occasional weekends. The semester exams are also modeled on his assignments. It is crucial to solve the questions carefully otherwise you will not get the correct answer in first try, which is what matters in exam. As for the overall course, it is easy to get B but difficult to rise up to A/EX and also to drop to C/D.", "page": "MA31009: Computer Organisation And Architecture"}, {"chunk_id": "ff1fb121", "title": "Autumn 2016", "text": "Taught by: Pawan Kumar He taught merely about puzzles, gave us a handful of assignments which required logical reasoning rather than the COaA concepts. Furthermore, there was a huge weightage on attendance, he definitely took attendance for the 8 AM classes and discarded the attendance if the class strength was more than 50%. He tries to fit a normal curve on the marks distribution for grading. This means that only 2-3 students get EX, but no one gets F too, and most of the class ends up getting B or C grade. No books were specified. The best thing was labwork (It carried attendance). That was the best learning experience. He would give you a simulation of Computer Architecture and you would have to think of logic to solve typical problems. Nishnik ( talk )", "page": "MA31009: Computer Organisation And Architecture"}, {"chunk_id": "1320a6ca", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NC342 | NC342\nTuesday | NC342\nWednesday\nThursday\nFriday", "page": "MA31009: Computer Organisation And Architecture"}]