[{"chunk_id": "info_20aad8", "title": "MA31005: Real Analysis - Quick Facts", "text": "MA31005\nCourse name | Real Analysis\nOffered by | Mathematics\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n6 20 16 17 7 1 EX A B C D P F | 6 | 6 | 20 | 20 | 16 | 16 | 17 | 17 | 7 | 7 | 1 | 1 | EX | A | B | C | D | P | F\n6 | 6 | 20 | 20 | 16 | 16 | 17 | 17 | 7 | 7 | 1 | 1\n6\n20\n16\n17\n7\n1\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "MA31005: Real Analysis"}, {"chunk_id": "4b4b4f30", "title": "Syllabus mentioned in ERP", "text": "Dedekindâs definition of real numbers, field and order axioms, countable and uncountable sets, supremum and infimum of sets of real numbers, bounds and limit points of a set, Bolzano-Weierstrass theorem, open and closed sets. Limit inferior, limit superior and limit of sequence, bounded and monotonic sequences, Cauchy sequence and Cauchyâs general principle of convergence, product and quotient of limits, Cantorâs theorem on nested interval and its applications. Compact sets, Heine-Borel theorem. Limit, limit superior, limit inferior of real functions, limit theorems. Continuity and uniform continuity of real functions, properties of continuous functions, continuity and compactness. Differentiability of real functions, Taylor's and Maclaurinâs theorems. Riemann integration, conditions for integrability, properties of integrable functions, indefinite integral and their properties, fundamental theorem of integral calculus, mean value theorems, improper integrals, convergence at infinity, absolute and conditional convergence. Sequences and series of functions, uniform convergence of sequences and series of functions. Cantorâs definition of real numbers. Metric sets: Definition, real line as an example of a metric set.", "page": "MA31005: Real Analysis"}, {"chunk_id": "8f8c6071", "title": "Student Opinion", "text": "• It is a good course for students having an interest in theoretical mathematics. In initial stages, the questions can appear straightforward but the complexity increases when we talk about sequences/series of a function. If you were not attentive during start, you will find it difficult to stay with the course work after mid sems. Also, the applications of the things taught in this course can be useful later on in other courses.\nThe course is easily one of the most interesting course of the Department. The course is very well planned. The course starts from very fundamental questions like What actually a Real Number is? How did human intuition firstly think of Real Number?. The course offers a great platform for thinking and answers many things that we have just accepted in our childhood. The course starts from defining a Real Number,Defining sequences about it,Analyzing their properties,Defining functions about them and Defining sequences about the function. Most of the course may seem very obvious to many but the course offers good platform for Higher Mathematics to be learnt later", "page": "MA31005: Real Analysis"}, {"chunk_id": "4a69a7d8", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | NC333\nThursday | NC333\nFriday | NC333 | NC333", "page": "MA31005: Real Analysis"}]