[{"chunk_id": "info_87d9cd", "title": "MA41009: Probability And Statistics - Quick Facts", "text": "MA41009\nCourse name | Probability and Statistics\nOffered by | Mathematics\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n2 7 15 9 11 3 1 EX A B C D P F | 2 | 2 | 7 | 7 | 15 | 15 | 9 | 9 | 11 | 11 | 3 | 3 | 1 | 1 | EX | A | B | C | D | P | F\n2 | 2 | 7 | 7 | 15 | 15 | 9 | 9 | 11 | 11 | 3 | 3 | 1 | 1\n2\n7\n15\n9\n11\n3\n1\nEX | A | B | C | D | P | F\nSemester | {{{semester}}}", "page": "MA41009: Probability And Statistics"}, {"chunk_id": "d7ae6a18", "title": "Syllabus mentioned in ERP", "text": "Pre requisite: void Probability: Classical, relative frequency and axiomatic definitions of probability, addition rule and conditional probability, multiplication rule, total probability, Bayes’ Theorem and independence. Random Variables: Discrete, continuous and mixed random variables, probability mass, probability density and cumulative distribution functions, mathematical expectation, moments, moment generating function, Chebyshev’s inequality. Special Distributions: Discrete uniform, binomial, geometric, negative binomial, hypergeometric, Poisson, uniform, exponential, gamma, normal, beta, lognormal, Weibull, Laplace, Cauchy, Pareto distributions. Functions of a Random Variable. Joint Distributions: Joint, marginal and conditional distributions, product moments, correlation, independence of random variables, bivariate normal distribution, simple, multiple and partial correlation, regression. Sampling Distributions: Law of large numbers, Central Limit Theorem, distributions of the sample mean and the sample variance for a normal population, Chi-Square, t and F distributions. Estimation: The method of moments and the method of maximum likelihood estimation, properties of best estimates, confidence intervals for the mean(s) and variance(s) of normal populations. Testing of Hypotheses: Null and alternative hypotheses, the critical and acceptance regions, two types of error, power of the test, the most powerful test and Neyman-Pearson Fundamental Lemma, standard tests for one and two sample problems for normal populations.", "page": "MA41009: Probability And Statistics"}, {"chunk_id": "1184a198", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NC233 | NC233\nTuesday | NC233\nWednesday\nThursday\nFriday", "page": "MA41009: Probability And Statistics"}]