[{"chunk_id": "info_67ebdc", "title": "MA51003: Fluid Mechanics - Quick Facts", "text": "MA51003\nCourse name | Fluid Mechanics\nOffered by | Mathematics\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n9 3 2 11 2 3 EX A B C D P F | 9 | 9 | 3 | 3 | 2 | 2 | 11 | 11 | 2 | 2 | 3 | 3 | EX | A | B | C | D | P | F\n9 | 9 | 3 | 3 | 2 | 2 | 11 | 11 | 2 | 2 | 3 | 3\n9\n3\n2\n11\n2\n3\nEX | A | B | C | D | P | F\nSemester | {{{semester}}}", "page": "MA51003: Fluid Mechanics"}, {"chunk_id": "bf79cfd7", "title": "Syllabus mentioned in ERP", "text": "Prerequisite: PDE Kinematics of Fluids in Motion - Continuum Hypothesis, Lagrangian and Eularian description, Stream lines, Path lines, streak lines, vortex lines, velocity potential, vorticity vector, equation of continuity. Equations of Motion Pressure at a point in a moving fluid, conditions at boundary, Euler’s equations of motion, Bernoulli’s equation. Potential flows. Three-dimensional flows : Sources, sinks, doublets, images in rigid infinite plane and in solid sphere, Weiss’ sphere theorem, flows involving axial symmetry, Stokes stream function. Two-dimensional flows - stream function and complex potential for two – dimensional, irrotational - incompressible flows, two-dimensional image systems, Milne-Thomson circle theorem and its applications, Blasius theorem, use of conformal transformations, Kutta- Joukowski condition, Karman vortex street. Viscous flows - stress analysis in fluid motion, relations between stress and rate of strain, Navier – Stokes equations of motion of a viscous fluid, some exact solutions of Navier – Stokes equations, use of Harmonic functions, flow past a sphere, Reynolds number, Prandtl’s boundary layer theory, Karman’s integral equation, similarity solution, boundary layer for an axially symmetric flow, laminar flow with adverse pressure gradient and separation, inviscid compressible flow - Propagation of pressure change, sound velocity, subsonic and supersonic flow, Mach number, flow through a nozzle, compressible laminar boundary layer, shock boundary layer interaction.", "page": "MA51003: Fluid Mechanics"}, {"chunk_id": "7ffcc036", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday\nThursday | NC231 | NC231\nFriday | NC231 | NC231", "page": "MA51003: Fluid Mechanics"}]