[{"chunk_id": "info_f8386e", "title": "MA51115: Cryptography And Network Security - Quick Facts", "text": "MA51115\nCourse name | Cryptography and Network Security\nOffered by | Mathematics\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | {{{semester}}}", "page": "MA51115: Cryptography And Network Security"}, {"chunk_id": "1b193d5d", "title": "Syllabus mentioned in ERP", "text": "Prerequisite: Modern AlgebraIntroduction: Basic objectives of cryptography, secret-key and public-key cryptography, one-way and trapdoor one-way functions, cryptanalysis, attack models, classical cryptography. Block ciphers: Modes of operation, DES and its variants, RCS, IDEA, SAFER, FEAL, BlowFish, AES, linear and differential cryptanalysis. Stream ciphers: Stream ciphers based on linear feedback shift registers, SEAL, unconditional security. Message digest: Properties of hash functions, MD2, MD5 and SHA-1, keyed hash functions, attacks on hash functions. Public-key parameters: Modular arithmetic, gcd, primality testing, Chinese remainder theorem, modular square roots, finite fields. Intractable problems: Integer factorization problem, RSA problem, modular square root problem, discrete logarithm problem, Diffie-Hellman problem, known algorithms for solving the intractable problems. Public-key encryption: RSA, Rabin and EIGamal schemes, side channel attacks. Key exchange: Diffie-Hellman and MQV algorithms. Digital signatures: RSA, DAS and NR signature schemes, blind and undeniable signatures. Entity authentication: Passwords, challengeresponse algorithms, zero-knowledge protocols. Standards: IEEE, RSA and ISO standards. Network issues: Certification, public-key infrastructure (PKI), secured socket layer (SSL), Kerberos. Advanced topics: Elliptic and hyperelliptic curve cryptography, number field sieve, lattices and their applications in cryptography, hidden monomial cryptosystems, cryptographically secure random number generators.", "page": "MA51115: Cryptography And Network Security"}]