[{"chunk_id": "info_ba5bf0", "title": "MA60053: Computational Linear Algebra - Quick Facts", "text": "MA60053\nCourse name | Computational Linear Algebra\nOffered by | Mathematics\nCredits | 4\nL-T-P | 3-1-0\nProfessor(s) | Rajesh Kannan\nPrevious Year Grade Distribution\n1 3 3 1 1 EX A B C D P F | 1 | 1 | 3 | 3 | 3 | 3 | 1 | 1 | 1 | 1 | EX | A | B | C | D | P | F\n1 | 1 | 3 | 3 | 3 | 3 | 1 | 1 | 1 | 1\n1\n3\n3\n1\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "MA60053: Computational Linear Algebra"}, {"chunk_id": "44dbf86f", "title": "Syllabus mentioned in ERP", "text": "Prerequisite: Linear AlgebraBasic concepts, floating point numbers and errors in computation, stability of algorithms and conditioning of problems. Numerical solutions of linear systems, direct methods - Gaussian elimination with pivotal condensation, operational count and error bound. LU factorization, QR factorization, condition number and ill conditioned systems, matrix and vector norms, error bounds, Wilkinsons algorithm for ill-conditioned systems, iterative methods - Jacobi, Gauss-Seidel, SOR. Convergence and rate of convergence, conjugate gradient method, Arnoldi process and GMRES, large sparse systems, matrix inverse, generalized inverse. Least squares solution of linear systems, numerical eigenvalue problems, computation of eigenvalues and eigenvectors, singular value decomposition and least squares problem, SVD and the pseudo inverse, Jacobi, Givens and Householders methods for symmetric matrices, Hessenberg QR iteration.\nThe syllabus and resources for the course offered in Spring Semester 2019 can be well cited through the link: http://www.facweb.iitkgp.ac.in/~rkannan/cla2019/cla2019.html", "page": "MA60053: Computational Linear Algebra"}, {"chunk_id": "c4637699", "title": "Student Opinion", "text": "A very wonderful course from the point of learning, and recommended for those having a nice hold on in Mathematics, mainly in subjects like Linear Algebra, Real Analysis, and Functional Analysis.", "page": "MA60053: Computational Linear Algebra"}, {"chunk_id": "78a0620f", "title": "How to Crack the Paper", "text": "• Attend as many number of classes as possible.\n• Try solving as much of assignment questions without any fear. Some questions are made challenging (even in paper) but with practice and concentration they could become easier to solve. Its okay, even if you solve half the assignment.\n• Consider a brief revision of basic Linear Algebra concepts mainly proofs, results, and applications.\n• Aim more on learning than on getting grades.", "page": "MA60053: Computational Linear Algebra"}]