[{"chunk_id": "info_80cd30", "title": "MA60031: Cryptography And Security Issues - Quick Facts", "text": "MA60031\nCourse name | CRYPTOGRAPHY AND SECURITY ISSUES\nOffered by | Mathematics\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | {{{semester}}}", "page": "MA60031: Cryptography And Security Issues"}, {"chunk_id": "a28390fe", "title": "Syllabus mentioned in ERP", "text": "Prerequisites: Linear algebra, Modern Algebra, Number Theory, Data Structures and Algorithms. Some Topics in Elementary Number Theory: divisibility, Euclidean and other algorithms relevant to cryptography, Algebraic aspects: Finite Fields, Quadratic Residues and reciprocity. Some simple Cryptosystems: Concepts and techniques of cryptography and its applications. Cryptographic primitives, including one-way hash functions, Public Key Cryptography: RSA, attacks on RSA, ElGamal (signature, encryption), DES, SHA. Diffie-Hellman key exchange, Rabin's oblivious transfer, Shamir's 3-pass protocol, Feige-FiatShamir identification, Fiat-Shamir signature, Chaum digital signature, Yao's millionaire problem, computing with encrypted data, secret sharing (Shamir, Blakley), Discrete log knapsack: zero-knowledge proof of discrete log, of private RSA key. Tamper proofing audits trails. Watermarking and digital rights. Primality and various methods of Factorization, Authentication, digital signatures, key exchange. Attacks on protocols. Case studies of protocol failures. Dictionary attack, salt, SKEY, SKID. Multiple-key cryptography, secret splitting, time stamping, group signatures, bit commitment, fair coinflipping, mental poker, interactive zero-knowledge proofs and how to make them noninteractive, blind signatures, oblivious transfer, simultaneous contract signing, digital certified mail, simultaneous exchange of secrets, secure electronic voting, secure multiparty computations, anonymous message broadcasting, digital cash. Elliptic Curves and Elliptic Curve Cryptography, Hyper-elliptic Curve Cryptography.", "page": "MA60031: Cryptography And Security Issues"}]