[{"chunk_id": "info_c8c13b", "title": "MA61027: Cryptography And Network Security - Quick Facts", "text": "MA61027\nCourse name | Cryptography And Network Security\nOffered by | Mathematics\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n21 37 36 33 9 2 EX A B C D P F | 21 | 21 | 37 | 37 | 36 | 36 | 33 | 33 | 9 | 9 | 2 | 2 | EX | A | B | C | D | P | F\n21 | 21 | 37 | 37 | 36 | 36 | 33 | 33 | 9 | 9 | 2 | 2\n21\n37\n36\n33\n9\n2\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "MA61027: Cryptography And Network Security"}, {"chunk_id": "e20f14d5", "title": "Syllabus mentioned in ERP", "text": "Prerequisite: Modern Algebra Introduction: Basic objectives of cryptography, secret-key and public-key cryptography, one-way and trapdoor one-way functions, cryptanalysis, attack models, classical cryptography. Block ciphers: Modes of operation, DES and its variants, RCS, IDEA, SAFER, FEAL, BlowFish, AES, linear and differential cryptanalysis. Stream ciphers: Stream ciphers based on linear feedback shift registers, SEAL, unconditional security. Message digest: Properties of hash functions, MD2, MD5 and SHA-1, keyed hash functions, attacks on hash functions. Public-key parameters: Modular arithmetic, gcd, primality testing, Chinese remainder theorem, modular square roots, finite fields. Intractable problems: Integer factorization problem, RSA problem, modular square root problem, discrete logarithm problem, Diffie-Hellman problem, known algorithms for solving the intractable problems. Public-key encryption: RSA, Rabin and EIGamal schemes, side channel attacks. Key exchange: Diffie-Hellman and MQV algorithms. Digital signatures: RSA, DAS and NR signature schemes, blind and undeniable signatures. Entity authentication: Passwords, challenge-response algorithms, zero-knowledge protocols. Standards: IEEE, RSA and ISO standards. Network issues: Certification, public-key infrastructure (PKI), secured socket layer (SSL), Kerberos. Advanced topics: Elliptic and hyper-elliptic curve cryptography, number field sieve, lattices and their applications in cryptography, hidden monomial cryptosystems, cryptographically secure random number generators.", "page": "MA61027: Cryptography And Network Security"}, {"chunk_id": "5646cbfb", "title": "Autumn 2017", "text": "Taught by Sourav Mukhopadhyay One of the most stress-free courses in Maths department. There would be two class tests before Mid-semester and End semester exam, in our case that too had an option of best of two. These tests will cover your TA marks. The course material is good and is already uploaded at [ Internet Security Homepage ], he also has video recording available at NPTEL and [ here ]. Do consult previous year papers before any class test and exam. Nishnik ( talk )", "page": "MA61027: Cryptography And Network Security"}, {"chunk_id": "0c4289c7", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NR122 | NR122 | NR122\nTuesday | NR122\nWednesday\nThursday | NR122\nFriday | NR122", "page": "MA61027: Cryptography And Network Security"}]