[{"chunk_id": "26239e67", "title": "Main Page", "text": "Welcome to the MetaKGP Wiki The community wiki for IIT Kharagpur that anyone can edit . Growing with 4,204 articles.\nYellow Pages | Societies and Clubs | Contribute\nAcademics | Courses | About Us\nInstitute Amenities | How-to Guides | Projects\nThis week's featured Demo Day project Demo Days are an initiative by Metakgp to encourage developers to demo their projects, big and small, to a wider audience in an effort to acquire more users and contributors. ChillZone Maintainer(s): @thealphadollar Code: ChillZone Backend ChillZone Frontend Chillzone helps students looking for an empty room during class hours in IIT Kharagpur by giving them a list of the rooms that are free in the various classroom complexes. Chillzone also shows the list of rooms that will be free for the next slot as well, which is useful for students who have a 2 hour break between classes. Featured ( Want to get an article featured? ) Ambar Ambar Ambar is the gender and sexual diversity resource group for the Lesbian, Gay, Bisexual, Transgender, Queer and Questioning ( LGBTQ+ ) community residing in IIT Kharagpur Campus and/or officially associated with IIT Kharagpur. It comprises mainly of, but not limited to, current students, alumni, staff, and family of staff. The group also welcomes straight allies to join and support it. Constitution Constitution of the Technology Students' Gymkhana A constitution is a set of fundamental principles or established precedents according to which a state or other organization is governed. IIT Kharagpur has a vast history and student community needed some proper guidelines so that the student smooth functioning can be ensured and hence the Gymkhana constitution came into existence. The final monologue by Leela Benare played by Abhivyakti Dixit Encore Technology Dramatics Society: ENCORE is the institute's official English Dramatics Society. It was earlier referred to as the 'English Technology Dramatics Society', ETDS in short. It is under the Technology Students' Gymkhana and is a part of the Dramatics Subcommittee under the Social and Cultural Committee.", "page": "Main Page"}]