[{"chunk_id": "739a380b", "title": "Mathematics", "text": "Maths dept\nDepartment of Mathematics at IIT Kharagpur was established in 1951. It is one of the earliest department of IIT Kharagpur . Since its inception, this department has been actively engaged in teaching and research in various disciplines of Mathematical Sciences. Department offers various courses related to pure mathematics and computer science. Graduates from this department have proved their excellence in both academia and industry.", "page": "Mathematics"}, {"chunk_id": "a167040a", "title": "Courses", "text": "Department of Mathematics offers many courses related to pure mathematics , applied mathematics and computer science. It offers degree in 6 programs carried out by department.", "page": "Mathematics"}, {"chunk_id": "9385dbc6", "title": "M.Sc(5 yr) Mathematics and Computing", "text": "In order to cater to the needs of producing computer software professionals with strong foundation in mathematical analysis, logic and discrete mathematical structures, 5-Year M.Sc. program in Mathematics and Computing was started replacing the 5-year Integrated M.Sc. program in Mathematics (through the relentless effort of Prof. G. P. Bhattacharjee) to train bright students in the field of Computer Science with strong mathematical background. Curriculum for this course includes intensive mathematics and computer science related disciplines. Admission to this course is done on basis of IIT-JEE ranking. This is one of the most prestigious program and has been tremendously successful in placements of it's graduate in both academia and industry.", "page": "Mathematics"}, {"chunk_id": "f3d25a54", "title": "M.Sc. Statistics and Informatics (upto 2008 admissions)", "text": "The purpose of this new courses on Statistics and Informatics is primarily to prepare the students with in-depth knowledge of various branches of Statistics together with applications using modern tools of Informatics .After successful completion of the course, they may be holding positions in various companies dealing with IT, finance, bioinforamtics, medical informatics, research and development organizations, etc. The course is also designed to prepare students for further graduate work at the Ph.D. level, which in turn prepares students for research level careers in Statistics whether in industry, government, or academia.", "page": "Mathematics"}, {"chunk_id": "e5976fce", "title": "M.Sc.(2 yr) - Mathematics (upto 2008 admissions)", "text": "2-Year M.Sc. programme in Mathematics was also introduced from the session 1999-2000. This course is designed to train the graduates from various universities and colleges for taking up advance studies in different areas of Pure and Applied Mathematics, Statistics, and Operations Research or taking up jobs in government / private organizations", "page": "Mathematics"}, {"chunk_id": "c6f25e3e", "title": "M.Sc.(2 yr) - Statistics and Informatics (upto 2008 admissions)", "text": "The purpose of this new courses on Statistics and Informatics is primarily to prepare the students with in-depth knowledge of various branches of Statistics together with applications using modern tools of Informatics.", "page": "Mathematics"}, {"chunk_id": "359755d1", "title": "M. Tech. Computer Science & Data Processing", "text": "The successful students of this new Postgraduate programm are getting suitable job offers from various R and D organizations and software companies.", "page": "Mathematics"}, {"chunk_id": "e8c2f737", "title": "Research Projects", "text": "Intensive research in several fields of mathematics and computer science is going on in this department. Research Project spans pure mathematics , applied mathematics , quantum mechanics , algorithms ,graph theory etc.", "page": "Mathematics"}, {"chunk_id": "8d31ba4e", "title": "Professors", "text": "Name | Designation | Research interests\nMahendra Prasad Biswal | Professor | Fuzzy Programming; Game Theory and applications; Multi Choice Programming; Stochastic Programming; Uncertain Programming\nUmesh Chandra Gupta | Professor | Queueing Theory; Statistics; Stochastic Modelling\nSomnath Bhattacharyya | Professor, Head of the Department | Computational Fluid Dynamics; Micro-/nanofluidics Modeling\nDebjani Chakraborty | Associate Professor | Fuzzy logic and its applications; Fuzzy Optimization\nAdrijit Goswami | Professor | Operations Research and Theoretical Computer Science\nDharmendra Kumar Gupta | Professor | Constraint Satisfaction Problems; Numerical Analysis and Computer Science\nVinay Kumar Jain | Professor | Zeros of polynomials and analytic functions & Extremal problems of polynomials\nSomesh Kumar | Professor | Entropy Estimation; Estimation Theory; Estimation under Constraints; Experimental Designs; Quantum Information and Computation; Reliability Estimation; Statistical Data Analysis; Statistical Decision Theory\nRajnikant Pandey | Professor\nRaja Sekhar G P | Professor | Boundary integral methods for viscous flows; Mass transfer in porous biologocal pellets\nAnjan Sarkar | Professor | Probabilistic Robotics; Remote Sensing Image Analysis; Statistics\nParmeshwary Dayal Srivastava | Professor | Functional Analysis & Cryptography; Fuzzy Sequence Space\nBhawani Sankar Panda | Professor | Algorithmic Graph Theory, Graph Theory, Combinatorial Optimization, Algorithms\nBappaditya Bhowmik | Assistant Professor | Geometric function theory (Complex Analysis); Harmonic and Quasiconformal Mappings; Several Complex Variables\nVasudeva Rao Allu | Assistant Professor | Complex Analysis; Harmonic Mappings (in the Plane); Univalent Function Theory\nDebapriya Biswas | Assistant Professor\nAsish Ganguly | Assistant Professor | Mathematical & Theoretical Physics; Non-linear Evolution Equation in Real & Complex Domain; Quantum Mechanics; Soliton Theory and Inverse Scattering Transformation\nRupanwita Gayen | Assistant Professor | Integral equations; Linear water waves\nKoeli Ghoshal | Assistant Professor | Grain-size distribution in suspension over erodible sediment bed; Mathematical Modelling on turbulent flow with sediment; Study on secondary current\nNitin Gupta | Assistant Professor | Mathematical Statistics; Reliability Theory\nJitendra Kumar | Assistant Professor | Numerical mathematics; Numerical solutions of integro-partial differential equations; Particle Technology\nPawan Kumar | Associate Professor | Graph Theory\nSourav Mukhopadhyay | Assistant Professor | Algebric attack on stream ciphers; Cryptanalysis on symmetric cipher; Digital rights management; Key management in wireless adhoc network; Key Pre-Distribution (KPS) in sensor network\nGeetanjali Panda | Associate Professor | Convex Optimization; Numerical Optimization; Optimization with uncertainty\nChandal Nahak | Associate Professor | Algebra; Applied Functional Analysis and Optimization; Fractional Calculus; Numerical Optimization\nGnaneshwar Nelakanti | Associate Professor | Approximate solutions of operator equations; Inverse and ill-posed problems; Spectral approximation of integral operators\nPratima Panigrahi | Associate Professor | Combinatorics; Graph Theory\nT. Raja Sekhar | Assistant Professor | Hyperbolic System of Conservation Laws; Lie Group Analysis for Quasilinear Hyperbolic System of Partial Differential Equations\nSwanand Ravindra Khare | Assistant Professor | Numerical Linear Algebra, Chemometrics", "page": "Mathematics"}, {"chunk_id": "a0be61d5", "title": "References", "text": "1. https://iitkgp.ac.in/navpage/academics\n2. http://www.iitkgp.ac.in/academics/?page=acadunits&&dept=MM |}", "page": "Mathematics"}]