[{"chunk_id": "info_0db626", "title": "ME10001: Mechanics - Quick Facts", "text": "ME10001\nCourse name | Mechanics\nOffered by | Mechanical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n1318 151 81 41 11 47 EX A B C D P F | 1318 | 1318 | 151 | 151 | 81 | 81 | 41 | 41 | 11 | 11 | 47 | 47 | EX | A | B | C | D | P | F\n1318 | 1318 | 151 | 151 | 81 | 81 | 41 | 41 | 11 | 11 | 47 | 47\n1318\n151\n81\n41\n11\n47\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "ME10001: Mechanics"}, {"chunk_id": "af4b68cb", "title": "Syllabus mentioned in ERP", "text": "Force systems : Moment of a force about a point and about an axis; couple moment; reduction of a force system to a force and a couple. Equilibrium : Free body diagram; equations of equilibrium; problems in two and three dimensions; plane frames and trusses. Friction : Laws of Coulomb friction., problems involving large and small contact surfaces; square threaded screws; belt friction; rolling resistance. Kinematics and Kinetics of particles : Particle dynamics in rectangular coordinates cylindrical coordinates and in terms of path variables; central force motion. Properties of areas : Moments of inertia and product of inertia of areas, polar moment of inertia, principal axes and principal moments of inertia. Concept of stress and strain : Normal stress, shear stress, state of stress at a point, ultimate strength, allowable stress, factor of safety; normal strain, shear strain, Hooke’s law, Poisson’s ratio, generalized Hooke’s law; analysis of axially loaded members. Torsion : Torsion of cylindrical bars, torsional stress, modulus of rigidity and deformation. Flexural loading : Shear and moment in beams; load, shear and moment relationship; shear and moment diagrams; flexure formula; shear stress in beams; differential equation of the elastic curve, deflection of beams. Transformation of stress and strain : Transformation of stress and strain, principal stresses, principal strains, Mohr’s circle for stress and strain. Combined loading : Axial and torsional; axial and bending; axial, torsional and bending. Column : Buckling of slender columns, Euler bucking load for different end conditions.", "page": "ME10001: Mechanics"}, {"chunk_id": "73d369e7", "title": "Concepts taught in class", "text": "Relative grading\n2 class tests for TA marks\nWorksheet Type Question Paper cum Answer Script\nPre-Midsem portion doesn't come in Endsem.\nPre-Midsem portion:\n1. Coordinate Systems\n2. 2D and 3D equilibrium problems involving: Force systems : Moment of a force about a point and about an axis; couple moment; reduction of a force system to a force and a couple. Equilibrium : Free body diagram; equations of equilibrium;\n3. Plane frames and Trusses\n4. Coulomb Friction (JEE TYPE includes rolling, slipping) and Belt friction\nPost-Midsem Portion:\n1. Polar moment of inertia, principal axes and principal moments of inertia\n2.Concept of stress and strain : Normal stress, shear stress, state of stress at a point, ultimate strength, allowable stress, factor of safety; normal strain, shear strain, Hooke’s law, Poisson’s ratio, generalized Hooke’s law; analysis of axially loaded members.\n3.Torsion : Torsion of cylindrical bars, torsional stress, modulus of rigidity and deformation\n4. Flexural loading : Shear and moment in beams; load, shear and moment relationship; shear and moment diagrams\n5.Transformation of stress and strain : Transformation of stress and strain, principal stresses, principal strains, Mohr’s circle for stress and strain, Thin pressure vessels", "page": "ME10001: Mechanics"}, {"chunk_id": "ee2c41b4", "title": "Student Opinion", "text": "An easy subject where you can secure high grades with little practise and good understanding of concepts. Generally good professors are assigned in this course, so they explain you much nicely that the only thing you need to do back in hostel is solve a selected number of problems and the Previous Year Papers. If thats not the case with you I would recommend you to watch JEFF HANSON videos on Youtube: https://www.youtube.com/user/1234jhanson\nBe ready for step marking, so even if your answer is wrong you get credits for your procedure.\nAnd do solve problems from books: Merriem Kraige Statics http://aghababaie.usc.ac.ir/files/1506464236211.pdf and Beer Johnston Material MEchanics: http://www.hljp.edu.cn/attachment/20120820084627006.pdf and Statics : https://mechzoneblog.files.wordpress.com/2017/08/statics-and-mechanics-of-materials.pdf", "page": "ME10001: Mechanics"}, {"chunk_id": "e061e80d", "title": "Additional Resources", "text": "Instiinfo Repository", "page": "ME10001: Mechanics"}]