[{"chunk_id": "info_c73db6", "title": "ME19001: Introduction To Manufacturing Processes - Quick Facts", "text": "ME19001\nCourse name | Introduction To Manufacturing Processes\nOffered by | Mechanical Engineering\nCredits | 2\nL-T-P | 0-0-3\nPrevious Year Grade Distribution\n50 881 340 29 8 1 5 EX A B C D P F | 50 | 50 | 881 | 881 | 340 | 340 | 29 | 29 | 8 | 8 | 1 | 1 | 5 | 5 | EX | A | B | C | D | P | F\n50 | 50 | 881 | 881 | 340 | 340 | 29 | 29 | 8 | 8 | 1 | 1 | 5 | 5\n50\n881\n340\n29\n8\n1\n5\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "ME19001: Introduction To Manufacturing Processes"}, {"chunk_id": "fbfa26de", "title": "Syllabus mentioned in ERP", "text": "Course Contents Theory Component: Basic concepts and principles of manufacturing Performing Processes: Casting, forging, rolling, drawing, extrusion, press tool work, plastic moulding and powder metallurgy. Joining Processes: Welding, brazing and crimping Semi-finishing and finishing processes: Machining (Turning, shaping, drilling, Milling and grinding). Non-traditional Processes: Abrasive jet machining, Ultrasonic machining, Electro-discharge machining, Electrochemical machining and laser beam machining. Product Quality: Possible defects and their detection, assessment and remedy. Laboratory Component: Suggested Assignments Machining: 1.Introducing to various machine tools and demonstration on machining 2.Making a steel pin as per drawing by machining in centre lathe 3.External screw thread by single point chasing in lathe 4.Making a cast iron Vee block by shaping 5.Making a regular polygon prism (MS) by milling 6.Making a gauge as per drawing 7.Study of machining in machining in machining centre (CNC) and Electro discharge machining (EDM) Foundry Practice: 8.Orientation, demonstration and practice on metal casting 9.Practicing sand moulding using split and uneven parting line pattern 10.Practice on CO2 moulding and machine moulding 11.Mechanised sand preparation and melting practice Welding Practice: 12Practice on Oxy-acetylene gas welding and manual metal arc welding (running bead) 13.Practice on oxy-acetylene gas cutting and arc welding for butt welding 14.Introduction and demonstration on submerged arc welding and plasma spray coating Metal Forming: 15.Demonstration of deep drawing process", "page": "ME19001: Introduction To Manufacturing Processes"}, {"chunk_id": "667404c3", "title": "Additional Resources", "text": "Instiinfo repository", "page": "ME19001: Introduction To Manufacturing Processes"}]