[{"chunk_id": "info_f406f5", "title": "ME20001: Dynamics - Quick Facts", "text": "ME20001\nCourse name | Dynamics\nOffered by | Mechanical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n5 25 40 43 27 28 10 EX A B C D P F | 5 | 5 | 25 | 25 | 40 | 40 | 43 | 43 | 27 | 27 | 28 | 28 | 10 | 10 | EX | A | B | C | D | P | F\n5 | 5 | 25 | 25 | 40 | 40 | 43 | 43 | 27 | 27 | 28 | 28 | 10 | 10\n5\n25\n40\n43\n27\n28\n10\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "ME20001: Dynamics"}, {"chunk_id": "702020da", "title": "Syllabus mentioned in ERP", "text": "Kinematics of particles: representation of motion of particles in various coordinate systems, relative motion in translating frames, constrained motion. Kinetics of particles: Concept of an inertial frame and Newtons second law, equations of motion for unconstrained and constrained motion, work-energy relation, conservation of energy, conservative and non-conservative forces, potential energy, impulse-momentum relation, angular momentum, conservation of momentum, dAlemberts principle. Applications: central force motion, impact. Kinetics of a system of particles: Newtons second law, work-energy relation, impulse-momentum relations, conservation laws, steady and variable mass flow systems. Plane kinematics of rigid bodies: Kinematics of rigid bodies, instantaneous center of rotation, kinematics in rotating frames and relative motion. Plane kinetics of rigid bodies: Linear and angular momentum, equations of motion, work-energy relation, impulse-momentum relation, conservation laws. Introduction to spatial dynamics of rigid bodies: Kinematics in rotating frames and relative motion, angular momentum, kinetic energy, equations of motion, special cases of parallel-plane motion, and gyroscopic motion.", "page": "ME20001: Dynamics"}, {"chunk_id": "a29c5a9d", "title": "Student Opinion :-", "text": "This course is going to fascinate you if you like mechanics part of JEE. This course covers all those concepts as well as some additional concepts like variable mass, center-force motion, Kinetics of 3-D rigid bodies etc. You can think of this course as a continuation of JEE mechanics. This is also a continuation of mechanics course you did in your 1st year. But those concepts are rarely used here.\nThis course also serve as a prerequisite for further departmental courses like Kinematics of Machines in your fourth semester.", "page": "ME20001: Dynamics"}, {"chunk_id": "af32c8c0", "title": "How to Crack the Paper", "text": "From examination point of view, firstly you should practice the class problems well, as some questions in the exam will be very similar to those already done in the class with some extension or little modifications. You should emphasize on the concepts mainly taught in the class rather than doing more and more questions. Once class questions are done you should do your tutorials for a decent practice. This much work is sufficient but still if you have time you can solve problems from Meriam and Kraige. It's more than enough if you have clarity in your concepts.", "page": "ME20001: Dynamics"}, {"chunk_id": "67aaa4ee", "title": "Books", "text": "1) Meriam and Kraige Volume II\n2) Beer and Johnston", "page": "ME20001: Dynamics"}, {"chunk_id": "31d0756c", "title": "Additional Resources", "text": "14ME Batch Course Repository", "page": "ME20001: Dynamics"}, {"chunk_id": "9154952c", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | NR421\nThursday | NR421\nFriday | NR421 | NR421", "page": "ME20001: Dynamics"}]