[{"chunk_id": "info_6e1ee2", "title": "ME21101: Fluid Mechanics - Quick Facts", "text": "ME21101\nCourse name | Fluid Mechanics\nOffered by | Mechanical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n21 37 31 34 33 57 13 EX A B C D P F | 21 | 21 | 37 | 37 | 31 | 31 | 34 | 34 | 33 | 33 | 57 | 57 | 13 | 13 | EX | A | B | C | D | P | F\n21 | 21 | 37 | 37 | 31 | 31 | 34 | 34 | 33 | 33 | 57 | 57 | 13 | 13\n21\n37\n31\n34\n33\n57\n13\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "ME21101: Fluid Mechanics"}, {"chunk_id": "060128ac", "title": "Syllabus mentioned in ERP", "text": "Introduction - properties of fluids, concept of continuum, pressure and stress tensor Fluid statics - pressure variation in a static fluid, force on submerged surfaces,stability of floating bodies Kinematics - Lagrangian and Eulerian description, streamline, streakline and pathline, acceleration of a fluid element, continuity equation, streamfunction,rotation and angular deformation, irrotational flow, velocity potential Inviscid flow - Euler equation, Bernoullis equation and its applications Reynolds transport theorem - conservation of mass, linear and angular momentum Stokes law of viscosity and Navier-Stokes equations - some exact solutions Dimensional analysis and similarity - Buckingham Pi theorem Internal flows - pipe flow, friction factor, Moody diagram, minor and major losses, pipe networks, hydraulic diameter External flows - boundary layer approximation, momentum integral method, flow over a flat plate, flow separation Turbulence - Reynolds experiment, Reynolds decomposition, time averaged NavierStokes equation, eddy viscosity Potential Flow - elementary plane flow solutions, Magnus effect Fluid Machinery - similarity, Euler equation for turbomachines, centrifugal pump, hydraulic turbines, cavitation", "page": "ME21101: Fluid Mechanics"}, {"chunk_id": "59c19925", "title": "Student Opinion:-", "text": "It is a very interesting course. It's not very hard to understand it's concepts and solve problems. You can practice problems from a number of books like Fox and McDonald, Som and Biswas etc. But you even not need to do problems from books if you get tutorials in the class.\nIt also serve as a prerequisite for heat transfer course in your 5th semester.", "page": "ME21101: Fluid Mechanics"}, {"chunk_id": "429b5fb3", "title": "Books:-", "text": "1) Fox and McDonald\n2) Som and Biswas\n3) Kundu and Kohen\n4) Cengel and Cimbala", "page": "ME21101: Fluid Mechanics"}, {"chunk_id": "9fdf1f0b", "title": "How to Crack the Paper", "text": "For exam,firstly you should have confidence in your basic concepts. You should try to complete your tutorials and class problems for a decent practice. For more questions, you can refer above mentioned books. But the exam wouldn't have, generally, hard questions. You just need clarity in your concepts and a decent practice to solve questions in the exam.", "page": "ME21101: Fluid Mechanics"}, {"chunk_id": "03fea1c9", "title": "Additional Resources", "text": "14ME Batch Course Repository", "page": "ME21101: Fluid Mechanics"}, {"chunk_id": "5497300b", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | NC244,NC242,NC243,NC241\nThursday | NC244,NC242,NC243,NC241\nFriday | NC244,NC242,NC243,NC241 | NC244,NC242,NC243,NC241", "page": "ME21101: Fluid Mechanics"}]