[{"chunk_id": "info_b3a599", "title": "ME22002: Thermodynamics - Quick Facts", "text": "ME22002\nCourse name | Thermodynamics\nOffered by | Mechanical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n2 13 11 19 31 134 85 EX A B C D P F | 2 | 2 | 13 | 13 | 11 | 11 | 19 | 19 | 31 | 31 | 134 | 134 | 85 | 85 | EX | A | B | C | D | P | F\n2 | 2 | 13 | 13 | 11 | 11 | 19 | 19 | 31 | 31 | 134 | 134 | 85 | 85\n2\n13\n11\n19\n31\n134\n85\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "ME22002: Thermodynamics"}, {"chunk_id": "5bffcd39", "title": "Syllabus mentioned in ERP", "text": "• Introduction: Fundamental Concepts: definitions of system and surrounding,concept of the control volume, thermodynamic state, concepts of simple compressible substances, pure substance and phase, thermodynamic processes and thermodynamic equilibrium; Temperature and Zeroth law; Thermodynamic properties and use of tables of thermodynamic properties; Idea of a generalized chart and the law of corresponding states; Concept of ideal gases and their equations of state; Thermodynamic concept of energy; Modes of work and heat transfer.\n• First Law of Thermodynamics: The first law referred to cyclic and non-cyclic processes, the concept of internal energy of a system, conservation of energy for simple compressible closed systems; Definitions of enthalpy and specific heats; Conservation of energy for an open system or control volume, steady & transient processes.\n• Second Law of Thermodynamics: The directional constraints on natural processes; Formal statements; Concept of reversibility; Carnot principle; Absolute thermodynamic temperature scale; Clausius Inequality, entropy, change in entropy in various thermodynamic processes, Tds relations, an entropy balance for closed and open systems, Principle of increase-in-Entropy, entropy generation.\n• Exergy: Concept of reversible work & irreversibility; Second law efficiency; Exergy change of a system: closed & open systems, exergy transfer by heat, work and mass, exergy destruction, exergy balance in closed & open systems.\n• Thermodynamic Property Relations: Maxwell relations; Clausius-Clapeyron equation; Difference in heat capacities; Ratio of heat capacities; JouleThompson coefficient.\n• Introduction to Properties of Mixtures and Phases: Amagat’s and Dalton’s model, Equation of state and properties of ideal gas mixtures, Change in entropy on mixing; introduction to real-gas mixtures; Gibbs phase rule; Air/Water Mixtures, Psychrometrics.\n• Thermodynamics of Reactive Systems: First law analysis; Internal energy and enthalpy of reaction; Enthalpy of formation; Second law analysis; chemical equilibrium; equilibrium constant for ideal-gas mixtures and its variation with temperature.\n• Air Standard Cycles: Carnot, Stirling, Ericsson, Otto, Diesel, and Dual cycles. Brayton cycle: intercooling, reheating and regeneration.\n• Vapour Cycles: Carnot cycle; Simple Rankine cycle, Techniques for efficiency improvement, Reheat and Regenerative cycles with open & closed feed water heater; Ideal vapour compression refrigeration cycle.", "page": "ME22002: Thermodynamics"}, {"chunk_id": "f1d9fba9", "title": "Concepts taught in class", "text": "Basic concepts, work, heat, first and second law of thermodynamics for both control mass and control volume, entropy, irreversibility, availability, gas mixtures, vapour and gas cycles", "page": "ME22002: Thermodynamics"}, {"chunk_id": "aa380bda", "title": "Student Opinion", "text": "In my opinion start studying this course from the beginning itself. It requires heavy to super heavy effort. The concept is relatively easy to understand. The challenge is to solve the questions. Practice solving questions using both EES and the tables. The exam will involve the usage of heavy interpolations. So, dexterity in the usage of calculators is a must.\nLot of new concepts are taught which are practically applicable. This is a very important course.", "page": "ME22002: Thermodynamics"}, {"chunk_id": "f53c524c", "title": "How to Crack the Paper", "text": "Book to refer: Fundamentals of Thermodynamics Slides by prof.S Mitra The above to resources are very good. One needs to put lot of effort in this course.", "page": "ME22002: Thermodynamics"}, {"chunk_id": "fc6d3e48", "title": "Classroom resources", "text": "All the tutorials from the Spring'17 class can be downloaded from here . And the lecture slides can be found here .", "page": "ME22002: Thermodynamics"}, {"chunk_id": "0a010e31", "title": "Additional Resources", "text": "14ME Batch Course Repository", "page": "ME22002: Thermodynamics"}]