[{"chunk_id": "info_166b8b", "title": "ME29701: Workshop Process-Ii - Quick Facts", "text": "ME29701\nCourse name | Workshop Process-Ii\nOffered by | Mechanical Engineering\nCredits | 2\nL-T-P | 0-0-3\nPrevious Year Grade Distribution\n25 168 33 2 1 EX A B C D P F | 25 | 25 | 168 | 168 | 33 | 33 | 2 | 2 | 1 | 1 | EX | A | B | C | D | P | F\n25 | 25 | 168 | 168 | 33 | 33 | 2 | 2 | 1 | 1\n25\n168\n33\n2\n1\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "ME29701: Workshop Process-Ii"}, {"chunk_id": "24273394", "title": "Syllabus mentioned in ERP", "text": "Workshop Processes – 2 Prerequisite – Introduction to Engineering Practice or Equivalent Selected jobs for practicing: Machining: facing, drilling, boring, turning-straight, taper, eccentric, grooving, thread cutting, forming etc. in centre lathes surfacing, making regular polygons and cutting gear teeth in milling machines gear teeth generation in gear shaping machine and hobbing machine part programming and machining in CNC machining center setting and operation of EDM finishing by grinding Measurement of dimensions, forms and surface finish of machined products. Foundry Technology: The practice-cum-experiments to impart an understanding on the various steps in metal casting including pattern design, sand preparation, moulding and melting: (a) Study on various types of patterns and pattern materials (b) Layout of a pattern (a) Study on sand preparation (b) Study on variation of mould properties with different moulding machines Study on the effect of moulding parameters on the properties of moulds Study of melting furnace and melting of aluminium alloys including degasification. Welding: Practical classes designed with the objective of imparting hands on training as well as understanding of welding technology. Suggested exercises are: Understanding of welding machine characteristics and controls, electrode specifications, selection of electrode size and current, laying of beads. Study of joint configuration and specification, required edge preparations; practice on preparing both side square groove butt weld; grinding of weld crown to make bead flush with plate surface; visual inspection of defects and reporting. Study of various types of oxy-acetylene flames; practice on flame adjustment, gas welding/brazing. Study and practice on submerged arc welding/ MIG welding.", "page": "ME29701: Workshop Process-Ii"}, {"chunk_id": "941cc185", "title": "Additional Resources", "text": "14ME Batch Course Repository", "page": "ME29701: Workshop Process-Ii"}, {"chunk_id": "1f5e0cd5", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday\nThursday | In Dept\nFriday | In Dept", "page": "ME29701: Workshop Process-Ii"}]