[{"chunk_id": "info_574c78", "title": "ME30005: Heat Transfer - Quick Facts", "text": "ME30005\nCourse name | Heat Transfer\nOffered by | Mechanical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n12 21 22 49 25 30 7 EX A B C D P F | 12 | 12 | 21 | 21 | 22 | 22 | 49 | 49 | 25 | 25 | 30 | 30 | 7 | 7 | EX | A | B | C | D | P | F\n12 | 12 | 21 | 21 | 22 | 22 | 49 | 49 | 25 | 25 | 30 | 30 | 7 | 7\n12\n21\n22\n49\n25\n30\n7\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "ME30005: Heat Transfer"}, {"chunk_id": "f08e7889", "title": "Syllabus mentioned in ERP", "text": "Heat Transfer Prerequisite â (Fluid Mechanics, Thermodynamics) or Thermo-fluid Sc.Introduction, Modes of heat transfer, thermal conductivity, combined modes of heat transfer, concept of thermal contact resistance. Derivation of heat conduction equation, steady state one-dimensional heat conduction with and without generation of heat in simple geometries : plane wall, cylindrical and spherical walls, critical thickness of insulation, heat transfer from extended surfaces, 2D steady state heat conduction Unsteady conduction: lumped heatcapacity system, transient heat conduction in infinite and semi-infinite walls, concept of Heisler chart and Schmidt plot, heat conduction from a moving heat source. Forced convection: Derivation of energy equation, concept of thermal boundary layer and derivation of thermal boundary layer equation, flat plate in parallel flow (solution by energy integral method), cylinder in cross flow, internal flows: concept of thermally fully developed flow and its corollaries, fully developed pipe flow, fully developed channel flow with constant wall heat flux and viscous dissipation, turbulent flow in pipes, Reynolds analogy. Free convection: Vertical plate at constant temperature â derivation of governing equation, recognition of dimensionless terms, and solution by integral method, free convection in vertical channel. Condensation and Boiling: laminar film condensation over a vertical plate and horizontal circular tube. regimes of boiling heat transfer, correlations for heat flux in boiling. Heat exchangers: classification of heat exchangers, overall heat transfer coefficient, concept of fouling factor, LMTD and NTU methods of analysis for a double pipe heat exchanger, applications to multi-tube, multi-pass heat exchangers. Thermal radiation: Radiation properties, blackbody radiation, Planckâs law, StefanBoltzman law, Kirchoffâs law, radiation exchange between black surfaces, concept of view factor, radiation exchange between non-black surfaces, twosurface enclosure, three surface enclosure, concept of radiation shield.", "page": "ME30005: Heat Transfer"}, {"chunk_id": "8136a33e", "title": "How to Crack the Paper", "text": "just do it man......... just do it", "page": "ME30005: Heat Transfer"}, {"chunk_id": "5a6a9e90", "title": "Additional Resources", "text": "14ME Batch Course Repository", "page": "ME30005: Heat Transfer"}, {"chunk_id": "66094c74", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NC233,NC234\nTuesday\nWednesday | NC233,NC234 | NC233,NC234\nThursday | NC233,NC234\nFriday", "page": "ME30005: Heat Transfer"}]