[{"chunk_id": "info_718ad1", "title": "ME40506: Engineering Metrology - Quick Facts", "text": "ME40506\nCourse name | Engineering Metrology\nOffered by | Mechanical Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | Spring", "page": "ME40506: Engineering Metrology"}, {"chunk_id": "95059913", "title": "Syllabus mentioned in ERP", "text": "Engineering Metrology Prerequisite ;Machine Tool and MachiningPrecision and Accuracy; Methods of estimating accuracy and precision; Needs for accuracy and precision; Standards and their evolution; Types of errors in measurements. Simple Measurement Tools: Rules, calipers, height gauges, micrometers, depth gauges, combination set, dial indicators, slip gauges, sine bars etc. Limits, Fits and Tolerances, and Gauge Design: Basic concepts in limits, fits and tolerances; Selective assembly; Tolerance grades; ISO system of tolerance; Principles gauge design; Work Shop and Inspection gauges; Gauge Design â Basic design rules for Plug and Ring gauges; Taper Plug Gauges, Taper Ring Gauges; Bore gauge. Interferometers -Types of light sources and Interferometers, Types of scales and gratings, Optical flats, Use of different interferometers for calibration of height standards etc. Screw Thread Measurement: Standard thread profiles, Different Thread Elements, Effective diameter, 2 wire and 3 wire methods as applied to standard and non-standard thread profiles, Best wire size, Virtual Effective Diameter Surface Roughness: Sources of surface irregularities in manufacturing, Different elements of surface roughness, Definition of centre line and related roughness parameters, Measurement Instruments, Profilometers, Analysis of roughness signal in frequency domain, Auto-correlation of surface roughness signals, Use of such analysis in identification of state of health of the manufacturing process Gear Metrology: Different types of gears, Basic elements of a gear, Involute function, Relations between different gear elements of spur and helical gears, Virtual number of teeth, Use of gear tooth vernier for chordal and constant chordal measurements, Span measurement using Base Tangent Micrometers Coordinate Measuring Machines: CMMs, Applications, Types, Constructions, Materials used for different elements, Probing, Hard Probing and Soft probing, Construction and Working Principle of Touch Trigger Probe, Alignment, Programming, Types of errors", "page": "ME40506: Engineering Metrology"}]