[{"chunk_id": "info_5f4e47", "title": "ME60012: Computational Fluid Dynamics - Quick Facts", "text": "ME60012\nCourse name | Computational Fluid Dynamics\nOffered by | Mechanical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n5 4 6 3 1 1 EX A B C D P F | 5 | 5 | 4 | 4 | 6 | 6 | 3 | 3 | 1 | 1 | 1 | 1 | EX | A | B | C | D | P | F\n5 | 5 | 4 | 4 | 6 | 6 | 3 | 3 | 1 | 1 | 1 | 1\n5\n4\n6\n3\n1\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "ME60012: Computational Fluid Dynamics"}, {"chunk_id": "294782dc", "title": "Syllabus mentioned in ERP", "text": "A brief overview of the basic conservation equations for fluid flow and heat transfer, classification of partial differential equations and pertinent physical behaviour, parabolic, elliptic and hyperbolic equations, role of characteristics. Common methods of discretization: an overview of finite difference, finite element and finite volume methods. Numerical solution of parabolic partial differential equations using finite-difference and finitevolume methods: explicit and implicit schemes, consistency, stability and convergence. Numerical solution of systems of linear algebraic equations: general concepts of elimination and iterative methods, Gaussian elimination, LU decomposition, tridiagonal matrix algorithm, Jacobi and Gauss-Seidel iterations, necessary and sufficient conditions for convergence of iterative schemes, gradient search methods, steepest descent and conjugate gradient methods.The finite volume method of discretization for diffusion problems: onedimensional steady diffusion problems, specification of interface diffusivity, source-term linearization. Discretization of transient one-dimensional diffusion problems. Discretization for multi-dimensional diffusion problems. Solution of discretized equations using point and line iterations, strongly implicit methods and pre-conditioned conjugate gradient methods.Convectiondiffusion problems: Central difference, upwind, exponential, hybrid and powerlaw schemes, concept of false diffusion, QUICK scheme.Numerical solution of the Navier-Stokes system for incompressible flows: stream-function vorticity and artificial compressibility methods, requirement of a staggered grid. MAC, SIMPLE, SIMPLEC and SIMPLER algorithms.An introduction to unstructured grid finite volume methods. Special topics: Turbulence and its modeling, phasechange problems, interface/free-surface tracking methods.", "page": "ME60012: Computational Fluid Dynamics"}]