[{"chunk_id": "info_e6b25b", "title": "ME60302: Laser Processing Of Materials - Quick Facts", "text": "ME60302\nCourse name | Laser Processing Of Materials\nOffered by | Mechanical Engineering\nCredits | 4\nL-T-P | 4-0-0\nPrevious Year Grade Distribution\n2 1 2 2 1 EX A B C D P F | 2 | 2 | 1 | 1 | 2 | 2 | 2 | 2 | 1 | 1 | EX | A | B | C | D | P | F\n2 | 2 | 1 | 1 | 2 | 2 | 2 | 2 | 1 | 1\n2\n1\n2\n2\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "ME60302: Laser Processing Of Materials"}, {"chunk_id": "4db7289e", "title": "Syllabus mentioned in ERP", "text": "Main industrial lasers: He-Ne, CO2, Excimer, Nd:YAG, Diode, Fiber and Ultrashort pulse lasers and their output beam characteristics; laser beam delivery systems. Overview of Industrial & Scientific Applications of laser: Metrological applications, Holography, Laser Isotope Separation, Laser fusion. Laser processing fundamentals: Laser beam interaction with metal, semiconductor and insulator, Ultra-short laser pulse interaction, heat flow theory and metallurgical considerations. Laser Material Processing Applications: Laser cutting and drilling: Process characteristics, material removal modes, practical performances. Laser welding: Process mechanisms like keyhole and plasma effect, operating characteristics and process variation. Laser surface modifications: Heat treatment, surface remelting, surface alloying and cladding, surface texturing, LCVD and LPVD. Laser rapid manufacturing. Laser metal forming: Mechanisms involved including thermal temperature gradient, buckling, upsetting. Laser peening: Fundamentals of Laser Shock Processing, Effects of various laser and process parameters, Mechanical effects and microstructure modification during laser shock processing. Theoretical modelling of laser material processing. On-line Process monitoring & control: Laser and process parameters, and workpiece characteristics. Economics of Laser Applications in Manufacturing. Laser Safety: Laser safety standards and safety procedures.", "page": "ME60302: Laser Processing Of Materials"}]