[{"chunk_id": "info_ac9324", "title": "ME60014: Convective Heat And Mass Transfer - Quick Facts", "text": "ME60014\nCourse name | Convective Heat And Mass Transfer\nOffered by | Mechanical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n7 6 14 8 2 3 1 EX A B C D P F | 7 | 7 | 6 | 6 | 14 | 14 | 8 | 8 | 2 | 2 | 3 | 3 | 1 | 1 | EX | A | B | C | D | P | F\n7 | 7 | 6 | 6 | 14 | 14 | 8 | 8 | 2 | 2 | 3 | 3 | 1 | 1\n7\n6\n14\n8\n2\n3\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "ME60014: Convective Heat And Mass Transfer"}, {"chunk_id": "0cf9f086", "title": "Syllabus mentioned in ERP", "text": "Introduction to convection. Derivation of governing equations of momentum, energy and species transport, Order of magnitude analysis, Reynolds analogy. Convective heat transfer in external flows: Derivation of hydrodynamic and thermal boundary layer equations, Similarity solution techniques, Momentum and energy integral methods and their applications in flow over flat plates with low and high Prandtl number approximations.Introduction to turbulence, Reynolds averaging, Eddy viscosity and eddy thermal diffusivity, Laws of the wallConvection in internal flows: Concept of developing and fully developed flows. Thermally developing flows: Graetz problem. Concept of thermally fully developed flow and its consequences under constant wall flux and constant wall temperature conditions, Steady forced convection in Hagen Poiseuille flow, Plane Poiseuille flow, and Couette flow and analytical evaluation of Nusselt numbers in limiting cases. Free convection: Free convection boundary layer equations: order of magnitude analysis, similarity and series solutions, Concept of thermal stability and Rayleigh Benard convection. Concept of boiling heat transfer and regimes in pool boilingCondensation: Nusselt film condensation theory, dropwise condensation and condensation inside tubes, effects of non-condensablesDeviations from continuum: wall slip and thermal creep, an introduction to convective transport in micro-scalesConjugate problems and moving boundary freezing and melting problems.An introduction to convective mass transfer in binary systems: analytical solutions to simple onedimensional problems", "page": "ME60014: Convective Heat And Mass Transfer"}]