[{"chunk_id": "info_93d68f", "title": "ME60148: Engineering Mechanics - Quick Facts", "text": "ME60148\nCourse name | ENGINEERING MECHANICS\nOffered by | Mechanical Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | {{{semester}}}", "page": "ME60148: Engineering Mechanics"}, {"chunk_id": "e7ea0e5e", "title": "Syllabus mentioned in ERP", "text": "Force Systems: Moment of a force about a point and about an axis; couple moment; reduction of a force system to a force and a couple. Equilibrium: Free body diagram; equations of equilibrium; problems in two and three dimensions; plane frames and trusses. Friction: Laws of Coulomb friction; problems involving large and small contact surfaces; square treaded screws; belt friction; rolling resistance. Kinematics and Kinetics of particles: Particle dynamics in rectangular coordinates cylindrical coordinates and in terms of path variables; central force motion. Properties of areas: Moments of inertia and product of inertia of areas, polar moment of inertia, principal axes and principal moments of inertia. Concept of stress and strain: Normal stress, shear stress, state of stress at a point, ultimate strength, allowable stress, factor of safety; normal strain, shear strain, Hookes law, Poissons ratio, generalized Hookes law; analysis of axially loaded members. Torsion: Torsion of cylindrical bars, torsional stress and modulus of rigidity and deformation. Flexural loading : Shear and moment in beams; load, shear and moment relationships; shear and moment diagrams; flexure formula; shear stress in beams; different equation of the elastic curve, deflection of beams. Transformation of stress and strain: Transformation of stress and strain, principal stresses, principal strains, Mohrs circle for stress and strain. Combined loading: Axial and torsional; axial and bending; axial, torsional and bending. Column: Buckling of slender columns, Euler bucking load for different end conditions. Fluid Mechanics: Pressure, manometers, forces on plane surface, control volume, mass conservation, momentum theorem. Bernoullis equation Hagen – Poiseuille Flow, Flow of Non-Newtonian fluids in pipes.", "page": "ME60148: Engineering Mechanics"}]