[{"chunk_id": "info_b1e622", "title": "ME60011: Fluid Mechanics - Quick Facts", "text": "ME60011\nCourse name | FLUID MECHANICS\nOffered by | Mechanical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n1 1 EX A B C D P F | 1 | 1 | 1 | 1 | EX | A | B | C | D | P | F\n1 | 1 | 1 | 1\n1\n1\nEX | A | B | C | D | P | F\nSemester | {{{semester}}}", "page": "ME60011: Fluid Mechanics"}, {"chunk_id": "fd7306bd", "title": "Syllabus mentioned in ERP", "text": "Concept of continuum and definition of a fluid. Body and surface forces, stress tensor, principle of local stress equilibrium. Scalar and vector fields, Eulerian and Lagrangian description of flow. Motion of fluid elementtranslation, rotation and deformation; vorticity and strain-rate tensors. Continuity equation, Cauchys equations of motion, Transport theorems. Constitutive equations-Stokes law of viscosity. Derivation of Navier-Stokes equations for compressible flow. Exact solutions of Navier-Stokes equations: plane Poiseuille flow and Couette flow, Hagen-Poiseuille flow, flow between two concentric rotating cylinders, Stokes first and second problems, Hiemenz stagnation-point flow, flow near a rotating disk, flow in convergent-divergent channels. Slow viscous flow: Stokes and Oseens approximation, theory of hydrodynamic lubrication. Boundary layer: derivation, exact solutions, Blasius, Falkner Skan, series solution and numerical solutions. Approximate methods. Momentum integral method. Two dimensional and axisymmetric jets. Introduction to hydrodynamic stability, Orr-Sommerfeld equation, neutral curve of linear stability for plane Poiseuille flow. Description of turbulent flow, velocity correlations, Reynolds stresses. Equations for turbulence kinetic energy and kinetic energy of mean flow. Eddy viscosity models of turbulence: zeroequation, one-equation and two-equation models. Prandtls Mixing Length Theory. Empirical laws: law of the wall, velocity defect law, universal velocity distribution.", "page": "ME60011: Fluid Mechanics"}, {"chunk_id": "ad52a3af", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NC234\nTuesday | NC234 | NC234\nWednesday\nThursday | NC234\nFriday", "page": "ME60011: Fluid Mechanics"}]