[{"chunk_id": "info_4da87a", "title": "ME60352: Robotics - Quick Facts", "text": "ME60352\nCourse name | Robotics\nOffered by | Mechanical Engineering\nCredits | 4\nL-T-P | 4-0-0\nPrevious Year Grade Distribution\n1 EX A B C D P F | 1 | 1 | EX | A | B | C | D | P | F\n1 | 1\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "ME60352: Robotics"}, {"chunk_id": "38d97968", "title": "Syllabus mentioned in ERP", "text": "Robotics Introduction to Robotics: Definitions, motivation, historical development, basic structure, classification, workspace, grippers, specifications Robot Arm Kinematics and Dynamics: Frame transformation, D-H parameters, Forward kinematics, Inverse kinematics, Lagrange formulation Trajectory Generation: Cartesian scheme, Joint space scheme Teaching Methods: Manual teaching, Lead-through teaching, VAL programming Sensing: Range sensing, proximity sensing, touch sensors, force and torque sensing Robot Vision: Low-level vision, Higher-level vision Control Schemes: Position control, force control, hybrid position and force control Motion Planning: Traditional and non-traditional techniques", "page": "ME60352: Robotics"}, {"chunk_id": "c60b95bd", "title": "Student Opinion", "text": "As a student, I have found that studying Robotics through NPTEL is far more beneficial than in a traditional classroom setting. The NPTEL platform provides access to high-quality video lectures by experienced professors from the top engineering institutions in India. These video lectures are incredibly detailed and provide a strong foundation for understanding the theoretical aspects of Robotics.", "page": "ME60352: Robotics"}, {"chunk_id": "eb8767ab", "title": "Classroom resources", "text": "Completely available on NPTEL - https://www.youtube.com/watch?v=rYWJdZ5qg6M&list=PLbRMhDVUMngcdUbBySzyzcPiFTYWr4rV_", "page": "ME60352: Robotics"}, {"chunk_id": "a35c7c2a", "title": "Additional Resources", "text": "Fundamentals of Robotics by DK Pratihar\nRobotics by Fu, Gonzalez and Lee\nIntroduction to Robotics by Craig", "page": "ME60352: Robotics"}]