[{"chunk_id": "info_ae0438", "title": "ME60309: Mathematical Methods In Thermal Engineering - Quick Facts", "text": "ME60309\nCourse name | Mathematical Methods In Thermal Engineering\nOffered by | Mechanical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n1 2 1 EX A B C D P F | 1 | 1 | 2 | 2 | 1 | 1 | EX | A | B | C | D | P | F\n1 | 1 | 2 | 2 | 1 | 1\n1\n2\n1\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "ME60309: Mathematical Methods In Thermal Engineering"}, {"chunk_id": "fed5ed3a", "title": "Syllabus mentioned in ERP", "text": "Linear Algebra: Vector space, Norms of vectors and matrices, Condition number of matrices, Singular value decomposition, Backward error analysis, Concept of linear dependence and independence, Characteristics of linear systems, Eigen values and eigenvectors. Calculus: Functions of single variable, Limit, continuity and differentiability, Mean value theorems, Evaluation of definite and improper integrals, Differentiation under integral sign (Leibnitz rule), Partial derivatives, Total derivative, Maxima and minima, Vector operators and identities, Directional derivatives, Line, surface and volume integrals, Stokes, Gauss and Greens theorems, Introduction to calculus of variations, Transform calculus: Fourier and Laplace transforms Differential equations: Concept of order and degree of differential equations, First order equations (linear and nonlinear), Higher order linear differential equations with constant coefficients, Strum Louiville problems, Initial and boundary value problems, Concept of well-posed and ill-posed equations, Classification of PDEs and their characteristics, Parabolic, elliptic and hyperbolic prototype equations Complex variables: Analytic functions, Cauchys integral theorem, Conformal mapping. Probability and Statistics: Fundamental definition, Conditional probability and Bayes theorem, Mean, median, mode and standard deviation, Random variables, Poisson, Normal and Binomial distributions, Regression analysis, Elements of sampling theory. Numerical Methods: Floating point operations and errors, Interpolation, Root finding of linear and non-linear algebraic equations, Numerical differentiation, Numerical integration, Numerical solution of ODEs: initial and boundary value problems; Numerical instability. Introduction to Cartesian tensors.", "page": "ME60309: Mathematical Methods In Thermal Engineering"}, {"chunk_id": "c8fe2440", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | ME308\nTuesday\nWednesday | ME308\nThursday | ME308\nFriday", "page": "ME60309: Mathematical Methods In Thermal Engineering"}]