[{"chunk_id": "info_909938", "title": "ME60306: Precision And Micro Manufacturing - Quick Facts", "text": "ME60306\nCourse name | Precision And Micro Manufacturing\nOffered by | Mechanical Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n1 2 1 EX A B C D P F | 1 | 1 | 2 | 2 | 1 | 1 | EX | A | B | C | D | P | F\n1 | 1 | 2 | 2 | 1 | 1\n1\n2\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "ME60306: Precision And Micro Manufacturing"}, {"chunk_id": "1d8f1181", "title": "Syllabus mentioned in ERP", "text": "INTRODUCTION: basic definition, size scales, scaling analysis, technology change, Lithographic Processes- Optical and X-ray. PRECISION ENGINEERING AND PRACTICES: Definitions, Sources Of Error, Basic Concepts Of Machining, Machine Tool Variables- accuracy, stiffness, spindle vibration, flatness, straightness, and smoothness of motion, 1-2 DOF systems, Feedback Variables, Cutting Tool Variables, Workpiece Variables, Environment Effects and Thermal Errors. INTRODUCTION TO MACHINING ANALYSIS: geometry of Cutting Edge, Energy Models, Comparison with Micro-scale Machining. DIAMOND MICROMACHINING: Introduction, Diamond as a Tool Material, Compatible Materials, Diamond Performance, Diamond Machining, Micro-mechanical Applications, Diamond Machining as a Micro-mechanical Process Research Method, Ductile Regime Grinding MICRO-ECM, MICRO-EDM etc. MICROMILLING: Micro-milling Tools, Process Results and Micro-milling Applications- micro-mechanically milled X-ray masks, micro-milled mask materials, Mask Absorption Quantification, Exposure Quantification. MICRODRILLING: Micro-drilling and Macro-drilling Techniques. LASER MICROMACHINING: laser Optics, Laser Ablation, Heat Affected Zone and Laser Polymerisation. LIGA, S-LIGA Micro welding: Micro welding in similar and dissimilar materials; welding processes like ultrasonic, EB, LB; applications. Micro casting: Casting processes like vacuum, semi-solid state; applications Processing of Integrated Circuits, Clean rooms, crystal growing and shaping of wafers, Etching, Photo and other lithography techniques, Impurity introduction, Thermal oxidation, CVD, Metallisation etc. IC packaging", "page": "ME60306: Precision And Micro Manufacturing"}]