[{"chunk_id": "info_3627ac", "title": "ME61003: Advanced Fluid Mechanics - Quick Facts", "text": "ME61003\nCourse name | Advanced Fluid Mechanics\nOffered by | Mechanical Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n11 7 8 3 1 EX A B C D P F | 11 | 11 | 7 | 7 | 8 | 8 | 3 | 3 | 1 | 1 | EX | A | B | C | D | P | F\n11 | 11 | 7 | 7 | 8 | 8 | 3 | 3 | 1 | 1\n11\n7\n8\n3\n1\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "ME61003: Advanced Fluid Mechanics"}, {"chunk_id": "fadbc58b", "title": "Syllabus mentioned in ERP", "text": "Concept of continuum and definition of a fluid. Body and surface forces, stress tensor. Scalar and vector fields, Eulerian and Lagrangian description of flow. Motion of fluid element ; translation, rotation and vorticity; strain rate tensor, continuity equation, stream function and velocity potential. Constitutive equations, derivation of Navier;Stokes equations. Exact solutions of Navier;Stokes equations: plane Poiseuille flow and Couette flow, Hagen;Poiseuille flow, flow between two concertic rotating cylinders, Stokes first and second problem, Hiemenz flow, flow near a rotating disk, flow in convergent-divergent channels. Slow viscous flow: Stokes and Oseen s approximation, theory of hydrodynamic lubrication. Thin-film equations. Boundary layer: derivation, exact solutions, Blasius, Falkner Skan, series solution and numerical solutions. Approximate methods. Momentum integral method. Two dimensional and axisymmetric jets. Introduction to Hydrodynamic stability: linear stability of plane Poiseuille flow, Orr;Sommerfeld equation. Description of turbulent flow, velocity correlations, Reynolds stresses, Prandtl s Mixing Length Theory, Karman s velocity defect law, universal velocity distribution. Concepts of closure model, eddy viscosity models of turbulence- zero equation, one equation and two-equation models.", "page": "ME61003: Advanced Fluid Mechanics"}, {"chunk_id": "cc278c80", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NC234\nTuesday | NC234 | NC234\nWednesday\nThursday | NC234\nFriday", "page": "ME61003: Advanced Fluid Mechanics"}]