[{"chunk_id": "info_f9bc56", "title": "MI21007: Elements Of Rock Mechanics - Quick Facts", "text": "MI21007\nCourse name | Elements Of Rock Mechanics\nOffered by | Mining Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n8 9 16 27 6 EX A B C D P F | 8 | 8 | 9 | 9 | 16 | 16 | 27 | 27 | 6 | 6 | EX | A | B | C | D | P | F\n8 | 8 | 9 | 9 | 16 | 16 | 27 | 27 | 6 | 6\n8\n9\n16\n27\n6\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "MI21007: Elements Of Rock Mechanics"}, {"chunk_id": "1b902e25", "title": "Syllabus mentioned in ERP", "text": "Physico-mechanical properties of rocks; Elastic and time dependent behaviour; Rock mass classification; Theories of rock failure; Stress analysis; Insitu stresses and stress distribution around mine openings; Ground failure and pressure on supports; Stability of wide openings; Design of supports in mine workings; Subsidence: Causes and impacts of subsidence; mechanics of surface subsidence , discontinuous and continuous subsidence; monitoring, prediction, control and management of subsidence; Mechanics of rock burst and bumps; Stability of slopes; Instrumentation and measurement of insitu stresses and rock strength; Photoelasticity and scale model studies; Basics of numerical methods in geomechanics with applications.", "page": "MI21007: Elements Of Rock Mechanics"}, {"chunk_id": "404ff6ca", "title": "How to Crack the Paper", "text": "Key to crack this paper is to know the exact syllabus so go to the class daily...Try not to miss them as professors will tell you exactly what to study for the exam, so it is necessary to make your own hand-notes for this subject. If you have missed classes then try to get notes from your friends.", "page": "MI21007: Elements Of Rock Mechanics"}, {"chunk_id": "cbc48031", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | NC341\nThursday | NC341\nFriday | NC341 | NC341", "page": "MI21007: Elements Of Rock Mechanics"}]