[{"chunk_id": "5d9dbcfd", "title": "Minor", "text": "From the THIRD semester onwards the curriculum offers scope for a student to opt for Additional subjects apart from the regular curriculum. A department would offer a MINOR in a discipline in which it offers a major.\nMinor curricula details of all DEPARTMENT : https://erp.iitkgp.ac.in/MinorCurricula.pdf", "page": "Minor"}, {"chunk_id": "0e37c598", "title": "Minor Degree in other Discipline", "text": "• The department would enlist a set of subjects from its curriculum and prescribe a requirement for minor taking six subjects or more (18-24 contact hours plus 3-9 hours of laboratory) from this set. The subjects would be a combination of mostly core and some electives.\n• Students aspiring for a Minor in a discipline must register for the same in the beginning of the 5th semester. Only those students, who have a CGPA of 7.5 or above, without any Backlog, will be permitted to register for a Minor. An SGPA or CGPA in excess of 8.0 has to be maintained in the subsequent semesters without any Backlog in order to keep the Minor registration active. Should both the SGPA and CGPA fall below 8.0 at any point after registering for the minor; the Minor registration will cease to be active.\n• A student registered for Minor in a discipline must register and pass in all subjects that constitute the requirement for a minor and score a minimum grade point average of 6.00 to be awarded a Minor in that discipline.\n• A student may cover these six subjects as either a depth subject, elective subject or a breadth subject or as additional credits. However, he/she has to take at least three subjects as additional credits to earn a minor.\n• Students enrolled in Dual Degree, Integrated M.Sc. and B.Arch. (Hons.) are permitted to pursue minor in other discipline up to their 10th Semester, while the students of B.Tech.(Hons.) should complete the minor requirements by 8th semester.", "page": "Minor"}, {"chunk_id": "e21fa4ea", "title": "See Also", "text": "Micro Specialization", "page": "Minor"}, {"chunk_id": "ed3bce29", "title": "References", "text": "UG Regulation Document", "page": "Minor"}]