[{"chunk_id": "info_a754c2", "title": "MMM - Quick Facts", "text": "Pandit Madan Mohan Malaviya Hall of Residence Loading map...\nFounded | 2005\nMotto | तस्मादुत्तिष्ठ कौन्तेय युद्धाय कृतनिश्चय (Chapter 2, Verse 37 of The Bhagwad Gita)\nOffice\nWarden | Prof. Sanjib Kumar Patra\nAsst. Warden(s) | Prof. Abhishek Rai, Prof. Kaushal Kumar Bhagat, Prof. Abhay Singh Gour, and Prof. Ajay Kumar Mishra\nHall President | Mr. Gurpreet Singh\nSSM | Mr. Akarsh Upadhyay\nOffice No. | +91 3222 281241\nInfrastructure\nCapacity | 2000+\nAccomodation for | Male\nRoom Types | Single Double\nDetails\nReferences: [ 1 ]", "page": "MMM"}, {"chunk_id": "ab5e4c54", "title": "MMM", "text": "MMM Hall\nPandit Madan Mohan Malaviya Hall of Residence ( pronounced as 'Triple M' ) was founded on the 27th of February 2005 and completed in record time for occupation by the 2005-06 batch on July 22nd and is named after Mahamana Pandit Madan Mohan Malaviya, an Indian scholar, educational reformer, and politician noted for his role in the Indian independence movement. [ citation needed ] It is the largest Hall Of Residence in the Indian Institute of Technology, Kharagpur. Pandit Madan Mohan Malaviya Hall of Residence is known for its strong sense of community and camaraderie among its residents. The hall has a capacity of more than 2000 boarders and offers a variety of amenities, including multiple common rooms, a music room, a library, a technology room, and sports grounds. This hall of residence lies between Lal Bahadur Shastri Hall of Residence and Lala Lajpat Rai Hall of Residence . It consists of four blocks: DSK Block, RR Block, SDS block, and HK block. It has a canteen, hair salon, xerox centers, juice Shop, and many general items shop beside the cycle stand of SDS Block. The hall council members are elected from amongst the boarders for a year. Last election took place on 19 August 2023 via ballot paper in HK block common room.", "page": "MMM"}, {"chunk_id": "64b9d37c", "title": "Hall History and Culture", "text": "The hall culture is a vital component of the fabric of IIT Kharagpur. The hall you reside in plays a pivotal role in your personal growth and development, refining your character from a youthful student to a mature and sophisticated individual. Historically, the strength of the hall culture was believed to be proportional to its age; however, the students at Pandit Madan Mohan Malaviya Hall of Residence defied these expectations and left an indelible mark on KGP history. The students exhibited remarkable determination and discipline, which enabled them to secure a commendable fourth position in the Illumination 2019 and second position in the Illumination 2022 competition.\nUndoubtedly, the senior-junior culture is a charming aspect of KGP culture, and Pandit Madan Mohan Malaviya Hall of Residence is renowned for its supportive and empathetic senior students. The seniors are always willing to lend a helping hand and provide guidance whenever needed, fostering an open and approachable atmosphere in the hall.", "page": "MMM"}, {"chunk_id": "a7c8280f", "title": "Council Members (2023-24)", "text": "• Hall President - Gurpreet Singha\n• Second Senate Member - Akarsh Upadhyay\n• General Secretary: Technology - Suryawanshi Vivek Bapurao\n• General Secretary: Alumni Affairs - Mali Pruthviraj Vithalpant\n• General Secretary: Mess-01 - Harshit Patel\n• General Secretary: Mess-02 - Shiva Kumar\n• General Secretary: Maintenance - Sanmati Shastri Jain\n• General Secretary: Social and Cultural - Parv\n• General Secretary: Students Welfare - Balasaheb Ramkrishna Mule\n• General Secretary: Sports - Akshaykumar C Deshmukh\n• General Secretary: Library - Ayush Shrivastava", "page": "MMM"}, {"chunk_id": "d58bad7b", "title": "Student Activity Rooms", "text": "• HK - COMMON ROOM\n• HK - WELFARE ROOM (S-213G)\n• HK - SPORTS ROOM (W-317G)\n• HK - HALL LIBRARY (S-313G)\n• HK - READING ROOM (S-313G)\n• DSK - COMMON ROOM\n• DSK - HALL LIBRARY (E-313G)\n• DSK - READING ROOM (E-324G)\n• SDS - COMMON ROOM\n• SDS - TECH. ROOM (216G)\n• SDS - INNOVATION ROOM (309G)\n• SDS - READING ROOM (242G)\n• RR - COMMON ROOM\n• RR - READING ROOM (129G)\n• HALL GYM (BEHIND MESS)\n• MUSIC ROOM (BEHIND MESS)", "page": "MMM"}, {"chunk_id": "a23421f1", "title": "References", "text": "↑ \"Pandit Madan Mohan Malaviya Hall of Residence\" . IIT Kharagpur . Retrieved August 6, 2015 .", "page": "MMM"}]