[{"chunk_id": "255bc3b4", "title": "Moodle", "text": "Moodle is a Course Management System (CMS), used to create online courses for Professors and students to achieve learning goals. Moodle is an acronym for Modular Object-Oriented Dynamic Learning Environment. It allows for a focus on interaction and collaborative construction of content.\nScreenshot of the IITKGP Moodle", "page": "Moodle"}, {"chunk_id": "692f9208", "title": "Overview", "text": "There are at least 5 different moodle platforms in IIT Kharagpur, maintained by different departments or bodies.\n• http://10.57.2.100/moodle - general website for IIT Kharagpur. http://www.kgpmoodle.iitkgp.ac.in/moodle/login/index.php - another link to the general website(can be accessed from outside the campus as well).\n• https://10.5.18.110/moodle - maintained by department of Computer Science and Engineering (CSE). To access from outside the campus network, use the link - https://moodlecse.iitkgp.ac.in/moodle/\n• http://10.35.32.20/moodle - maintained by Center of Educational Technology (CET).\n• http://10.57.2.200/moodle/ - maintained by National Mission on Education through Information Communication Technology (NMEICT). To access from outside the campus network, use the link - http://www.nmeictmoodle.iitkgp.ac.in/moodle/index.php\n• http://10.11.51.111/moodle/ - moodle site for thermodynamics maintained by Mech Dep", "page": "Moodle"}, {"chunk_id": "34a79d1a", "title": "Proxy Instructions", "text": "NOTE: The below instructions are no more valid since Proxy has been removed from the campus network.\nAll the above mentioned platforms are hosted locally so proxy must be disabled / bypassed to access any of them. Since they are hosted on Local Area Network, they cannot be accessed via Mobile data or anywhere outside Kharagpur.\nMoodle is used in the institute to build courses, keep track of attendance, assignments and grades. Assignments for courses maintained via Moodle are to be submitted online within a predetermined deadline.", "page": "Moodle"}]