[{"chunk_id": "info_042eaa", "title": "MS60001: Structure Property Relations In Materials - Quick Facts", "text": "MS60001\nCourse name | STRUCTURE PROPERTY RELATIONS IN MATERIALS\nOffered by | Materials Science\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | {{{semester}}}", "page": "MS60001: Structure Property Relations In Materials"}, {"chunk_id": "a49113ea", "title": "Syllabus mentioned in ERP", "text": "Pre-requisites: None Introduction : Types of materials from structure to property. Crystal Structures : Seven systems and fourteen lattices; lattice direction and planes. Understanding amorphous materials and polymers. Crystal Imperfections : Point, line and planar defects. Mass transport: Diffusion in Solids : Mechanisms; Fick’s laws; factors-affecting diffusion inmetals; ceramics and semiconductors; atom mobilities, temperature and impurity dependence of diffusion, various diffusion processes. Heat Transport: conduction, convection, radiation. Momentum transport: viscosity, measuring viscosity, rheology, etc. Phase Diagrams : Phase rule; isomorphous, eutectic, peretectic, eutectoid etc. Binary phase diagrams (Pb-Sr, Al-Si, Ge-Si, Au-Si etc), microstructure and its effect on properties. Phase diagram of materials. Understanding polymer-solvent interactions, polymer-polymer blends, etc in the light of theremodynamics. Nucleation and Growth : Homogeneous and heterogeneous nucleation kinetics; growth and overall transformation kinetics. Kinetics of polymerization Deformation Mechanism and Mechanical Properties of Materials : Plastic deformation of single crystals and polycrystals; strengthening mechanisms; recovery-recrystallization-grain growth; tensile, impact, fatigue and creep of metals and alloys; deformation behavior of ceramics and polymers; mechanical testing methods Quantum mechanical approach to structure of materials : Energy bands in solids; electrical conductivity; extrinsic and intrinsic semiconductors; carrier concentration; work function. Carrier transport mechanism : Scattering and drift of electrons and holes; diffusion and drift of carriers; Hall effect. Materials for use in electronic devices : Polymers, ceramics, semiconductors and metals – their structure and properties; insulators; superconductors; dielectric, ferroelectric, memory and magnetic materials. Case studies. Selection of Engineering Materials : Common engineering materials including metals and alloys, polymers, ceramics, composites, electronic materials and their selection procedures.", "page": "MS60001: Structure Property Relations In Materials"}]