[{"chunk_id": "info_e52d1e", "title": "MS60033: Soft Materials - Quick Facts", "text": "MS60033\nCourse name | SOFT MATERIALS\nOffered by | Materials Science\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | {{{semester}}}", "page": "MS60033: Soft Materials"}, {"chunk_id": "ec8508f0", "title": "Syllabus mentioned in ERP", "text": "Pre-requisite: None Introduction, Overview: What is soft condensed matter. Forces, energies, and time scales in soft condensed matter. (Intra- and intermolecular interactions, structural organization, phase transition, order parameters, scaling laws). Experimental techniques to investigate soft matter. Applications of soft matter in nanotechnology. Polymer architecture and stereochemistry, Synthesis, Copolymers and polymer blends, Polydispersity, Phase separation and segregation, Thin film vs. bulk properties, Polymer surface, Polymer solution, Liquid Crystalline polymers. Gelation, Classes of gels: physical gels, chemical gels, Theory of Gelation. Hydrogels: Types of hydrogels, Application of hydrogels, Formation of hydrogels, Processing of hydrogels Colloids: Types of colloids and their formation, Forces between colloidal particles. Assembly and phase behavior, Charges and stabilization, Kinetics, Defects in assembly, Approaches to control long range order. Characterization. Applications of colloids, especially in photonics and optoelectronics. Amphiphiles: Types of amphiphiles, Self-assembled phases in solution, Phase separation and aggregation of amphiphilic molecules, Micellization and critical micelle concentration (CMC), Bilayers and vesicles, Phase behavior in concentrated solutions, Complex phases in surfactant solutions and microemulsions, Adsorption at solid interface, Soft Matter in Nature, Nucleic acids, Proteins, Polysaccharides, Membranes Nanotechnology and soft materials, Photoresists in microlithography, Nanolithography using block copolymer templates, Directed colloidal assembly, Soft lithography by PDMS and self-assembled monolayers, hemistry and process. Micropatterning in microfluidics, Applications in biotechnology", "page": "MS60033: Soft Materials"}]