[{"chunk_id": "info_05f224", "title": "MT21010: Transport Phenomena In Metallurgical Processes - Quick Facts", "text": "MT21010\nCourse name | Transport Phenomena In Metallurgical Processes\nOffered by | Metallurgical & Materials Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n4 6 12 15 5 11 5 EX A B C D P F | 4 | 4 | 6 | 6 | 12 | 12 | 15 | 15 | 5 | 5 | 11 | 11 | 5 | 5 | EX | A | B | C | D | P | F\n4 | 4 | 6 | 6 | 12 | 12 | 15 | 15 | 5 | 5 | 11 | 11 | 5 | 5\n4\n6\n12\n15\n5\n11\n5\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "MT21010: Transport Phenomena In Metallurgical Processes"}, {"chunk_id": "2d63b41c", "title": "Syllabus mentioned in ERP", "text": "Prerequisite: Nil\nSyllabus:Momentum transfer in fluid flow: Newtonian and Non-newtonian fluids, estimation of viscosity of gases ,gas mixtures, liquid metals and slags. Differential mass and momentum balance: equation of continuity and Navier stoke s equation. Turbulent Flow: Navier stokes equation in terms of time averaged velocity, turbulent viscosity models. Concept of velocity boundary layer, friction factor, flow through packed and fluidized beds. Interactions of gas bubbles in liquid, and high velocity gas jet in liquids. Overall energy balance -Bernoullis equation, flow meters, chimney draft. Heat transfer: Factors affecting thermal conductivity of gases, liquids, solid metals and alloys. Steady and unsteady heat conduction equations and their applications in composite walls, finite, semi-infinite solid bodies. Heat transfer with change of phases â solidification, melting problems. Convective heat transfer and general heat balance equation. Thermal boundary layer, heat transfer coefficient, and dimensionless correlations. Laws of radiative heat transfer, heat exchange in transparent and absorbing medium. Mass Transfer: Concept of mass diffusion, factors affecting diffusivity in solids, liquid metals and gases, diffusion through solid and porous materials. Mass transfer in stagnant film with and without chemical reaction. Mass transfer in moving boundary problem. General equation of mass transfer with diffusion, convection and chemical reaction. Mass transfer coefficient, models and correlations. Liquid-liquid mass transfer.\nText Books: 1.R. B. Bird, W. E. Stewart and E. N. Lightfoot :Transport Phenomena , John Wiley and Sons, 1994.2.G.H. Geiger and D. R. Poirier :Transport Phenomena in Metallurgy , Addison Wesley,1980.", "page": "MT21010: Transport Phenomena In Metallurgical Processes"}]