[{"chunk_id": "info_aba63f", "title": "MT21008: Deformation Behaviour Of Materials - Quick Facts", "text": "MT21008\nCourse name | Deformation Behaviour Of Materials\nOffered by | Metallurgical & Materials Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n13 20 15 7 9 4 1 EX A B C D P F | 13 | 13 | 20 | 20 | 15 | 15 | 7 | 7 | 9 | 9 | 4 | 4 | 1 | 1 | EX | A | B | C | D | P | F\n13 | 13 | 20 | 20 | 15 | 15 | 7 | 7 | 9 | 9 | 4 | 4 | 1 | 1\n13\n20\n15\n7\n9\n4\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "MT21008: Deformation Behaviour Of Materials"}, {"chunk_id": "1b5a22ba", "title": "Syllabus mentioned in ERP", "text": "Prerequisite â Intro. to Engg. Mat. / Mat. Engg.Introduction: Scope of the subject, elastic, plastic and visco-elastic deformation.Deformation behaviour: Tensile and compression testing, effect of temperature and strain rateContinuum mechanics: Concepts of stress and strain in 3D stress and strain tensor, principal stresses and strains and principal axes, mean stress, stress deviator, maximum shear, equilibrium of stresses, equations of compatibility.Elastic behaviour of materials: Constitutive equations in elasticity for isotropic and anisotropic materials, strain energy, elastic stiffness and compliance tensor, effect of crystal structure on elastic constants.Plastic response of materials-a continuum approach: classification of stress-strain curves, yield criteria.Microscopic basis of plastic deformation: Elements of dislocation theory, movement of dislocation, elastic properties of dislocation, intersection of dislocation, dislocation reactions in different crystal structures, origin and multiplication of dislocations.Plastic deformation of single crystals: Critical resolved shear stress, deformation by twinning, deformation band and kink band, strain hardening of single crystal; stress-strain curves of fcc, bcc and hcp materials.Plastic deformation of polycrystalline materials: Role of grain boundaries in deformation, strengthening by grain boundaries, yield point phenomenon, strain ageing, strengthening by solutes, precipitates, dispersoids and fibres.Deformation in non-metallic materials: structure and deformation of polymers, concept Superlattice dislocations in intermetallics, concept of charge associated with dislocations in ceramics.Text Books:1.G.E. Dieter: Mechanical Metallurgy, 3rd Ed., McGraw Hill Book Company, New Delhi, 1986.2.T.H. Courtney: Mechanical Behaviour of Materials, McGraw Hill Book Company, New Delhi, 1990.", "page": "MT21008: Deformation Behaviour Of Materials"}]