[{"chunk_id": "info_c1e593", "title": "MT31015: Principles Of Extractive Metallurgy - Quick Facts", "text": "MT31015\nCourse name | Principles Of Extractive Metallurgy\nOffered by | Metallurgical & Materials Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n6 8 14 8 2 6 EX A B C D P F | 6 | 6 | 8 | 8 | 14 | 14 | 8 | 8 | 2 | 2 | 6 | 6 | EX | A | B | C | D | P | F\n6 | 6 | 8 | 8 | 14 | 14 | 8 | 8 | 2 | 2 | 6 | 6\n6\n8\n14\n8\n2\n6\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "MT31015: Principles Of Extractive Metallurgy"}, {"chunk_id": "f1e959bf", "title": "Syllabus mentioned in ERP", "text": "MT31015: PRINCIPLES OF EXTRACTIVE METALLURGY (3-1-0)Prerequisite Metallurgical Thermodynamics and Kinetics (MT21105), Transport Phenomena in Metallurgical Processes(MT21010).Mineral dressing: importance of mineral dressing, size reduction of solids, selection, breakage and classification function, estimation of particle size distributions, minimum sample size for ground material, slurry characterization, Metallurgical accounting and control, analysis of mineral processing flow sheets involving slurry streams, raw data collection and data reconciliation, principles of flotation, design of mineral flotation circuits,floation columns. General equations of heat, mass and momentum balance, laminar, turbulent flow, concept of boundary layer, friction factor, heat and mass transfer coefficients and dimensionless correlations. Fluid flow and heat transfer in packed and fluidized bed, momentum transfer associated with high velocity gas jet and gas bubbles in liquid. Heat and mass transfer of moving boundary problems involving melting, solidification and reactions. Radiative heat exchange in transparent and absorbing medium. Refractories and uses. Unit Processes in pyrometallurgy: Fuels for metallurgical processes. Drying,calcination, roasting,pelletising and sintering. Thermodynamics of metal extraction, Slags, classification and properties. Reduction smelting in shaft furnace, alternative reductants, hydrogen as reductant ,metallothermic reduction; Reactor design considerations, sizing of fluidized and fixed bed metallurgical reactors. Thermodynamic principles and applications of matte smelting and converting. Flash smelting and submerged bath smelting. Principles of metal refining with examples for metals like copper, nickel, lead, and zinc; design of metal separation using high temperature distillation. Unit processes in hydrometallurgy: leaching, purification of leach liquor, solvent extraction and ion exchange systems and flow sheet design. Unit processes in electrometallurgy: Faradays laws of electrolysis, concept of overvoltage, limiting current density, overall cell voltage, series and parallel electrical circuits in refining. Electrowinning and electrorefining with reference to metals like Cu, Zu, Al and Mg. Text Books:1.Terkel Rosenqvist: Principles of Extractive Metallurgy, McGraw-Hill International, 1983.2.R. D. Pehlke: Unit Processes of Extractive Metallurgy, Elsevier publishing Company, 1973.", "page": "MT31015: Principles Of Extractive Metallurgy"}, {"chunk_id": "9f683ed7", "title": "Student Opinion", "text": "This course is the part of the metallurgy which everyone afraid of before taking metallurgy. Not so difficult , just read extraction processes as much as you can.", "page": "MT31015: Principles Of Extractive Metallurgy"}, {"chunk_id": "df11d4d3", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | MT ANNEX-3\nTuesday\nWednesday | MT ANNEX-3 | MT ANNEX-3\nThursday | MT ANNEX-3\nFriday", "page": "MT31015: Principles Of Extractive Metallurgy"}]