[{"chunk_id": "info_651038", "title": "MT32008: Iron Making And Steelmaking - Quick Facts", "text": "MT32008\nCourse name | Iron Making And Steelmaking\nOffered by | Metallurgical & Materials Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n4 7 5 12 11 3 4 EX A B C D P F | 4 | 4 | 7 | 7 | 5 | 5 | 12 | 12 | 11 | 11 | 3 | 3 | 4 | 4 | EX | A | B | C | D | P | F\n4 | 4 | 7 | 7 | 5 | 5 | 12 | 12 | 11 | 11 | 3 | 3 | 4 | 4\n4\n7\n5\n12\n11\n3\n4\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "MT32008: Iron Making And Steelmaking"}, {"chunk_id": "669b138a", "title": "Syllabus mentioned in ERP", "text": "Prerequisite-Principles of Ext. Met.General overview of iron and steel making industries in India and abroad. General layout of an integrated steel plant. Agglomeration, testing of raw materials used in Blast Furnace for iron making. Physical chemistry of iron making process: Fe-O, C-O, Fe-C-O and Fe-C-O-H phase equilibria. Theory and practice of iron making in Blast furnace including design of furnace, refractories, aerodynamics, various zones in the furnace and reactions, charging, gas cleaning and hot blast stoves etc. Heat and material balance. Kinetics of gas-solid reaction. Blast furnace slag, sulphur and silicon control. Methods of improving furnace operation and recent developments in design and practice. Alternative routes of iron making.Physical chemistry of steel making, slag chemistry. State of oxidation, basicity and fluidity of steel making slag. Carbon, silicon, manganese, phosphorus and sulphur reactions. Kinetics of slag-metal reaction. Theory and practice of different steel making processes including design, refractory, operation of various steel making processes such as OHF, BOP (LD, LDAC, OBM, combined blowing etc). Electric arc furnace â recent advances. Secondary steel making, ingot and continuous casting of steel.Text Books:1.A. K. Biswas : Principles of Blast Furnace Iron Making, SBA publications,1984.2.A. Ghosh and A. Chatterjee: Ironmaking and Steelmaking: Theory and Practice, PHI, 2008.", "page": "MT32008: Iron Making And Steelmaking"}]