[{"chunk_id": "info_96ec75", "title": "MT41016: Semiconducting And Magnetic Materials - Quick Facts", "text": "MT41016\nCourse name | Semiconducting And Magnetic Materials\nOffered by | Metallurgical & Materials Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | Spring", "page": "MT41016: Semiconducting And Magnetic Materials"}, {"chunk_id": "d5cb2f8c", "title": "Syllabus mentioned in ERP", "text": "Prerequisite - MT21107 or MT30001Electronic Materials: Introduction, metals and semiconductors - crystal structure and bonding, phase-equilibria, band structure and electrical conductivity; classification of semiconductors, quantum wells, current transport and electronic properties of interfaces-effect of alloying, elementary p-n junction theory, principles of MOSFET, applications of semiconductors in light emitting devices, switching devices, photovoltaics and solar cells; fundamental principles (nucleation and growth, diffusion and mass transport) and techniques of processing semiconductor devices and heterostructures- bulk crystal growth, epitaxial methods, thin film deposition methods, ion implantation, rapid thermal processing, etc.; structure-property relationships- types of defects and their influence on properties and performance, methods to inhibit formation of defects. Piezoelectric, Dielectric and Ferroelectric Materials: Processing, structure and properties. Magnetic Materials: Basic Principles! and classification-concepts of ferro-magnetism, anti-ferromagnetism, diamagnetism, paramagnetism, magneto-resitivity, giant and colossal magneto-resistance behaviour, processing and performance of magnetic thin films, functional data storage and read-write sensor devices, dilute magnetic semiconductors and spintronics.Text Books:1. Angus Rockett: The Materials Science of Semiconductors, 1st Edition, Springer, 2008. 2. Rolf E. Hummel: Electronic Properties of Materials, Springer; 3rd edition, 2004.", "page": "MT41016: Semiconducting And Magnetic Materials"}]