[{"chunk_id": "info_6ffc6b", "title": "MT41110: Design And Selection Of Materials - Quick Facts", "text": "MT41110\nCourse name | Design And Selection Of Materials\nOffered by | Metallurgical & Materials Engineering\nCredits | 3\nL-T-P | 3-0-0\nProfessor(s) | Chandra Sekhar Tiwary\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | Autumn", "page": "MT41110: Design And Selection Of Materials"}, {"chunk_id": "f297966e", "title": "Syllabus mentioned in ERP", "text": "• Prerequisite - MT21107 or MT30001\n• Criteria for selection of materials, application of statistics in materials, application of statistics in materials selection.\n• Limitations in properties and applications of plain carbon steels and common non-ferrous alloys. Specification of steels, composition, heat treatment, micro structure and properties of ferrous and non-ferrous alloys.\n• Metals, ceramics and polymers for light and heavy structural, corrosion resistant, high temperature, low-temperature, wear resistant, magnetic, electrical and electronic applications, pressure vessels, springs, bearings, tools, and medical implants and prostheses application.\n• Composites, shape memory alloys, metallic glasses.\n• Advanced and smart materials.\n• Text Books: Michael F Ashby: Materials Selection in Mechanical Design, 2nd Edition Butterworth Heinmann, Oxford, UK, 1999. J.A. Charles, F.A.A. Crane, J.A.G.Furness: Selection and Use of Engineering Materials, 3rd Edition, Reed Educational and Professional Publishing Ltd. , New Delhi,1997.", "page": "MT41110: Design And Selection Of Materials"}, {"chunk_id": "c4b08dee", "title": "Student Opinion", "text": "No attendance. I basically attended only one class. You should have a basic understanding of materials, all the courses that you've been taught will be helpful. All round, the course is pretty easy. There was a presentation and also an egg drop project, and they carried almost half your grade.", "page": "MT41110: Design And Selection Of Materials"}, {"chunk_id": "17c0f7f0", "title": "How to Crack the Paper", "text": "Refer to previous papers. Although same questions aren't asked, the model and mark distribution is same. Chances are that one or two questions are asked from previous papers. The questions asked are framed based on everyday observations. One of the questions in 2023 end sem was to guess, justify and write down materials used in chandrayaan 3.", "page": "MT41110: Design And Selection Of Materials"}]