[{"chunk_id": "info_b87724", "title": "MT41112: Surface Engineering - Quick Facts", "text": "MT41112\nCourse name | Surface Engineering\nOffered by | Metallurgical & Materials Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n2 4 2 1 1 EX A B C D P F | 2 | 2 | 4 | 4 | 2 | 2 | 1 | 1 | 1 | 1 | EX | A | B | C | D | P | F\n2 | 2 | 4 | 4 | 2 | 2 | 1 | 1 | 1 | 1\n2\n4\n2\n1\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "MT41112: Surface Engineering"}, {"chunk_id": "3676248a", "title": "Syllabus mentioned in ERP", "text": "Prerequisite - NilSurface dependent engineering properties, viz., Friction and wear, corrosion, fatigue, etc.; common surface initiated engineering failures; mechanism of surface degradation; importance and necessity of surface engineering; classification and scope of surface engineering in metals, ceramics, polymers and composites, tailoring of surfaces of advanced materials. Surface protection (Physical); surface modification (Chemical) techniques: classification, principles, methods, and technology. Conventional surface engineering methods: carburising, nitriding, cyaniding, diffusion coating, hot dipping, galvanizing etc.Electrochemistry and electro-deposition; scope and application of conventional surface engineering techniques in engineering materials; advantages and limitations of conventional processes. Recent trend in surface engineering: physical/chemical vapor deposition; plasma spray coating; plasma assisted ion implantation. Surface modification by directed energy beams like ion, electron and laser beams; energy transfer, novelty of the directed energy beams assisted surface modification techniques.Characterization (microstructural and compositional) and testing/evaluation of surface-properties; structure-property correlation. Economics and energy considerations, designing of surface engineering processes. Text Books: 1.J. R. Davis (Ed.): Surface Engineering for Corrosion and Wear Resistance, ASM International, Materials Park, Ohio, 2001.2.K. G. Budinski (Ed.): Surface Engineering for Wear Resistance, Prentice Hall, New Jersey 1988.", "page": "MT41112: Surface Engineering"}]