[{"chunk_id": "info_dfe0f8", "title": "MT41022: Advanced Phase Transformations - Quick Facts", "text": "MT41022\nCourse name | Advanced Phase Transformations\nOffered by | Metallurgical & Materials Engineering\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | Spring", "page": "MT41022: Advanced Phase Transformations"}, {"chunk_id": "d0c52f53", "title": "Syllabus mentioned in ERP", "text": "Prerequisite - MT21107 or MT30001, MT31005Introduction, Recapitulation of the principles of thermodynamics applicable to phase transformation.Schemes of classification of phase transformation. Thermodynamic models for the calculation of phase diagrams. Solidification, solidification structures. Quantitative theory of nucleation: homogeneous and heterogeneous nucleation; kinetics of nucleation. Diffusion and interface controlled growth. Overall transformation kinetics including empirical transformation kinetics during isothermal and non-isothermal treatment. Massive Transformation: thermodynamics and kinetics, morphology. Precipitation, spinodal decomposition, precipitate coarsening. Order-disorder transformation. Cellular phase transformation. Displacive transformations: general characteristics (including crystallography and morphology), classification of martensite transformations, thermodynamics and kinetics martensite transformation, bainite transformation in steels. Stress-induced martensite, Thermoelastic martensite, shape memory effect. Some examples of applications of phase transformation in steels, Ti-alloys and other non-ferrous alloys. Text Books:1. J W Christian: The theory of transformations in metals and alloys, part 1 and 2, 3rd edition:, Pergamon Press, 2002.2. AK Jena, MC Chaturvedi : Phase Transformations in Materials:, Prentice Hall, New Jersey , USA, 1992.", "page": "MT41022: Advanced Phase Transformations"}, {"chunk_id": "fa90d2dc", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | MT ANNEX-1\nThursday | MT ANNEX-1\nFriday | MT ANNEX-1", "page": "MT41022: Advanced Phase Transformations"}]