[{"chunk_id": "info_64fe51", "title": "MT41028: Atomistic Modelling Of Materials - Quick Facts", "text": "MT41028\nCourse name | Atomistic Modelling Of Materials\nOffered by | Metallurgical and Materials Engineering\nCredits | 3\nProfessor(s) | Sankha Mukherjee\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | {{{semester}}}", "page": "MT41028: Atomistic Modelling Of Materials"}, {"chunk_id": "79400a98", "title": "Syllabus mentioned in ERP", "text": "• Introduction: Objective of Mathematical Modeling, Classification of Models, Classes of Atomistic Models and their applications\n• Molecular Dynamics Modeling: Basic assumptions of molecular dynamics modeling, Review of Classical Mechanics and Statistical Mechanics, Interaction Potentials, force calculations on atoms and concept of neighborhood, Velocity-Verlett and other time integration algorithms, boundary conditions, Thermal Equilibration and MD simulation of Liquids. Examples: Structure of atom around vacancy, dislocation, grain boundary structures, and other examples\n• Ab-Initio Modeling: Review of quantum mechanics, variational calculus, schrodinger equation for multi-electron system, Density Functional Approach, Examples: Electronic structure and thermodynamic properties of crystals of metals, non-metals and alloys and other examples. Other approaches like tight binding approach with examples.\n• Text Books: S. Yip(Ed.): Handbook of Materials Modeling, Springer, 2005 Z. H.Barber (Ed.): Introduction to Materials Modeling, Maney publishing for the Institute of Materials, Mineral and Mining, London, 2005.", "page": "MT41028: Atomistic Modelling Of Materials"}, {"chunk_id": "1d6a68bb", "title": "Concepts taught in class", "text": "Molecular Dynamics, Density functional theory (both theory and applications), quantum physics.", "page": "MT41028: Atomistic Modelling Of Materials"}, {"chunk_id": "a3ab2bf5", "title": "Student Opinion", "text": "This is an extremely good course for someone wanting to explore dft and molecular dynamics. The way the professor teaches makes it very easy for anyone to understand quantum physics. The lab classes on every Monday for an hour are very informative. Grading is relative. Overall there is a lot you can learn on this course.", "page": "MT41028: Atomistic Modelling Of Materials"}, {"chunk_id": "23fb5c95", "title": "How to Crack the Paper", "text": "Attending classes will be really helpful. All the questions asked will be from the concepts taught. However 2 to 3 questions which carry almost 6 to 8 marks can be from what the professor mentioned in the class. No need to refer extra materials. Just be thorough with the shared slides.", "page": "MT41028: Atomistic Modelling Of Materials"}, {"chunk_id": "439f61fa", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | MT Annex 4\nTuesday | MT Annex 4 | MT Annex 4\nWednesday\nThursday\nFriday", "page": "MT41028: Atomistic Modelling Of Materials"}]