[{"chunk_id": "info_9acfb9", "title": "MT60013: Principles Of Materials Engineering ( For Non - Quick Facts", "text": "MT60013\nCourse name | PRINCIPLES OF MATERIALS ENGINEERING ( FOR NON\nOffered by | Metallurgical & Materials Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | {{{semester}}}", "page": "MT60013: Principles Of Materials Engineering ( For Non"}, {"chunk_id": "1e5d070e", "title": "Syllabus mentioned in ERP", "text": "Introduction: Solid Engineering Materials- their classification and characteristic properties. Structure of solids: crystal systems/lattices, crystal structure, crystallographic planes and directions, interstitial sites, crystallinity in metals, ceramics, semiconductors and polymers. Microstructures and metallography. amorphous or glassy state. Solidification of pure metal â homogeneous and heterogeneous nucleation processes, cooling curve, concept of supercooling microstructure of pure metals. Defects in solids â point, line, planar and volume. Fundamentals of plastic deformation of metals, deformation by slip and twin, plastic deformation in polycrystalline metals, concept of cold working, preferred orientation. Annealing: Recovery, recrystallization and grain growth; hot working. Properties of materials: Definition, units and common tests conducted to evaluate important engineering properties like physical, mechanical, chemical, electrical, magnetic, semi/super-conducting, optical, and thermal properties in engineering materials Concept of formation of alloys: Types of alloys, solid solutions, factors affecting solid solubility, order disorder transformation. Binary phase diagrams: isomorphous, eutectic, peritectic, eutectoid and peritectoid systems, effect of non equilibrium cooling, coring and homogenization. Iron-cementite diagram: Construction and interpretation Fe-Fe3C and Fe-Graphite diagrams. Microstructure, and properties of different alloys in steel and cast iron, types of cast iron, their microstructures and typical uses. Heat treatment: TT-T and C-C-T diagrams, concept of heat treatments of steel â annealing, normalizing, hardening and tempering; microstructural effects brought about by these processes and their influence on mechanical properties. Effect of common alloying elements in steel, concept of hardenability, factors affecting it. Common alloy steels, stainless steel, tool steel, high speed steel, high strength low alloy steel, microalloyed steel, specifications of steels. Physical metallurgy of common non-ferrous alloys: Cu-,Al- and Ni- based alloys. Microstructures and heat treatment of common alloys of these systems. Engineering ceramics and polymers: Structure, properties and application of common engineering ceramics and polymers.", "page": "MT60013: Principles Of Materials Engineering ( For Non"}, {"chunk_id": "227a0309", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | MT ANNEX-4\nThursday | MT ANNEX-4\nFriday | MT ANNEX-4 | MT ANNEX-4", "page": "MT60013: Principles Of Materials Engineering ( For Non"}]