[{"chunk_id": "info_e0e946", "title": "MT60002: Metallurgical Kinetics - Quick Facts", "text": "MT60002\nCourse name | Metallurgical Kinetics\nOffered by | Metallurgical & Materials Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n2 4 4 10 6 2 1 EX A B C D P F | 2 | 2 | 4 | 4 | 4 | 4 | 10 | 10 | 6 | 6 | 2 | 2 | 1 | 1 | EX | A | B | C | D | P | F\n2 | 2 | 4 | 4 | 4 | 4 | 10 | 10 | 6 | 6 | 2 | 2 | 1 | 1\n2\n4\n4\n10\n6\n2\n1\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "MT60002: Metallurgical Kinetics"}, {"chunk_id": "1687c79f", "title": "Syllabus mentioned in ERP", "text": "MT60002: Metallurgical Kinetics (3-1-0)Introduction: Role of kinetics, heterogeneous and homogeneous kinetics, Role of heat and mass transfer in metallurgical kinetics, rate expression, Effect of Temperature and concentration on reaction kinetics: effect of temperature (Arrhenius Equation), Effect of concentration (order of a reaction), significance and determination of activation energy, Kinetics of solid-fluid reaction: kinetic steps, rate controlling step, definition of various resistances in series, shrinking core model, chemical reaction as rate controlling step, Product layer diffusion as rate controlling step, Mass transfer through external fluid film as rate controlling step, heat transfer as the rate controlling step, Concentration boundary layer, definition and significance of heat and mass transfer coefficient, Theoretical models for mass transfer coefficients, Correlations for heat and mass transfer coefficients, Kinetics of liquid-liquid reaction Part II Solid state phase changes - classification, nucleation and growth processes. Diffusion - driving force, classification, Ficks laws, diffusion coefficients. Kinetics of liquid-solid transformation - driving force, homogeneous and heterogeneous nucleation kinetics, kinetics of growth, kinetics of alloy solidification. Kinetics of solid-state phase transformation - scope and classification, kinetics of homogeneous and heterogeneous nucleation, interface growth velocity, kinetics of special transformations (Widmanstatten, massive, polymorphic, coarsening, recrystallization, age hardening), kinetics of invariant and moving boundary transformation, kinetics of phase transition in polymers, glass, ceramics. Overall transformation kinetics - Johnson-Mehl and Avrami s model, kinetics of non-random nucleation, kinetics of diffusion controlled, isothermal and non-isothermal kinetic analysis", "page": "MT60002: Metallurgical Kinetics"}]