[{"chunk_id": "info_534b57", "title": "MT61332: Corrosion Protection And Surface Engineering - Quick Facts", "text": "MT61332\nCourse name | CORROSION PROTECTION AND SURFACE ENGINEERING\nOffered by | Metallurgical & Materials Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | {{{semester}}}", "page": "MT61332: Corrosion Protection And Surface Engineering"}, {"chunk_id": "df33eee5", "title": "Syllabus mentioned in ERP", "text": "Introduction to corrosion : definition, electrochemical principles of corrosion, e.m.f. and galvanic series - their utility in corrosion studies; Different forms of corrosion - uniform, galvanic, crevice, pitting, intergranular, selective leaching, erosion, stress corrosion cracking - their characteristic features, causes and remedial measures; Testing and evaluation of corrosion. Introduction to high temperature corrosion : definition, oxidation kinetics, oxide defect structures, liquid metal attack - liquid metal embrittlement, chemical degradation of non-metallic materials like rubbers, plastics, ceramics etc. Introduction to fatigue and corrosion fatigue\ndefinition, characteristics and mechanism. Importance and necessity of surface\nengineering, Classification, principles, methods, technology and scope of surface engineering, tailoring of surfaces of advanced materials. Surface modification techniques (both conventional and advanced) applied to ferrous and non-ferrous materials: Flame/induction hardening, laser/electron beam assisted hardening, solid state diffusion assisted surface alloying (carburizing, nitriding, carbunitriding, calorizing, siliconizing) laser/electron beam assisted surface alloying, engineering application of surface modification techniques. Surface coating by physical, chemical/electro-chemical and thermal routes: Development of coating by physical vapor deposition (thermal evaporation, sputtering, ion plating, pulsed laser deposition, molecular beam epitaxy), chemical vapor deposition, plasma assisted chemical vapor deposition, eletro/electroless deposition, sol-gel route, physical/chemical vapor deposition, weld overlaying, plasma spray coating, laser and electron beam assisted surface cladding, engineering application of surface coating. Principle of corrosion protection by coating, criteria for selection of coating composition for corrosion protection, noble and sacrificial coating, selection of coating techniques for different application. Microstructural and compositional characterization of surface, phase analysis and testing/evaluation of surface-properties, structure-property correlation, designing of surface engineering processes.", "page": "MT61332: Corrosion Protection And Surface Engineering"}]