[{"chunk_id": "info_d79ab9", "title": "MT61128: Phase Transformations And Phase Equilibria - Quick Facts", "text": "MT61128\nCourse name | Phase Transformations And Phase Equilibria\nOffered by | Metallurgical & Materials Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | Spring", "page": "MT61128: Phase Transformations And Phase Equilibria"}, {"chunk_id": "c8527393", "title": "Syllabus mentioned in ERP", "text": "Phase equilibrium: Introduction, Thermodynamics and stability of phases, Classification of phase transformations, Order of transformation, Gibbs rule and application, Phase diagrams, construction and interpretation. Liquidsolid transformation: Nucleation: homogeneous and heterogeneous, Growth : continuous and lateral; Interface stability; Alloy solidification: cellular and dendritic, Eutectic, off-eutectic, peritectic solidification; Welding, casting and rapid solidification. Solid state diffusive transformation: Classification, Nucleation and growth - homogeneous and heterogeneous mechanism, Precipitate growth under different conditions, Age hardening, Spinodal decomposition, Precipitate coarsening, Transformation with start range diffusion, Moving boundary transformations: recrystallization, grain growth, eutectoid transformation, discontinuous reactions. Pearlitic and bainitic transformation: Factors influencing pearlitic transformation, Mechanism of transformation, Nucleation and growth, Orientation relationship, Degenerate pearlite. Bainite: mechanism of transformation, Nucleation and growth, Orientation relationships, Surface relief, Classical and non-classical morphology, Effect of alloying elements. Non-diffusive transformation: Characteristics of transformation, Thermodynamics and kinetics, Nucleation and growth, Morphology, Crystallography, Stabilization, Strengthening mechanisms, Nonferrous martensite, Shape memory effect/alloys. Phase Transition in Ceramics and Polymers: Phase changes in ceramics: glass transition, glass tempering, glasses, Phase change in polymers and amorphous materials.", "page": "MT61128: Phase Transformations And Phase Equilibria"}]