[{"chunk_id": "info_8f09c7", "title": "MT61334: Rate Phenomena In Steel Technology - Quick Facts", "text": "MT61334\nCourse name | RATE PHENOMENA IN STEEL TECHNOLOGY\nOffered by | Metallurgical & Materials Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | {{{semester}}}", "page": "MT61334: Rate Phenomena In Steel Technology"}, {"chunk_id": "133c9c83", "title": "Syllabus mentioned in ERP", "text": "Fluid Flow : Newton s Law of Viscosity, Differential Analysis of flow â continuity equation and Navier-Stokes Equation, Concept of boundary layer, Solved examples of incompressible steady state flow, Non-dimensionalization and dimensionless numbers, Turbulent flow, Friction factor and drag, coefficient, Packed bed and fluidized bed system. Heat Transfer: Introduction to three types of heat transfer, Conductive Heat Transfer-Fourier s Law of Heat Conduction, Thermal Conductivity of Materials, Differential Equation for Heat Conduction in Rectangular, Cylindrical and spherical coordinate systems, Nondimensionalization and dimensionless numbers, solved examples of heat conduction. Convective Heat Transfer : Differential heat transfer/fluid flow analysis for forced and natural convection, non-dimensionalization and dimensionless numbers, concept of heat transfer coefficient and correlations, solved examples. Radiative Heat Transfer : Black body radiation, Plank s equation, radiative heat exchange between two black bodies, heat transfer between two black walls in an enclosure, Grey Body, Effective view factor, Radiation through absorbing media, Solved Examples. Mass Transfer : Diffusive mass transfer in solids, differential analysis of convective mass-transfer, non-dimensionalization and dimensionless numbers, concept of mass transfer coefficient and correlations, solved examples. Use of and a CFD package and its application to steel industry : Processes for primary steel making, The oxygen steel making and its variations, Slag formation and refining reactions in steelmaking, Secondary steelmaking, Injection", "page": "MT61334: Rate Phenomena In Steel Technology"}]