[{"chunk_id": "info_04776c", "title": "MT61304: Steel Making Process - Quick Facts", "text": "MT61304\nCourse name | STEEL MAKING PROCESS\nOffered by | Metallurgical & Materials Engineering\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | {{{semester}}}", "page": "MT61304: Steel Making Process"}, {"chunk_id": "0e92a544", "title": "Syllabus mentioned in ERP", "text": "A brief history of early steel making process, Evolution of the converter steel making process, Characteristics of hot metal in India; Physico-chemical principles of hot metal pretreatment practices. Advent of the top blown L.D. steel making process and the bottom blown BOP and CLU processes, evolution of the combined blowing process Physicochemical principles of refining in top blown L.D. Process and bottom blown Q-BOP process. Effect of combined blowing on slag chemistry, Metal yield and the kinetics of the metallurgical reactions, L.D. converter dynamic control. Evolution of steel making processes, practice of a basic open hearth furnace, advantages of oxygen lancing into the bath. Basic electric arc furnace steel making, charge mix, Melting and refining practice- single and double slag practice, relative advantages and disadvantages. Melting of sponge iron in electric furnace. Recent innovations like- ultra high power furnace innovations like ultra high power furnaces and DC are furnace. Possible Measures for energy conservation. Deoxidation and Inclusion Modification, Secondary steel refining technologyPrinciple of vacuum degassing of liquid steel; tank and circulation degassing (RH, D-H, RHOB, RHPB) processes, submerged powder injection and cored wire injection for desulphurization; inclusion modifications, manufacture of IF steels. Lade furnace practices-ASEA-SKF and Finkl Mohar, Practical examples on modeling of ladle stirring operations. Continuous casting of steel-Design of the tundish, control of liquid metal flow from ladle to tundish and tundish to mould-prevention of gas packup, Vortex formation, elimination of dead zones in the tundish-design and placement of dams weirs and porous plugs in the tundish. Design of continuous casting mould and withdrawal system, mould flux and mould vibration; Effect of process parameters on defects in cast billets; Problems of continuous casting high carbon steels. Thin strip casting-recent advances in the twin drum process of thin strip casting, control of microstructure of the thin strip, heat transfer principles involved. Thermodynamic and related calculations in steel making â equilibrium constants, vaporization losses, residual gas content after vacuum degassing, stirring energy in a gas stirred and in an induction stirred bath, coagulation and flotation of inclusions etc. Applications of heat and material balance to steel making processes- estimation of temperature , melt composition, etc.", "page": "MT61304: Steel Making Process"}]