[{"chunk_id": "e273eb37", "title": "MT Hall Day Incident", "text": "On March 7th 2014, during MT Hall day students damaged furniture, threw them from the top floor and made graffiti on the walls. In some rooms fans were also bent. The event was widely condemned by authority and student community. [ 1 ]", "page": "MT Hall Day Incident"}, {"chunk_id": "621c1296", "title": "Details", "text": "Images:\n• Bent Fan\n• Things thrown from top floor\n• Vandalized bed\nThe hall day proceedings started at about 7 pm as usual. This was the first hall day for the UG 1st year students (who joined the institute in July 2013). A soft rule was put in place requiring girls who had invited their male friends to come to the door and escort them inside. This rule was not enforced very rigidly. Security at the gates of the hall checked the ID Card of every student who was going into the hall.\nAfter entering the hall, students were milling around for about an hour or so, understanding the geography of the hall presumably and taking it all in, because this was the only day that they were going to be allowed inside the hall for the next 1 year. This was also the first time that they had a taste of the hall day culture. Much had been made of this tradition by most seniors from societies that about 1/4th of the UG 1st year batch were part of.\nAround 8:15 PM, trouble started when some unruly activities started on the top floor where some first year female students lived. Boys were being pushed out of the room and boxes of surf, tubes of toothpaste were being dumped and squeezed onto their clothes. Presumably, the girls residing in these rooms did not say anything to stop this distressing behavior (perhaps even vocally supporting it) and allowed the act to continue. Quickly, things escalated to a point where mattresses and pillows were being thrown from the second and first floors onto the garden on the ground floor which had been fixed for the Hall Day. Even until this point, this was nothing more than a joke. This is where the tone of things changed into a competition.\nMembers of various societies started forming human chains and singing songs and marching around the floors and the stair cases. These chains had both male and female members and they were going from a room of one of their members to another one of their members. Allegedly, all the members were from first year, and although seniors were residing in this part of the hall, they did not intervene.\nSome seniors from 3rd and 4th years were seen walking around the in the ground in the center of the hall where the mattresses were being thrown and trying to convince people vocally to stop throwing things and behaving in an unruly manner. This call to regain control and stop the events went mostly unheeded.\nThe whole destruction went on for about an hour unchecked, due to some gross mishandling by the MT Hall President, VP TSG and the hall security guards, who were present on the premises for the whole evening but did not act.\nAt 9:15 pm - 9:30 pm, the hall day was brought to an end (approximately 30 minutes before the scheduled end), and everyone was asked to leave. All the men were herded around and summarily expelled from the hall. The mood among most students was celebratory. It is safe to assume that the destruction that they had done and the consequences of the same had not yet sunk in. After the hall-day, discussion regarding what happened was mostly done with a fair bit of humor and the event was filed away in memory for nearly 2 weeks. Some girls whose rooms were trashed talked about how it was unfair for their LAN ports to be broken and their only fault being that they had invited their friends into their rooms.", "page": "MT Hall Day Incident"}, {"chunk_id": "4ddc5bee", "title": "Timeline", "text": "MT Hall Day 2014 | 7th March, 2014\nFirst official communique from VPTSG condemning the event | 9th March, 2014\nFirst meeting between the VP TSG, TSG office bearers and UG 1st year batch | 19th March, 2014: 6 pm\nSecond meeting between the VP TSG, Hall presidents of several senior halls and entire UG 1st year batch | 19th March, 2014: 9 pm\nInterrogation of girls from MT | -- TODO -- (This will be a range)\nList of students who were to be punished with 2 months of community service released | -- TODO --", "page": "MT Hall Day Incident"}, {"chunk_id": "c47fc799", "title": "A list of things that happened", "text": "• Fans bent out of shape (see image)\n• Beds thrown from as high up as the third floor onto the ground floor\n• LAN ports broken\n• Obscene phrases on the walls of some rooms (references to the male and female reproductive organs using slang terms in English and Hindi)", "page": "MT Hall Day Incident"}, {"chunk_id": "5da5b5f0", "title": "Administration", "text": "At the time of this event, the following were the people who held different important positions.\nPosition | Office bearer\nPresident TSG | Prof. Joy Sen\nVice President TSG | Apoorv Jain\nUndergraduate Representative to the senate | Ishan Garg\nDean (Student Affairs) | Prof. N R Mandal\nHall President (MT Hall) | -- TODO --\nHall President (SN/IG Hall) | Shriti Bhosale", "page": "MT Hall Day Incident"}, {"chunk_id": "6b24b54f", "title": "Emails sent by the VP TSG", "text": "The Vice President (TSG) at the time of the incident was Apoorv Jain. On 9th March, 2014, he sent an email to all students enclosing images of the destruction caused. He severely condemned this event. The attached images immediately found their way to Facebook, and subsequently to Quora where several questions asking \"why\" these events had happened at a prestigious institute such as IIT Kharagpur. As most first year students were dazed by the destruction they had enabled and participated in, no one had thought or been allowed to take pictures before being expelled from MT Hall. Pictures that did exist had not been widely circulated or posted on Facebook. So, in essence, if the VP TSG had decided not to include pictures of the destruction in his email, there would have been none in public circulation for anyone to look at.\nDear Students, This letter is in regards to the recent occurrence of damage to institute property on 7th March, 2014 during Mother Teresa Hall Day. In a span of fifteen minutes, furniture in the rooms of several first year undergraduate students was either broken, damaged beyond repair or thrown from the top floors. Furthermore, the walls were defaced with obscene graffiti. The fact that few students indulged in such act of vandalism reflects poorly on the entire student community of IIT Kharagpur. This heinous act of mass wreckage showed lack of respect for institute property and, more importantly, lack of character and morals in the offenders, and has left the student community of IIT Kharagpur equivalent of street ragamuffins. This kind of crude behaviour as shown in pictures attached is not expected of students of the forerunner of the IITs. IIT Kharagpur is not a mere academic institution, we boast of a rich fraternal culture, which is developed through a deep sense of gratitude towards the institute. Sadly, incident like this have raised a question on whether our freedom is compromising our civility and whether we deserve such infrastructural facilities. We, the Office bearers of Technology Students' Gymkhana and all Hall Presidents are extremely disturbed by this irresponsible and dishonourable behaviour of our own students. Visibly, students have failed to capture the real essence of Hall Days. We hope students understand the gravity of the situation and refrain from such undignified activities in future. Thank you With Regards Apoorv Jain VP,TSG\nOn 19th March, 2014, at around 8 am, he sent this email to all the UG 1st year students.\nDear Students, Today, Prof N R Mandal (Dean, SA) will address all the UG 1st year students regarding MT Hall Day incident. So, all the students are kindly requested to be present in Netaji Auditorium at 6.30 pm. Thank you With Regards Apoorv Jain VP,TSG", "page": "MT Hall Day Incident"}, {"chunk_id": "e5d16161", "title": "First meeting", "text": "On 19th March, 2014, the whole UG 1st year batch (students who joined in 2013) was called for a meeting at Netaji Auditorium at 6:30 pm. Apoorv Jain sent out this email at around 8 am that morning.\nThis meeting was attended by then Dean (Student Affairs) Prof N R Mandal, then President TSG Prof. Joy Sen, VP TSG Apoorv Jain and a few hall presidents. The turn out at the 6:30 pm meeting was very less. (approximately 50-70 people out of a total UG 1st year batch of 1400 people)\nThe meeting was delayed and students who were present there were intimidated into manually calling their friends to the venue, this marginally increased the turn out. The intimidation was done by the VP TSG who was present there, along with some fourth year hall presidents who were visibly angry and disappointed with the turnout. Absurd threats were made against the few obedient students who had turned up. Eg: Agar tumhara pura batch yahan nahi aayega, to yahan pe jitne bhi log hain, tum sab pe DC baithegi. Phir udhar jaake jawaab de dena. (If your whole batch doesn't get here, all of you who are present here will be acted upon by the Disciplinary Committee. You can then explain your situation there.)\nAround 7:30 pm, the professors arrived at Netaji Auditorium . A long address followed. Students present at this meeting were informed that the 12 day delay was because of then DOSA Prof. N R Mandal being out of station and thus being unable to act on the events. This delay was not to be misinterpreted as an unwillingness to act. Allusions were also made to the VP, President and other professors of the institute getting phone calls from alumni regarding the MT Hall Day incident. One of the things that stood out at this meeting, which was discussed for several weeks after this meeting, was Prof. Joy Sen's famous reference to the 1979 Mel Gibson classic Mad Max . He particularly pointed out the end of the 1979 movie where Mel Gibson's character Max loses control over himself, after losing his family, and kills several members of the gang that was involved in the death of his wife and his infant son. Prof. Sen's was trying to draw an analogy between the behavior of a few out of control freshman and the protagonist in a movie who does something explicable, but rather bizarre. While most people at this first meeting had not seen the movie Prof. Sen was talking about, it was clear to almost everyone present that he was grappling with what had happened and trying to make sense of it using the appreciated principle of \"life imitating art\"\nStudents present there were also informed by the VP TSG that there was widespread disappointment in the behavior of the UG 1st year students, and that since the General Championships had been suspended right after the incident on 7th March, there was considerable anger among students in senior batches.\nAll professors present at the meeting were irritated with the low turnout and left about 1 hour after the meeting started in an agitated state. Apoorv Jain then decided to convene a complete UG 1st year batch meeting at 9 pm that night. There was widespread panic about what the consequences would be. There were several threats (such as mass Disciplinary Committee action, barring from placement, etc) which were indirectly made by the VP TSG and other hall presidents present at the meeting. The ultimatum was to get the whole batch at Netaji Auditorium at 9 pm and then, the discussion would be about the possible recourse that could be taken to mitigate the event's fall out.", "page": "MT Hall Day Incident"}, {"chunk_id": "23d83ca8", "title": "Second meeting", "text": "The second meeting began at 9 pm and saw much higher turnout, with almost the whole UG 1st year batch turning up. People were found in MMM and LBS Halls of residences literally running around calling their friends and everyone in 1st year to this meeting. There was widespread panic regarding the threats that had been made. Notably, none of the professors came to this meeting. The meeting was attended by the hall presidents of Patel, Nehru, MT, SN/IG, apart from then VP TSG. This was viewed as a scare tactic, as some of the hall presidents referred to the absence of Orientation Procedure / OP for first years was somehow responsible for this behavior. Their direct implication was that people were running around wild because they had not been \"trained in the ways of KGP\". Referring to the suspension of the GCs as a result of the main incident, one of the Hall Presidents said, Tum logon ko pata nahi hain ki iska kya matlab hain, sab log bahut gusse mein hain. Agle sal jab tum log senior hall jaoge to tumhe pata chalega (You don't know about the importance of the GCs being suspended, everyone is angry about this. You all will face the consequences for this next year, when you go to senior halls)\nSome of the options discussed in this meeting included a reduced community service for the whole UG 1st year batch, so as to save a few people from getting a lot of the punishment. When the students present in the auditorium were asked, Are you all willing to take the blame and stay back and do community service for the summer, so that not just a few of your friends face really bad consequences? , a few students immediately shot down the idea. The general consensus among students who had not attended the hall day, had not witnessed the incident, and/or were completely not involved in the incident was that they should not have to pay with their time for the mistakes of a few groups of people.\nThe VP TSG made an effort to try to get traction for the shared punishment idea. He asked if anyone would like to defend it and try to convince their batch mates. Understandably, students who had been spotted by many people as being the main players in the destruction were in total support of this idea of shared blame to reduce the punishment. They were seen visibly confused and voiced their concerns with one student standing up and addressing the rest of the auditorium: Dekh lo yaar, sab log lenge blame toh sirf ek mahina rehna padega, nahi toh pata nahi kya hoga. (If everyone takes the blame, the punishment will be very less and everyone would have to stay back only for 1 month. If not, we don't know what the punishment might be)\nTensions were even higher than at the previous meeting because for the first time Apoorv Jain said that one of the common punishments doled out after disciplinary committee hearings were \"semester backlogs which implied that a student will be disbarred from registering for one semester and hence would be unable to complete their course on time. Apart from this, this would also be in the official record of the student including the final grade transcript.", "page": "MT Hall Day Incident"}, {"chunk_id": "14ff5e4a", "title": "Consequence", "text": "A group of 27 1st year students were told to undergo community service for 2 months during the summer months of May and June 2014. There was no other official record made anywhere regarding this event. [ unverified ]", "page": "MT Hall Day Incident"}, {"chunk_id": "553671b6", "title": "Discussion", "text": "The events of MT Hall Day 2014 were a classic case of the Bandwagon effect. The destruction was started by a small subset of people attending the Hall Day. It started as a joke, and eventually turned into a competition between the various societies on campus.\nInterestingly, some of the women who resided in the hall, who were acting as hosts in the hall day decided to preclude the possibility of destruction by locking themselves inside their rooms and not letting anyone in. Some of the male friends of these women who had locked their doors to outsiders then tried to fish them out of there by filling buckets with water and then throwing them into the room using the slit under the door. It must be noted that a similar method is used to lure cockroaches out of hiding spots in kitchen drains, that must definitely have been the source of this particular strategy.\nWhile some other women decided to give in, and some even participated in the destruction of their friend's rooms. Claims can also be made about this being a direct application of the herd behaviour in real life. There have been several riots in the past that have been attributed to this particular characteristic of human behaviour.\nOn a brighter side, there were people who were trying to stop this from happening. Shushman Choudhury (CS, '15) was on the ground floor and was trying to stop people from throwing down mattresses by shouting at them. He gave up after about 15 minutes of this (it was rather dangerous to stand on the ground floor where the possibility of a mattress hitting you is non-significant), but it must be said that it must have taken considerable courage to even try to do something like this against a mob, that for all practical purposes, had lost all control on themselves and had stopped computing the turn of events, the consequences of the same and the state of the hall as it stood around them.\nLess attention is paid to the aftermath and the administration's response to this event. The administration decided to witch-hunt a small group of people and decided to get a list of names and proceed with punishing them. They decided to talk to the women whose rooms were trashed in an attempt to get the names of their male friends who did the trashing out of them. This strategy didn't work out well at first. Most women flat out refused to talk. Soon, the administration started using the only chip they had: threatening the woman with disciplinary proceedings for not cooperating. Soon enough, it was clear to all the women that this was not going away and that they had to come up with names or get ready to face the heat of saving their friends.\nGiven a choice, several women chose to name a few friends who they thought would be wildly off the administration's radar and it would be very hard to actually punish them because it would be obvious to everyone that these people were not responsible, but the administration didn't care about this and went ahead and prepared the list of 40-50 people who were going to do the community service in the summer. This list had a few people who had been included because only the first name had been provided by the women and there were several people with that name in the UG batch. One such person got his father to fly out to Kharagpur and talk to the director directly about what was going on and why this kind of mob justice was being handed out. His name was removed from the list subsequently.\nThe names of some other people were also included in this list although their connection to the events was non-existent. People who had been at home during the weekend of the events or who had been in the hall for a very short period of time were on this list. Some people were able to get their names off the list.\nThe administration's tactics were simple: they set about intimidating 18 year olds into tattling on their friends. While many might imagine that in the same situation, they would have behaved in an honorable manner, one is forced to imagine what the conditions must have been like if nearly 50 names could be squeezed out of a population of highly un-cooperative women.", "page": "MT Hall Day Incident"}, {"chunk_id": "67d0b1d1", "title": "See Also", "text": "• Hall Day", "page": "MT Hall Day Incident"}, {"chunk_id": "a3b4a02b", "title": "References", "text": "↑ \"Open Letter of Condemnation | MT Hall day\" - VP TSG 2013-2014 Apoorv Jain", "page": "MT Hall Day Incident"}]