[{"chunk_id": "info_7544a0", "title": "NA21001: Marine Hydrodynamics - Quick Facts", "text": "NA21001\nCourse name | Marine Hydrodynamics\nOffered by | Ocean Engineering & Naval Architecture\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n3 4 7 6 9 10 2 EX A B C D P F | 3 | 3 | 4 | 4 | 7 | 7 | 6 | 6 | 9 | 9 | 10 | 10 | 2 | 2 | EX | A | B | C | D | P | F\n3 | 3 | 4 | 4 | 7 | 7 | 6 | 6 | 9 | 9 | 10 | 10 | 2 | 2\n3\n4\n7\n6\n9\n10\n2\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "NA21001: Marine Hydrodynamics"}, {"chunk_id": "ffa01ada", "title": "Syllabus mentioned in ERP", "text": "Prerequisite: NoneRecapitulation of motion of a viscous fluid: conservation of mass and momentum, transport theorem, Eulers equations, NS equations. Motion of an ideal fluid; irrotational flow, Bernoullis eqn, simple potential flow. Sources and sinks. Complex potential and conformal mapping. Fixed bodies and moving bodies. Greens theorem and distribution of singularities. Forces on a moving body in unbounded fluid: added mass. Lifting surfaces: lift and drag on aerofoils. Kutta Joukowski Theorem. Surface gravity waves: free-surface conditions, plane progressive waves. Wave oscillation in closed and open basins, Waves generated by a moving body. Basics of various classes of freesurface marine hydrodynamic problems: steady motion, wave-effects on marine structures.", "page": "NA21001: Marine Hydrodynamics"}, {"chunk_id": "8c485d1f", "title": "How to Crack the Paper", "text": "Course is slightly on the easier side. Lot of things will already be taught to you in the fluid mechanics course. Just go to all the classes that's it. Sir in this course might sound boring, but the paper is straight from his notes. No changes at all. If you attend his classes, the only time you will be studying this subject is the day before the exam!\nOne more helpful thing about this course is that the entire course is available on NPTEL taught by the same professor!", "page": "NA21001: Marine Hydrodynamics"}]