[{"chunk_id": "info_e7940d", "title": "NA31005: Resistance And Propulsion - Quick Facts", "text": "NA31005\nCourse name | Resistance And Propulsion\nOffered by | Ocean Engineering & Naval Architecture\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n1 8 7 9 6 3 EX A B C D P F | 1 | 1 | 8 | 8 | 7 | 7 | 9 | 9 | 6 | 6 | 3 | 3 | EX | A | B | C | D | P | F\n1 | 1 | 8 | 8 | 7 | 7 | 9 | 9 | 6 | 6 | 3 | 3\n1\n8\n7\n9\n6\n3\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "NA31005: Resistance And Propulsion"}, {"chunk_id": "946717f0", "title": "Syllabus mentioned in ERP", "text": "Components of ship resistance; Dynamic similarity; Froude hypothesis; Viscous resistance; Laminar and turbulent flows; Effect of roughness; Friction lines; Form resistance; Wave resistance; Kelvin wave pattern and waves generated by a ship; Wave interference; Air resistance; Appendage drag; Ship resistance in shallow water; Resistance data presentation; Estimation of effective power methodical series and statistical methods- Hull form and resistance. Screw propeller geometry; Propeller theories; Laws of similarity for propellers; Propellers in (open) water; Propeller coefficients and design charts; Hull propeller interaction - wake, thrust deduction and relative rotative efficiency; Propulsive efficiency and its components; Propeller cavitationPropeller blade strength; Propulsion experiments- Propeller design; Speed trials and service performance analysis; Unconventional propulsion devices.", "page": "NA31005: Resistance And Propulsion"}, {"chunk_id": "826fcac4", "title": "How to Crack the Paper", "text": "I think I can be one of the best persons in answering this question, I would request everyone to attend the lectures and the materials offered by the professors, during my tenure at IIT KGP, this course was taught by Prof. O P Sha & Prof. V Nagarajan (Two best professors in the Dept.).\nEnsure to understand the theoretical concepts and practice examples over the same.", "page": "NA31005: Resistance And Propulsion"}, {"chunk_id": "9494efe1", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | In Dept\nThursday | In Dept\nFriday | In Dept | In Dept", "page": "NA31005: Resistance And Propulsion"}]