[{"chunk_id": "9d9f4b44", "title": "National Students%27 Space Challenge", "text": "The National Students' Space Challenge , abbreviated as NSSC , is an annual event organised by the Space Technology Students' Society . It is India's first and the largest Space Technology and Astronomy themed fest, held in the Autumn Semester.", "page": "National Students%27 Space Challenge"}, {"chunk_id": "b87a6a36", "title": "History", "text": "The first edition of NSSC officially started on August 27, 2011; seeing a large participation in its first edition itself. Since then, it has been held during the months of September-October with exponential growth in participation every year. The eighth edition of NSSC, held in 2018 has concluded recently.", "page": "National Students%27 Space Challenge"}, {"chunk_id": "c5161b10", "title": "Description", "text": "Going by the name of Space Technology Students’ Society (spAts), this is the official student body under the Kalpana Chawla Space Technology Cell (KCSTC) , which is the contact point of Indian Space Research Organisation (ISRO) at IIT Kharagpur. This student group has conceived and bred the first and the only fest in India that is solely dedicated to Space Technology - National Students’ Space Challenge (NSSC).\nNSSC saw the light of day in 2011 when it saw a prolific response from all over India in its very first year. In 2012 the fest witnessed an exponential growth in student participation. And from then, NSSC grew to both in popularity and diversity. The fest primarily focuses on giving hand on experience to the students in solving real time technological problems faced in exploring the far reaches of Space and also conducts workshops to guide the present generation. The Fest organises multiple Technology applied competitions - varying from robotics, machinery, rocketry science to data applications; various workshops like on the field of airplane design, satellite construction, observational astronomy and others; several presentations and case study events; quiz event and other Astronomy related events; along with Guest Lectures and Webinars from prominent personalities from Space organisations and Universities in India and abroad.\nVisit the official site at http://nssc.in", "page": "National Students%27 Space Challenge"}, {"chunk_id": "d3a68c04", "title": "Mission", "text": "NSSC primarily motives on inculcating a culture of Space Technology, inspiring and promoting research in space applications, technology, astronomy, astrophysics and related fields; and broadening the horizons of the student community to cosmic research by interacting with eminent scientists, professionals and technicians working in Space Application and Research based Organisations throughout the world. The fest primarily focuses on giving hand on experience to the students in solving real time technological problems faced in exploring the far reaches of Space and also conducts various Workshops on a variety of topics like airplane design, satellite construction, observational astronomy and others. Many Guest Lectures and Webinars given by prominent personalities are organised during the fest which were based on diverse Astrophysical and Space Application areas.", "page": "National Students%27 Space Challenge"}, {"chunk_id": "10157cbe", "title": "Reference Links", "text": "Official site of the National Students' Space Challenge (NSSC) - http://nssc.in\nFacebook page - https://www.facebook.com/nssc.iit/\nOther useful links - YouTube | Twitter |\nOfficial page of Space Technology Students' Society - https://www.facebook.com/spAts.iitkgp/", "page": "National Students%27 Space Challenge"}]