[{"chunk_id": "f73a2a80", "title": "Ocean Engineering %26 Naval Architecture", "text": "Department of Ocean Engineering & Naval Architecture\nBeing the first of its kind in the country, the department was established in 1952. during the last 60 years of its existence, the department has made significant contributions to the development of shipbuilding and shipping industries in the country including the Indian Navy, Indian Coastal Guard, DRDO and other allied organisations. The department and its alumni have important and strategic links with universities round the world and major shipyard and dock organizations in our country. In addition to teaching and training at the various levels of bachelors, masters and doctoral programs, the Department is also actively involved in various research and industrial projects sponsored by government, research organizations and industry. Some of the sponsored projects include Standard Hull Design for Mechanised Craft, Energy Audit of Ships and Scheduling of Propeller Maintenance, Development of Design Rules for Composite Ships and Boats, Computation of 3D Ship Motion and Sea Load. Ocean Engineering & Naval Architecture is a discipline that embraces diverse areas of engineering sciences. In a broad sense, this discipline is concerned with design, development, operation and planning of systems that operate in the marine and ocean environment. Areas of study under this include marine vehicles for cargo and passenger transportation, offshore activities, ocean mining, ocean and marine hydrodynamics, harnessing of non-conventional energy sources etc., reflecting the diversity of the field. In order to provide a multidisciplinary knowledge base, the course curriculum is framed by integrating many disciplines in engineering sciences, physical sciences, mathematics, humanities and management. The academic programs prepare students for a highly rewarding career in this rapidly expanding field. The academic and research programs are designed emphasizing on cutting edge knowledge in the subject areas of marine structures, hydrodynamics, ocean environment, hydroelasticity, offshore technology, design of marine vehicles & systems, coastal engineering, marine production and planning, coastal processes. Various laboratories of the Department provide opportunity to the students to gain valuable practical `on-hand’ experience. Laboratory work and design projects are incorporated extensively throughout the academic curriculum by means of the core and elective courses. You can refer to the department's website for more information.", "page": "Ocean Engineering %26 Naval Architecture"}, {"chunk_id": "d82a229d", "title": "Research Areas", "text": "Ship dynamics\nMathematical modelling\nCoastal Hydrodynamics\nWave and Tidal Energy\nComputational Weld Mechanics and Welding Technology\nShip Structures Structural Engineering Composite Materials Naval Architecture.\nFree Surface Hydrodynamics\nMarine Hydrodynamics\nMarine Structural Engineering\nWind-Wave Modeling\nMarine Acoustics\nCoastal Processes\nCoastal Sediment Dynamics\nPhysical & Dynamical Oceanography\nMarine Design and Production\nWave past porous structures\nMarine Dynamics\nVibrations\nHydroelasticity\nPort & Harbour Engineering\nOcean Wave Climate Projections\nDynamics of Marine Vehicles\nSeakeeping and Maneuvering\nBoundary value problems\nWave-Structure Interaction\nWave Energy Converters\nHydroelasticity of Floating Structures and Ships\nTurbulence Modeling in Oceanography\nComputational Fluid Dynamics\nMarine operation for subsea installation\nStructural vibration control\nWave Structure Interaction\nStructural Health Monitoring\nFluid Structure Interaction\nComposite Structures\nTidal energy", "page": "Ocean Engineering %26 Naval Architecture"}, {"chunk_id": "e6478e95", "title": "Thrust Areas", "text": "CFD, Coastal Marine Hazards, Marine and Ocean Hydrodynamics, Numerical Hydrodynamics, Ocean Structures, Marine structural analysis, Ocean Wave & Circulation Modeling, Marine Design, Coastal Processes, Storm Surge Prediction & Tsunamis, Suspended Sediment Dynamics, Hydroelasticity, Marine Acoustics.", "page": "Ocean Engineering %26 Naval Architecture"}, {"chunk_id": "45bdc09b", "title": "Facilities", "text": "1 Ship Hydrodynamics Laboratory - The laboratory consists of a towing tank 150m long, 4m wide and 2.5m deep and equipped with a towing carriage of maximum speed of 6m/sec. The towing carriage has resistance and propulsion dynamometers with NI based hardware to control the carriage speed and Labview based data acquisition system. A 2D wave maker, single paddle, wetback type with AWACS (Automatic Wave Absorption and Control System) that can generate regular and irregular waves up to 40cm wave height and up to 3 sec wave period is installed at one end of the towing tank. The laboratory has a GPRS linked, Motion Recording Unit (MRU) that can record all 6 DoF. The hydrodynamics laboratory conducts resistance, propulsion and seakeeping experiments for ship models. The laboratory also has a 3-D velocity component measuring unit (acoustic type) for measuring flow dynamics around submerged body /sediment flow. The laboratory has underwater load cells for measuring mooring loads on floating structures\n2 Circulating Water Tunnel - A circulating water tunnel with a test section of 6m long, 2m wide, 1.5m deep and water speed of 1m/sec with flow control facilities enables studies of flow around floating and submerged bodies as well as measurement of sediment transportation.\n3 Welding and Marine Construction Laboratory - This laboratory is equipped with various welding units, namely submerged arc welding, shielded metal arc welding, friction stir welding and gas welding. The laboratory also has a set up plate forming using line heating. The welding units have suitable computer support for data acquisition and analysis. Work carried out in this laboratory is in the area of welding simulation, residual stress, weld induced distortion and control.\n4 Structure and Vibration Laboratory - The laboratory is equipped with a 50kN Universal Testing Machine complete with all accessories to carry out experiments with tensile, compressive and bending loads. The equipment also has a multipoint digital strain data logger.\n5 Model Making Workshop - To support the experimental activities for the above mentioned laboratories, the Department has a well-equipped workshop to fabricate ship models and other accessories for experiments. The models are made of wax, wood, fibre glass, perspex, foam, etc.\n6 The Department also has a Computational Hydrodynamics Laboratory (sponsored by Naval Research Board) and a CAD Laboratory. In addition, there are two more RS and MTech laboratories. Each research scholar is provided with a desktop computer along with required accessories including internet connection. The laboratories of the Department are equipped with various softwares like WAMIT, ORCAFLEX, NAPA, MAXSURF, MULTISURF, SHIPFLOW, CD-ADAPCO, STAAD, ANSYS Aqua, SIMO, Symbols Grapher, Rhinoceros, FLUENT, Midas Civil for structural analysis, Photomodeler for programmatic measurements, ADCIRC, SACS etc. The Department is continuously upgrading the hardware and software facilities of all the laboratories with state of the art instruments and data acquisition systems.", "page": "Ocean Engineering %26 Naval Architecture"}, {"chunk_id": "c32488a5", "title": "References", "text": "↑ http://www.iitkgp.ac.in/academics/?page=acadunits&&dept=NA ↑ http://www.iitkgp.ac.in/academics/research.php?deptcode=NA ↑ http://www.iitkgp.ac.in/academics/thrust.php?deptcode=NA ↑ http://www.iitkgp.ac.in/academics/facilities.php?deptcode=NA", "page": "Ocean Engineering %26 Naval Architecture"}]