[{"chunk_id": "info_bf7fbd", "title": "Open Soft - Quick Facts", "text": "Open Soft\nGC Type | Technology\nCup | Application Cup\nEvent Type | Team\nPoints | 100", "page": "Open Soft"}, {"chunk_id": "fac42edb", "title": "Open Soft", "text": "A problem statement containing specifications of the software to be developed and related constraints is released to public at the start of the competitions. Each hall then works through their solution over the stipulated even period (minimum 21 days) to make a submission. Later, each hall presents their solution to a panel of internal and external judges who then award marks and accordingly rank the teams.", "page": "Open Soft"}, {"chunk_id": "2672c04a", "title": "Objective", "text": "The objective of the task of DigiCon was to allow a doctor to write his prescriptions the conventional way. The prescription will be scanned and a handwritten character recognition will be followed to capture the data (name of patient, details, symptoms etc) written by the doctor. The present state-of-the-art hand written character recognition was not up to an acceptable level hence an error correction mechanism was to be applied on the existing mechanisms to reduce the errors. The solution should be mostly software with minimum to none hardware requirement.", "page": "Open Soft"}, {"chunk_id": "c1802ae9", "title": "Objectives", "text": "1. The photos would be geo-tagged. That means the publisher of a photo also mentions the location where the photo has been taken and the topic of that photo (like flower, market, nature etc.). There can be a fixed set of topics. During the photo upload, EthPhoto will ask for the topic, and the user needs to enter it.\n2. The front-end of the application is a map (you may use OpenStreet Map), on which every users can see the photos that have been uploaded to EthPhoto. If I go to a specific location, I should be able to see all the photos tagged with that location.\n3. Apart from the location based photo tagging, a user can also browse the photo based on topics. Once a user clicks on a photo, the DApp also shows the location information tagged with that photo.\n3. Only the publisher (the user who has uploaded the photo) of a photo can delete that photo.\nComplete PS can be found here .", "page": "Open Soft"}, {"chunk_id": "88dfe0e7", "title": "Result", "text": "• RK Hall\n• Azad Hall\n• MS Hall", "page": "Open Soft"}, {"chunk_id": "b51a8824", "title": "2015-2016: Plots to Tables", "text": "Convert plots from PDFs (like research papers converted to PDFs) to tables.\nComplete PS can be found here .", "page": "Open Soft"}, {"chunk_id": "e16c2d42", "title": "2014-2015: Design a Graph Calculator", "text": "The problem statement for year 2014-2015 was to create a 2D/3D GUI graph plotting tool. Architectural specification required the tool to:\n1. Allow the users to enter as many functions as he/she wants to plot in a single image.\n2. Allow the users to view the graphs, and if not satisfied, replot the graph with different parameters.\n3. The plots for different functions should use different features (like color, line types, line widths etc)\n4. Allow the users to explicitly choose graph properties, like color, line types, line widths etc\n5. The application should support both 2D and 3D graph plotting. For 3D plotting, the users should be able to explicitly specify the orientation of the axis.\n6. The users should be able to store the graph in file formats of his/her choice. The application should support at least one vector graphics (like eps, pdf etc) and at least one raster graphics (png, jpeg, bmp etc) file format.", "page": "Open Soft"}, {"chunk_id": "4aec412f", "title": "2013-2014: Automated mosaicing of torn paper documents", "text": "The problem statement was to come with an algorithm which can stitch more than 50 pieces of a torn document.", "page": "Open Soft"}]