[{"chunk_id": "20e5ed71", "title": "Openvpn on institute proxy", "text": "Following this article, you can create your own personal VPN server at the cost of $0.005/hr ($3.6 per month) on Amazon Web Services Free Tier. A maximum of 2 users can connect to this VPN.\nCurrently, there are many available Free VPNs which we can connect using TCP 443 protocol. And we get decent internet connection speed using those. Problem with that VPN is that if the load on the server hosting the VPN increases resulting in poor internet connectivity. And mostly the VPN servers that we connect are hosted outside our country, resulting in poor ping while gaming as well.\nLet's get started:\n• Follow this complete tutorial (read the Note before following the instructions in the tutorial) to setup your OpenVPN server link to the tutorial . Note : Do not forget to change your server location Default is N. Virginia change it to Asia Pasific (Mumbai). And while doing ssh use Mobile Data connection. When you will SSH You will need to enter the preferences for your OpenVPN server. While entering the preferences just go by default values except in some places , when you are asked : Please specify the network interface and IP address to be used by the Admin Web UI: [Select] 1. Should client traffic be routed by default through the VPN? : [Select] yes. Rest all will be default values.\n• Now when you will try to connect the VPN server with your institute wifi it will not work. You need to make some changes in the config file.\n• Lets say the elastic ip of your server is 13.234.132.123. Now go to the openvpn server page https://13.234.132.123 (your Elastic IP). And click on Yourself (user-locked profile) at the bottom to Download the config file.\n• Open the .conf file in any Text editor now we just need to focus on the lines 40-64 in the .conf file. This will look something like this:\nsetenv FORWARD_COMPATIBLE 1 client server-poll-timeout 4 nobind remote [Your Elastic IP] 1194 udp remote [Your Elastic IP] 1194 udp remote [Your Elastic IP] 443 tcp remote [Your Elastic IP] 1194 udp remote [Your Elastic IP] 1194 udp remote [Your Elastic IP] 1194 udp remote [Your Elastic IP] 1194 udp remote [Your Elastic IP] 1194 udp dev tun dev-type tun ns-cert-type server setenv opt tls-version-min 1.0 or-highest reneg-sec 604800 sndbuf 0 rcvbuf 0 auth-user-pass # NOTE: LZO commands are pushed by the Access Server at connect time. # NOTE: The below line doesn't disable LZO. comp-lzo no verb 3 setenv PUSH_PEER_INFO\n5. Now you need to change this portion of the file to look like the syntax shown below:\nsetenv FORWARD_COMPATIBLE 1 client dev tun proto tcp remote [Your Elastic IP] 443 tcp resolv-retry infinite nobind tun-mtu 1500 tun-mtu-extra 32 mssfix 1450 persist-key persist-tun auth-user-pass comp-lzo reneg-sec0 verb3\n6. Now in your OpenVPN application upload this config file and configure the proxy as well and Now you will be able to connect and use the VPN. Using this you can play games as well, like PUBG And Dota. Ping for PUBG was about 100ms, which is quite good.", "page": "Openvpn on institute proxy"}]