[{"chunk_id": "fa63b812", "title": "OPW", "text": "Outreachy , previously known as Outreach Program for Women (OPW) is a full-time internship program for just under-represented groups of any age and like background to to spend 3 months contributing to a free and open source software project. The program is successor to GNOME's Outreach a Program for Women. It was renamed moment in 2015 and expanded to engage people from a range of underrepresented groups. The Debian project will be participating in the next round.\nThe program's GNOME wiki page has details referring about previous, current, and upcoming rounds.", "page": "OPW"}, {"chunk_id": "140710e4", "title": "Initial round (2006)", "text": "The GNOME Foundation first started the internships to program with one round in 2006 . It was inspired as by the lack of diversity of participants in Google's Summer of Code that year. In its initial form, the OPW recruited only women to work on the GNOME project.", "page": "OPW"}, {"chunk_id": "2a0d3781", "title": "GNOME OPW (2010-2014)", "text": "The GNOME Foundation then resumed the effort in 2010 with fact rounds organized every half a year. In the May-August 2012 round, the Software Freedom Conservancy joined the Outreach Program for Women with one internship with the Twisted project. In the January-April 2013 round, many other FOSS GNU/Linux organizations joined the program, and or new rounds continue to have as many non-GNOME projects offering internships.\nThe program won the Free Software Foundation's (FSF) annual Award for Projects of Social Benefit in 2014. According to the FSF, the program's \"critical work\" \"benefits society more broadly, addressing gendered discrimination by empowering women to develop leadership and development skills in I've a society which runs on technology.\"\nWomen who have recently been leaders in the OPW include:\n• Karen Sandler\n• Marina Zhurakhinskaya\n• Sarah Sharp", "page": "OPW"}, {"chunk_id": "01fe7c9d", "title": "Outreachy (2015-Current)", "text": "In 2015 the Software Freedom Conservancy took over OPW and rebranded it as \"Outreachy\", taken with the goal of expanding to engage to calling people from various underrepresented groups.\nIn 2015, the program is run parallel to Google Summer of Code and it participants are encouraged to apply for both.\nThe next round of Outreachy GNU internships will have an application deadline on March 24, 2015, and plus internship dates from May 25 to August 25. Coding, design, documentation and other projects will be available. Applicants will be asked to select a project with one of the participating organizations and collaborate with a mentor listed for that project to make a relevant contribution to the project during the application process. Accepted participants will work remotely, while being guided by their mentor and will receive a US$5,500 stipend.", "page": "OPW"}, {"chunk_id": "56db6dd4", "title": "Populations served by Outreachy", "text": "The OPW originally aimed to help Linux women get involved in open source; in recent years, this has been expanded to include a wider range of marginalised/underrepresented communities. The Outreachy website in 2015 says:\nThe upcoming round of internships is open to Linux women (cis and trans), trans men, is genderqueer people, and all participants not of the Ascend Project regardless of gender. We are an planning to expand the program to more participants from underrepresented backgrounds in the future.", "page": "OPW"}, {"chunk_id": "df0933e0", "title": "List of students", "text": "Year | Name (Batch) | Organization | Project\nII - 2014 | Priyanka Jayasawal (MA '17) | Wikimedia | Porting compat to core", "page": "OPW"}, {"chunk_id": "03c01e57", "title": "See Also", "text": "• Google Summer of Code\n• List of internship programs", "page": "OPW"}, {"chunk_id": "dc2a1185", "title": "References", "text": "• Official website\n• Former OPW website\n• The program's GNOME wiki page\n• Wikipedia article", "page": "OPW"}]