[{"chunk_id": "d26e0377", "title": "Package blurbs", "text": "This page contains list of packages developed by MetaKGP contributors for the KGP community. If you wish to demo your project, come join us on DemoDay.\nMaintainer(s): @themousepotato\nCode: metakgp/wimp\nRunning around for a Professor's signature, not knowing when they're available? Fret not, for Where Is My Prof aims to solve the exact problem!\nChillZone\nMaintainer(s): @thealphadollar\n• ChillZone Backend\n• ChillZone Frontend\nChillzone helps students looking for an empty room during class hours in IIT Kharagpur by giving them a list of the rooms that are free in the various classroom complexes. Chillzone also shows the list of rooms that will be free for the next slot as well, which is useful for students who have a 2 hour break between classes.\nLeprechaun\nMaintainer(s): @icyflame\nCode: metakgp/leprechaun\nLeprechaun was envisioned as an authentication service which will associate an email address to an IIT Kharagpur Roll Number, using proof-of-control over the ERP account. Since only students of IIT Kharagpur have active ERP IIT KGP accounts, this service can only be used by students of IIT Kharagpur.\nMaintainer(s): @icyflame @nishnik\nGets your timetable from ERP and adds it to your Google Calendar or gives you an ICS file which you can add in any common calendar application.\nMaintainer(s): @icyflame @athityakumar @amrav @ghostwriternr\nCode: metakgp/mfqp\nWebsite for Question Paper Search\nMaintainer(s): @amrav @icyflame\nmftp monitors your ERP account for changes to the notices and the companies list, and sends you an email if there are any new or modified entries.\nNaarad\nMaintainer(s): @athityakumar @DefCon-007\nNaarad aggregates all your KGP related news from facebook pages to one place. This repository is mainly push updates to github pages, naarad-source is the main development repository.\nMaintainer(s): @hargup @athityakumar @kumarkrishna\nSearching for professors from given fields is easier than you thought. Reverse search enables to find professors from the field, say you need a list of all the professors working in nanomaterials.\nBlackjack\nMaintainer(s): @arunpatro\nBlackjack is a surgeon bot who adds past year grade distributions of courses on metaKGP. It searches for all the courses on metaKGP and populates their infoboxes with their previous year grade distributions, if available from ERP.\nHermes\nMaintainer(s): @ghostwriternr\nIITKGP has a lot of internal and public noticeboards that most students are not aware of, but will definitely benefit from. Hermes aims to solve this by monitoring the noticeboards and sending updates to students by email.\nVeritas\nMaintainer(s): @ghostwriternr\nThe greek goddess of truth, here to help Hermes with maintaining KGP's noticeboard data.\nPlay Next\nMaintainer(s): @nishnik\nHave you ever felt lazy? Not talking about extremity but I don't like changing songs one after other when they finish playing. I repeat I don't like opening a new tab and then searching for a song after which I play it only when the current song ends playing. This chrome extension is a dark knight for people like us. Now you can add songs from whichever tab you want even when the current song is playing and like an obedient queue it will play each song one after other.", "page": "Package blurbs"}]