[{"chunk_id": "info_92edce", "title": "PH11001: Physics - Quick Facts", "text": "PH11001\nCourse name | Physics\nOffered by | Physics\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n123 231 208 208 205 193 113 EX A B C D P F | 123 | 123 | 231 | 231 | 208 | 208 | 208 | 208 | 205 | 205 | 193 | 193 | 113 | 113 | EX | A | B | C | D | P | F\n123 | 123 | 231 | 231 | 208 | 208 | 208 | 208 | 205 | 205 | 193 | 193 | 113 | 113\n123\n231\n208\n208\n205\n193\n113\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "PH11001: Physics"}, {"chunk_id": "1214c7d3", "title": "Syllabus mentioned in ERP", "text": "Course Contents\nTheory Component : Overview of vibrations with emphasis on damped and forced oscillations, resonance, coupled oscillations, normal modes.\n• Wave Motion: longitudinal and transverse waves, wave equation, plane waves, phase velocity, superposition wave packets and group velocity, two and three dimensional waves, polarization.\n• Electromagnetic Waves: Maxwell’s equations, wave equation, plane electromagnetic waves, energy-momentum, Poynting’s theorem, electromagnetic boundary conditions, reflection and refraction, interference, Young’s experiment, interferometers, diffraction, Fraunhofer diffraction (single slit), dispersion, radiation.\n• Wave Mechanics: failure of classical physics, qualitative review of relevant experiments, de Broglie waves, uncertainty principle, wave function and Schrodinger equation, probability interpretation, particle on a chain, potential barrier and quantum tunneling, potential well, qualitative summary of simple harmonic oscillator and Hydrogen atom. Occupation probability and examples.\nLaboratory Component : Suggested Experiments\n• Oscillation in potential well\n• Normal modes of coupled oscillators\n• Measurement of velocity of acoustic waves\n• Newton’s rings\n• Specific rotation of an optically active source\n• Diffraction with laser\n• Dispersive power of a prism\n• Fresnel biprism\n• Franck Hertz experiment\n• Photoelectric effect\n• Measurement of band gap in semiconductors\n• Measurement of Hall effect", "page": "PH11001: Physics"}, {"chunk_id": "290e6b14", "title": "Concepts taught in class", "text": "This is a one semester course on Waves, Oscillations and Basic Quantum Mechanics. The course structure is as follows:\n1. Basic equation of SHM without damping\n2. Oscillations with damping, their parameters and analysis\n3. Resonance and forced oscillations with and without damping\n4. Coupled Oscillations with and without damping\n5. Wave equation, Group and Phase Velocity\n6. Interference and various interferometers and resolving power\n7. Diffraction- Fraunhoffer (and Fresnel-It was last taught on 2010 and once again introduced in Spring 2017-18)\n8. Polarisation\n9. Basic Quantum Mechanics upto 1D Potential WEll and Quantum Tunneling\nMain study material- Slides(Do follow them carefully as that's the actual syllabus)( http://www.cts.iitkgp.ac.in/home/pratik/teaching.html )\nBooks- Saraswat and Sastry, Physics-1 (by Somnath Bharadwaj and Saraswat Sastry)\nBe ready for class tests (total 2) in your tutorial class. You will be informed about the dates from before. Moreover, each section will have a different paper set up by the TAs. So be ready to see a complete level of difference in all the sections' papers. Some will be damn easy and some will be a hard nut to crack.\nAttendance in tutorials is counted in TA marks (it depends on the group of professors teaching the subject in a particular semester)", "page": "PH11001: Physics"}, {"chunk_id": "d124ad56", "title": "Student Opinion", "text": "Physics WAS(special emphasis) considered to be one of the subjects which could get you good grades if you are thorough with the slides and practised the problems of Somnath BHaradwaj book (till Autmun 2017). Several students could get EX grades and most of the questions were simply formula based and involved very little concept. It was the Spring Semester in 2018 that turned the table around. The grading scheme was changed from relative to absolute.\nTill 2017 Autumn it was- BOOKLET TYPE QUESTION CUM ANSWER SCRIPT: Enough space is provided so don't be worried except if you have the habit of cutting the entire answer and doing it again and again.\nBut in Spring Sem it changed backed to full length answer script giving you scope for extra pages.\nThe standard of the paper went very high. The questions were abstract and conceptual and required you to think very deep and apply concept at each and every point from scratch. Almost 121 students received F in Spring semester compared to only 8 in the Autumn Semester.\nHere are some tips to crack the paper: 1. Be thorough with your concepts such that you can start things right from the scratch.\n2. Don't rely fully on slides, read good study material like Saraswat and Sastry and Physics-1 by Somnath Bharadwaj to get hold of the basic concepts.\n3. Do solve all the sums in Somnath and SAraswat Sastry (They are directly copied from IE Irodov except some problems of Polarisation and Entire QM). Get hold of the solutions of Irodov .\n4. If you want to really do good, read AP French book for oscillations and waves portion and it would be awesome to read Ajoy Ghatak's book on Optics . They will safeguard you from losing marks. Also solve sums from both the books.\n5. If you have time, you can go through MIT OCW lecture (but make sure you don't sacrifice other subjects as well).", "page": "PH11001: Physics"}, {"chunk_id": "812822c5", "title": "Additional Resources", "text": "Instiinfo Repository", "page": "PH11001: Physics"}]