[{"chunk_id": "info_51b843", "title": "PH20003: Physics-Ii - Quick Facts", "text": "PH20003\nCourse name | Physics-II\nOffered by | Physics\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n11 33 29 45 43 32 12 EX A B C D P F | 11 | 11 | 33 | 33 | 29 | 29 | 45 | 45 | 43 | 43 | 32 | 32 | 12 | 12 | EX | A | B | C | D | P | F\n11 | 11 | 33 | 33 | 29 | 29 | 45 | 45 | 43 | 43 | 32 | 32 | 12 | 12\n11\n33\n29\n45\n43\n32\n12\nEX | A | B | C | D | P | F\nSemester | Autumn", "page": "PH20003: Physics-Ii"}, {"chunk_id": "efef6b77", "title": "Syllabus mentioned in ERP", "text": "Part I:Review of wave mechanics, particle in a box in different dimensions, potential step and barrier, tunneling and nuclear alpha-decay, quantum harmonic oscillator, quantum theory of the Hydrogen atom, normal Zeeman effect, radiative transitions and selection rules. Electron spin, SternGerlach experiment, spin-orbit coupling, exclusion principle, symmsymmetric and antisymmetric and wave functions, electron configurations in many electron atoms, total angular momentum, LS and jj couplings, one and two electron spectra, X-ray spectra. Part II : Molecular formation, electron sharing, H_2^ molecular ion and H_2 molecule (qualitative), rotational and vibrational energy levels, electronic spectra. Maxwell--Boltzmann statistics, molecular energies in an ideal gas, the laser, quantum statistics (Bose-Einstein and Fermi-Dirac), photon gas, specific heat of solids, free electrons in a metal, density of states. Crystalline and amorphous solids, crystal defects, ionic and covalent crystals, van der Waals forces, metallic bond, Ohm's law, band theory of solids, Brillouin zones and forbidden bands, effective mass, semiconductors and semiconductor devices.", "page": "PH20003: Physics-Ii"}, {"chunk_id": "a0c3f694", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | NR321\nThursday | NR321\nFriday | NR321 | NR321", "page": "PH20003: Physics-Ii"}]