[{"chunk_id": "info_ec9847", "title": "PH29001: General Properties %26 Thermal Physics Lab - Quick Facts", "text": "PH29001\nCourse name | General Properties & Thermal Physics lab\nOffered by | Physics\nCredits | 4\nL-T-P | 0-0-6\nPrevious Year Grade Distribution\n6 23 4 1 EX A B C D P F | 6 | 6 | 23 | 23 | 4 | 4 | 1 | 1 | EX | A | B | C | D | P | F\n6 | 6 | 23 | 23 | 4 | 4 | 1 | 1\n6\n23\n4\n1\nEX | A | B | C | D | P | F\nSemester | {{{semester}}}", "page": "PH29001: General Properties %26 Thermal Physics Lab"}, {"chunk_id": "5d0f8a78", "title": "Syllabus mentioned in ERP", "text": "1. To determine the Stefans constant by using an incandescent lamp and photo voltaic cell. 2. To determine the thermal conductivity of the given disc of bad conductor of heat by Lees and Chorltons method. 3. To study the variation of thermo-e.m.f of a given thermocouple with its cold junction in ice and the other junction at room temperature and above and hence to determine the thermoelectric power. 4. To calibrate a Platinum resistance thermometer and then to determine the boiling point of a given liquid. 5. To determine the coefficient of viscosity of a given liquid (water) by its streamline flow through a capillary tube. 6. To determine the surface tension of water by Jaegers method at different temperatures. 7. To determine the coefficient of linear expansion of the Material of a rod by optical leaver arrangement. 8. To determine the thermal conductivity of the material of a good conductor using Searles apparatus. 9. To determine the band-gap of a given semiconductor using a junction diode. 10. To study the characteristic curves of a given Thyratron tube. 11. To determine the Youngs modulus of Elasticity of the material of a bar by the method of flexure. 12.Normal modes of a coupled planar pendulum.", "page": "PH29001: General Properties %26 Thermal Physics Lab"}, {"chunk_id": "0fae3059", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday | In Dept | In Dept | In Dept\nWednesday\nThursday | In Dept | In Dept | In Dept\nFriday", "page": "PH29001: General Properties %26 Thermal Physics Lab"}]