[{"chunk_id": "info_71826b", "title": "PH40023: Electrodynamics - Quick Facts", "text": "PH40023\nCourse name | Electrodynamics\nOffered by | Physics\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n1 9 11 13 2 5 EX A B C D P F | 1 | 1 | 9 | 9 | 11 | 11 | 13 | 13 | 2 | 2 | 5 | 5 | EX | A | B | C | D | P | F\n1 | 1 | 9 | 9 | 11 | 11 | 13 | 13 | 2 | 2 | 5 | 5\n1\n9\n11\n13\n2\n5\nEX | A | B | C | D | P | F\nSemester | {{{semester}}}", "page": "PH40023: Electrodynamics"}, {"chunk_id": "152450cc", "title": "Syllabus mentioned in ERP", "text": "Review of Maxwells equations. Potential formulation, gauge transformations, Lorentz and Coulomb gauge, wave equation, electromagnetic waves. Retarded potentials, field of a uniformly moving charge, Lienard-Wiechert potentials; Radiation from oscillating electric and magnetic dipoles and antennas. Optical dispersion in materials, resonant absorption, anomalous dispersion; frequency dispersion characteristics of dielectrics, conductors and plasmas; causality in the connection between D and E, KramersâKronig relations. Maxwell field as a classical 4-vector field; electromagnetic field tensor; homogeneous Maxwell equations; Lorentz invariants; Wigner rotation and Thomas precession. Lagrangian formulation of the free Maxwell field; stress-energymomentum tensor; field angular momentum; conserved quantities; inhomogeneous Maxwell equations; 4-dimensional Greens function of the wave equation for the 4-potential in the Lorentz gauge. Radiation from accelerated charges in the comoving frame; Larmor formula; polar plots and polarization charts; radiation from relativistic charges; linear accelerator and synchrotron radiation; multipole expansion of electromagnetic fields; Cherenkov radiation; transition radiation; radiation reaction.", "page": "PH40023: Electrodynamics"}, {"chunk_id": "dee876cb", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday\nTuesday\nWednesday | NC443\nThursday | NC443\nFriday | NC443", "page": "PH40023: Electrodynamics"}]