[{"chunk_id": "info_5bd777", "title": "PH41013: Mathematical Methods I - Quick Facts", "text": "PH41013\nCourse name | Mathematical Methods I\nOffered by | Physics\nCredits | 4\nL-T-P | 3-1-0\nPrevious Year Grade Distribution\n6 17 8 7 3 EX A B C D P F | 6 | 6 | 17 | 17 | 8 | 8 | 7 | 7 | 3 | 3 | EX | A | B | C | D | P | F\n6 | 6 | 17 | 17 | 8 | 8 | 7 | 7 | 3 | 3\n6\n17\n8\n7\n3\nEX | A | B | C | D | P | F\nSemester | {{{semester}}}", "page": "PH41013: Mathematical Methods I"}, {"chunk_id": "2c57c51a", "title": "Syllabus mentioned in ERP", "text": "Linear vector spaces: real and complex vector spaces; metric spaces; linear Operators; algebra of linear operators; eigenvalues and eigenvectors; orthogonalisation theorem; N-dimensional vector space; tensors and tensor calculus; invariant subspaces, Function spaces, orthogonal polynomials , Fourier transform: space of continuous functions; metric properties of the space of continuous functions; Lebesgue integral; the Riesz-Fischer theorem; expansions in orthogonal functions; Hilbert space; Weierstrass theorem; orthogonal polynomials-Rodriguez formula; recurrence relations; differential equations satisfied by classical polynomials; Fourier series and Fourier transform, delta function. Complex analysis: Cauchy-Riemann conditions; Cauchys theorem; Taylor series and Laurent series; zeros and isolated singularities of analytic functions; Calculus of residues; Multivalued functions and Riemann surfaces; analytic continuation; meromorphic functions. Ordinary differential equations, Greens functions, special functions : second order differential equations; the Sturm-Liouville problem; Hypergeometric functions; functions related to them; confluent Hypergeometric functions; functions related to them; Error and Bessel functions.", "page": "PH41013: Mathematical Methods I"}, {"chunk_id": "df8fd052", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NC443\nTuesday\nWednesday | NC443 | NC443\nThursday | NC443\nFriday", "page": "PH41013: Mathematical Methods I"}]