[{"chunk_id": "info_cf69e9", "title": "PH41008: Mathematical Methods -Ii - Quick Facts", "text": "PH41008\nCourse name | Mathematical Methods -Ii\nOffered by | Physics\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n11 13 16 21 9 3 2 EX A B C D P F | 11 | 11 | 13 | 13 | 16 | 16 | 21 | 21 | 9 | 9 | 3 | 3 | 2 | 2 | EX | A | B | C | D | P | F\n11 | 11 | 13 | 13 | 16 | 16 | 21 | 21 | 9 | 9 | 3 | 3 | 2 | 2\n11\n13\n16\n21\n9\n3\n2\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "PH41008: Mathematical Methods -Ii"}, {"chunk_id": "7486e87c", "title": "Syllabus mentioned in ERP", "text": "Partial differential equations (PDE) in Physics: preliminaries; classification of second-order quasilinear equations; elliptic, hyperbolic and parabolic type; characteristics; boundary conditions and types of equations; one-dimensional wave equation; one-dimensional diffusion equation; the two dimensional Laplace equation; Green’s function for PDE; singular part of the Green’s function for PDE with constant coefficients; Possion’s equation; the diffusion equation; the wave equation; Dirichlet and Neumann problems; the initial value problem for the wave equation; the method of images; the method of separation of variables; 3D Laplace equation in spherical polar coordinates; associated Legendre functions and spherical harmonics. Group Theory: definitions and nomenclature; examples; rearrangement theorem; cyclic groups; subgroups and cosets; Cayleys theorem and Lagranges theorem; conjugate elements and class structure; factor groups; isomorphy and homomorphy; direct product groups; symmetric groups. Representation of finite groups; definition ; unitary representation; Schurs Lemma; orthogonality theorem; reducible and irreducible representations; characters; regular representation; product representation; character table; examples of S_3 and C_4v; introduction to Lie groups and Lie algebra; Clebsch-Gordon coefficients.", "page": "PH41008: Mathematical Methods -Ii"}]