[{"chunk_id": "info_405aa2", "title": "PH49019: Nuclear And Particle Physics Lab - Quick Facts", "text": "PH49019\nCourse name | Nuclear and Particle Physics Lab\nOffered by | Physics\nCredits | 2\nL-T-P | 0-0-3\nPrevious Year Grade Distribution\n7 48 17 EX A B C D P F | 7 | 7 | 48 | 48 | 17 | 17 | EX | A | B | C | D | P | F\n7 | 7 | 48 | 48 | 17 | 17\n7\n48\n17\nEX | A | B | C | D | P | F\nSemester | {{{semester}}}", "page": "PH49019: Nuclear And Particle Physics Lab"}, {"chunk_id": "dc06ba6c", "title": "Syllabus mentioned in ERP", "text": "1. To determine the thickness of a thin film by Rutherford backscattering spectrometry. 2. To calibrate Gamma Ray Spectrometer using 57Co, 60Co and 137Cs radioisotopes. 3. To analyse the complete energy spectra for Gamma Rays from 60Co and 137Cs radioisotopes. 4. To study the energy dependence of the photo-fraction. 5. To determine the gamma activity of an unknown radioisotope by relative method. 6. To study the statistical nature of nuclear radiation. 7. To study the energy dependence of the absorption coefficient of aluminum. 8. To study the energy dependence of the absorption coefficient of lead. 9. To verify the laws of Compton scattering. 10. To study the fission fragment tracks in CR-39 plastic track detector. 11. To calibrate alpha spectrometer. 12. To determine the stopping power of argon gas for alpha particles. 13. To determine the range of alpha particles in the air using spark counter. 14. To determine the end-point energy of beta particles. 15. To study coincidence circuits.", "page": "PH49019: Nuclear And Particle Physics Lab"}, {"chunk_id": "ba3e9e40", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | In Dept | In Dept | In Dept\nTuesday | In Dept | In Dept | In Dept\nWednesday\nThursday | In Dept | In Dept | In Dept\nFriday | In Dept | In Dept | In Dept", "page": "PH49019: Nuclear And Particle Physics Lab"}]