[{"chunk_id": "info_7fa3a6", "title": "PH49014: Condensed Matter Physics Lab - Quick Facts", "text": "PH49014\nCourse name | Condensed Matter Physics Lab\nOffered by | Physics\nCredits | 4\nL-T-P | 0-0-6\nPrevious Year Grade Distribution\n5 17 2 1 2 1 EX A B C D P F | 5 | 5 | 17 | 17 | 2 | 2 | 1 | 1 | 2 | 2 | 1 | 1 | EX | A | B | C | D | P | F\n5 | 5 | 17 | 17 | 2 | 2 | 1 | 1 | 2 | 2 | 1 | 1\n5\n17\n2\n1\n2\n1\nEX | A | B | C | D | P | F\nSemester | {{{semester}}}", "page": "PH49014: Condensed Matter Physics Lab"}, {"chunk_id": "54f9b6af", "title": "Syllabus mentioned in ERP", "text": "[The remaining eight (8) experiments not done in Condensed matter physics lab I will be performed in this lab course] 1. Determination of Hall voltage as a function of field for semi-metallic sample. 2. Measurement of the magneto-resistance of a Conducting System 3. Measurement of permeability of a ferromagnetic substance in presence of uniaxial stress. 4. Measurement of the Ionic conductivity of the Crystal and determination of the Activation energy 5. To measure the magnetic susceptibility of given samples and calculate their effective Bohr magnetron number 6. Determination of permanent dipole moment of a polar molecule. 7. Measurement of Junction Capacitance of p-n Junction and to determine the Barrier Potential and Doping Profile of depletion region 8. Measurement of resistivity of metallic and semiconducting samples between 77K and 300K 9. To study the scattering of light from suspensions (tubigens) in fluids. 10. To take a Debye-Scherrer Photograph of a given sample and Index the photograph and determine the cell parameter; lattice type and number of atoms per unit cell. 11. X-ray diffraction method for identification and quantitative estimation of the components in a binary mixture (powder diffraction) 12. To measure the Lande’ g factor for electron using Electron Spin Resonance (ESR) technique 13. To measure skin depth of normal metal 14. Measurement of magnetization using Vibration Sample Magnetometer (VSM) 15. To determine the linear thermal expansion coefficient of a solid 16. To measure the thermoluminescene property of a solid", "page": "PH49014: Condensed Matter Physics Lab"}]