[{"chunk_id": "info_12c491", "title": "PH49005: Electromagnetism %26 Optics Lab. A - Quick Facts", "text": "PH49005\nCourse name | Electromagnetism & Optics Lab. A\nOffered by | Physics\nCredits | 4\nL-T-P | 0-0-6\nPrevious Year Grade Distribution\n7 33 1 EX A B C D P F | 7 | 7 | 33 | 33 | 1 | 1 | EX | A | B | C | D | P | F\n7 | 7 | 33 | 33 | 1 | 1\n7\n33\n1\nEX | A | B | C | D | P | F\nSemester | {{{semester}}}", "page": "PH49005: Electromagnetism %26 Optics Lab. A"}, {"chunk_id": "b586efab", "title": "Syllabus mentioned in ERP", "text": "1. To determine the figure of merit of a given dead-beat type galvanometer by lamp and scale arrangement. 2. Study of the normal and anomalous Hall effect and hence to determine the Hall co-efficient of the given metal using Hall probe and Cobra software. 3. To determine the self –inductance of a given coil by Anderson’s bridge. 4. To determine the resonance frequency of the series and parallel L-C-R circuit by CRO and function generator. 5. To measure the high resistance by the method of leakage of charge of a charged conductor. 6. To find the mutual inductance of two coils set at different angles by direct method. 7. To determine the self –inductance of a given coil by Owen’s bridge. 8. To study the phenomena of refraction, interference, absorption and polarization of the microwaves. 9. Verification of Beer’s law using spectrophotometer. 10. To draw the calibration curve (D- lambda curve) of a given prism and hence to find the wavelengths of some unknown lines. 11. To determine the velocity of electromagnetic waves by using luminous diode and photodiode (light receiver). 12. To study the polarisation of light by simple reflection method. 13. To determine the wavelength of Sodium light by using bi-prism. 14. To study the variation of refractive index with the wavelength and hence to determine the dispersive power of the material of a given prism. 15.Interference and diffraction of microwaves.", "page": "PH49005: Electromagnetism %26 Optics Lab. A"}, {"chunk_id": "3768a555", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | In Dept | In Dept | In Dept\nTuesday | In Dept | In Dept | In Dept\nWednesday\nThursday | In Dept | In Dept | In Dept\nFriday | In Dept | In Dept | In Dept", "page": "PH49005: Electromagnetism %26 Optics Lab. A"}]