[{"chunk_id": "info_478206", "title": "PH60307: Physical Cosmology - Quick Facts", "text": "PH60307\nCourse name | Physical Cosmology\nOffered by | Physics\nCredits | 3\nL-T-P | 3-0-0\nPrevious Year Grade Distribution\n1 1 4 5 3 3 8 EX A B C D P F | 1 | 1 | 1 | 1 | 4 | 4 | 5 | 5 | 3 | 3 | 3 | 3 | 8 | 8 | EX | A | B | C | D | P | F\n1 | 1 | 1 | 1 | 4 | 4 | 5 | 5 | 3 | 3 | 3 | 3 | 8 | 8\n1\n1\n4\n5\n3\n3\n8\nEX | A | B | C | D | P | F\nSemester | Spring", "page": "PH60307: Physical Cosmology"}, {"chunk_id": "b3e2e081", "title": "Syllabus mentioned in ERP", "text": "The realm of nebulae : Our Galaxy - external galaxies - our neighborhood â Hubble s law of expansion - mapping the distribution of galaxy. The expanding universe : the cosmological Principle- dynamics of the expanding Universe different cosmological models - space time curvature - cosmological constant. Thermal history of the universe. Current problems in cosmology: dark matter inflation - large-scale structure formation and CMBR anisotropies - the high redshift universe.", "page": "PH60307: Physical Cosmology"}, {"chunk_id": "a5e36794", "title": "Concepts taught in class", "text": "• Basic Observations - Olbers' Paradox\n• Doppler Effect and Redshift (Non Relativistic)\n• Hubble's Law\n• Friedman equations(The core of Cosmology) are derived and its different cases of it are discussed. (This is the most important thing in the first half of the course)\n• Thermal History of the universe A brief discussion on Big Bang to the Present Inflation Cosmic Microwave Background Dark Matter Big Bang Nucleosynthesis Structure Formation", "page": "PH60307: Physical Cosmology"}, {"chunk_id": "ff06f477", "title": "Student Opinion", "text": "Modern Cosmology is generally studied with General Relativity and Quantum Field theory. But this course doesn't require them as pre-requisites. Professor T.S Ray does an amazing job in delivering the ideas without using any GR and QFT. The course can be enjoyed even by students outside of Physics Department.", "page": "PH60307: Physical Cosmology"}, {"chunk_id": "6dba3985", "title": "Classroom resources", "text": "• Barbara Ryden's Introduction to Cosmology : The book is a great supplement to the course. To get a better understanding of the topics, you can read the corresponding sections of the book. The book will also be useful in solving assignment problems.\n• Universe in Problems : A useful site containing numerous problems, again can be useful for assignment.\n• Assignment 2021\n• Assignment 2021 Solutions - UNVERIFIED\n• Final Exam 2021\n• Exam 2021 Solutions - UNVERIFIED", "page": "PH60307: Physical Cosmology"}, {"chunk_id": "94797106", "title": "Additional Resources", "text": "• Introduction to GR: For the enthusiastic, who want to learn beyond the course.\n• Introduction to QFT : For the enthusiastic, who want to learn beyond the course.\n• r/astrophysics and r/cosmology subreddits for discussions and Queries: The community is really helpful and matured. Most likely to get a satisfying detailed answer within a couple of days.\n• A YouTube channel for interesting things about Universe", "page": "PH60307: Physical Cosmology"}]