[{"chunk_id": "85f97fc4", "title": "Placement Interview Experiences", "text": "(This page was compiled by Ankur Agarwal (EX '17), Vivek Aithal (AE '16) and Kunal Jain (IM '17))\nDecember can be a harrowing time for final year students who enroll themselves for the placement process. This wiki is an effort to compile the best practices and resources that helped students get job offers, in various sectors. Each section contains answers to the following questions by successful candidates.\n• What was the general interview process for most companies of this sector? Please mention the number of rounds and the nature of the interview process.\n• What are some of the FAQs that you faced and think students must definitely prepare for?\n• What are things students can do from now until December to maximise their chances of getting through a company in this sector?\n• List resources you found useful/necessary to be successful in interviews Must do resources [Compulsory reads] Advanced resources [They are not required for all companies, but will improve chances in top tier firms] Auxiliary read [They are not compulsory, but will definitely help]", "page": "Placement Interview Experiences"}, {"chunk_id": "af8ca31a", "title": "Sectors", "text": "The companies that visit campus to recruit students can be broadly categorized under the following sectors - consulting, investment banking/ finance, software development, data analytics, FMCG, and core engineering.", "page": "Placement Interview Experiences"}, {"chunk_id": "b1e2a581", "title": "Someone placed at BCG", "text": "What was the general interview process for most companies of this sector? Please mention the number of rounds and the nature of the interview process.\nCase Interview + Behavioural/ Experience Interview\n​(The second one I'd say is a little different from the regular HR interviews- the focus is upon your learnings and getting to know you more personally, things which aren't on resume, something which might be there in your SOP)​\nCompany: BCG\nNumber of rounds:​ 4 in-person\nThe first 2 rounds were guesstimates with extrapolated case questions, i.e. candidate is expected to give some inference with respect to the number obtained.\nGuesstimate 1: Size of pre-schools in India\nGuesstimate 2: Annual revenue of one BCG India office\nThe next 2 rounds were strategic and subjective case questions with no numbers involved.​\nCandidate is expected to go about addressing the case in a structured manner. It's more than possible that one may miss a few points, and the interviewer will also be cool with it as long as the approach is structured. The guessing game is fragile and easily gets caught. Moreover, the interviewer would never help and instead would prod more if he/ she realizes that random arrows are being shot wildly in the sky. The last round (Partner round) was Data Interpretation in my case from the regular consult slides (something similar to the Capital One test)- familiarity with DI would hence certainly help.\nA candid and cheerful approach is very very helpful. Afterall, these companies want individuals with whom they want to work with. Having said that, there is a very thin line between candid and cocky (excuse for the language). Do bear that in mind.\nWhat are some of the FAQs that you faced and think students must definitely prepare for?\nTell me something about yourself. Walk me through your resume. Resume grilling.\nThe most challenging environment/ work etc. Why consulting? Why the firm? Why you?\nThis could be a long list and can be googled up as well. The idea is to sell yourself in all/ most of the answers.\nResources\n• Must do resources [Compulsory reads] Case in Point - Marc P. Cosentino Case Interviews Video Lectures by Victor Cheng Case Interviews Cracked, IIT Bombay IIM-A casebook\n• Advanced resources [Not compulsory, but increases chances in top tier firms] Vault Materials, ​​Bain Practice Case Video, Capital One Practice Case Video Cases on McK/ BCG or websites of any other Tier 1 firm Buddy cases: Practice as much as possible with the buddy you are given by the company", "page": "Placement Interview Experiences"}, {"chunk_id": "201b10cb", "title": "Aditi Sharma - Placed at McKinsey", "text": "What was the general interview process for most companies of this sector? Please mention the number of rounds and the nature of the interview process.\nConsulting companies primarily gauge how “client safe” you are. One’s case solving acumen is tested apart from how comfortably you can interact with the interviewer and strike up a conversation with him/her. For consulting companies the interview is preceded by a buddy session wherein each shortlisted student is assigned a buddy (a person working at the firm). The buddy aids you in your preparation (feel free to ask him/her all your doubts and practice as many cases as possible with your buddy).In some companies the buddy process is evaluative.\nThere are mainly 2 components to an interview: Case and HR. The case given to you will be a real life case that your interviewer has worked on. Always remember the interviewer is just assessing your thinking process. The answer isn’t too important to him. Also, it’s really important to be good with numbers for quantitative cases. Since we are from an engineering background, a lot of focus is given to numbers cases by the companies. In the HR component you are asked questions on your resume. The interviewer is mainly interested in what you have learnt from a particular experience or the impact you were able to create etc. They generally don’t get into the technical aspects of your internships.\nYou can expect atleast one case (or guesstimate) derived from your own personal experiences. This is normally asked to assess how well you can apply knowledge gained through your own experiences to a case. Eg. I stay in Bombay so I was asked to estimate the amount of toll collected on the Bandra-Worli Sealink in a day.\nYou can expect anywhere between 3-6 rounds depending on the company. The final interview rounds are with the partners of the firm.\nWhat are things students can do from now until December to maximize their chances of getting through a company in this sector.?\nThe first stage in applying to a consulting company is submission of your CV and cover letter. So in the vacations you can focus on making your CV. Consulting companies are looking for candidates with a spike in their profile (it can be in sports, PORs, internships, cultural activities, etc.) along with a good academic record. Students can start case prep from August and HR prep around 10 days before the interview. Also, you should be absolutely thorough with your resume.\nThe main focus of students should be on case solving. It is highly recommended that students form case groups among themselves (I’d recommend 3 students in one case group). I’ve generally observed that how students perform in an interview depends on the combined efforts of the entire group and coordination in the group. It’s your entire case group that’s going to correct your mistakes and help you prepare for the interview and not just the individual efforts put in by you. So make sure you choose your case group wisely.\nNext for case prep, students should start with the Victor Cheng videos and then move on to the IIT Bombay casebook. Other sources that can be referred to after this are: IIM-A casebook, ISB casebook, Case in Point, Kellogg Casebook and HBS Casebook.\nYour focus should not be on solving a huge number of cases. It’s not the quantity of cases you’ve solved that matters but the quality of your preparation that makes the difference. Also, try to solve as many cases as possible with people in the consulting industry and not just your buddies. The feedback you get from them goes a long way in helping you prepare.\nIt’s important you develop a systematic thinking process while solving cases. MECE (Mutually exclusive and completely exhaustive) is one such technique. You will come across a lot of frameworks to solve cases during your preparation. My suggestion is to come up with your own case framework along with your case group. That really helped me in my interviews. Coming up with your own framework is a slow and steady process. As you keep solving cases and come across different frameworks, keep building your own framework. I kept refining my framework as I solved more and more cases.\nA frequently asked question is how much focus should be laid on guesstimates. Guesstimates are generally asked in market sizing questions. Students should regularly practice guesstimates as well though not as much as cases.\nResources\n• Must do resources: Victor Cheng videos, IIT Bombay Casebook, Buddy Cases/Cases with people working in the consulting sector\n• Additional Resources: IIM-A casebook, ISB casebook, Case in Point, Kellogg Casebook and HBS Casebook, Ambition Box", "page": "Placement Interview Experiences"}, {"chunk_id": "7016e602", "title": "M A Krishna Deepak - Placed at BCG", "text": "What was the general interview process for most companies of this sector? Please mention the number of rounds and the nature of the interview process.\nThe interview process involves multiple levels of interviews. The initial rounds can be over telephone, Skype or in person subject to the company's preference. They were all case interviews - designed to test our basic business case/problem solving abilities. Some of them might involve a few questions related to HR and they can be particularly detrimental, given Consults' problems tackling high attrition.\nWhat are some of the FAQs that you faced and think students must definitely prepare for?\nTell me about yourself? Why consulting? Where do you see yourself 5/10 years later? What are your strengths? What are your weaknesses? Mention one of your failures? Questions on being a team player, leader, displaying ownership, creativity and initiatives - CV specific.\nWhat are things students can do from now till December to maximise their chances of getting through a company in this sector?\nBe extremely good at what you do. Be it Finance, Banking, Consulting, Sports, Academics or Research! Diversify if possible to justify that you are game for consulting given a different background. Work on communication and networking skills. English. In most cases, you don't work towards becoming a consultant, you just get cherry picked because of whatever you're good at.\nResources\n• Case Interviews Video Lectures by Victor Cheng, Case Interviews Cracked from IIT Bombay, IIM A casebook\n• Case in Point", "page": "Placement Interview Experiences"}, {"chunk_id": "98d219f6", "title": "Manav Kedia - Offers from Goldman Sachs, VISA, Microsoft; PPOs from Adobe, Codenation", "text": "What was the general interview process for most companies of this sector? Please mention the number of rounds and the nature of the interview process.\nEach company has its own online test, usually on Hackerrank consisting of 3-4 coding questions and/or MCQ's from Computer Science domain. After you qualify this round and are shortlisted for the interview, usually for all the SDE positions, the general process consists of 2-3 technical rounds followed by 1 HR round. Some companies like Microsoft may even have a group fly round for all of its shortlisted candidates.\nIn the technical rounds, they ask you 2-3 coding questions which you have to code on paper(proper syntax and everything, not pseudo code) and/or domain related questions from DBMS, Networks, OS and ML(if mentioned in the resume).\nIn the HR round they ask you the typical HR questions such as why do you want to join our company, do a SWAT analysis, what are your long term and short term interests. One should also prepare his/her answers for the HR round and not just for the technical rounds.\nWhat are some of the FAQs that you faced and think students must definitely prepare for?\nPreparing for the typical HR questions is a must in my opinion. Other than that you should have \"introduce yourself\" prepared and oriented to the company position that you are applying to. This was something that almost every interviewer asks before beginning. Another question that they usually ask you is to explain one of the projects that you have worked on with a little detail. Be sure to go through your resume very well and have something prepared for every project/ achievement that you have written on your resume.\nWhat are things students can do from now till December to maximise their chances of getting through a company in this sector?\nStrengthen your fundamentals in the core CS subjects such as DBMS, ML(if you have mentioned it in your resume), Networks and OS. Practise competitive programming regularly on sites such as codeforces, codechef. Take up projects. Setup a profile on Github, push your projects there.\nResources\n• geeksforgeeks.com (Algorithms and data structures part are a must)\n• topcoder tutorials on advanced topics such as binary indexed trees, suffix arrays, segment trees (important for google)\n• Do practise on interviewbit.com, it helps to handle the corner test cases", "page": "Placement Interview Experiences"}, {"chunk_id": "1411c632", "title": "Abhijeet Raj - Placed at Goldman Sachs", "text": "What was the general interview process for most companies of this sector? Please mention the number of rounds and the nature of the interview process.\nThere are two types of quant, first one is of the cat format which can be mastered by practicing any of the materials available for CAT exams. The second one is of different kind. It requires you to deal with basic probability, theory of expectation and brain storming. The companies i interviewed for were of the second type. They ask you questions related to probability and expectation numbers. For analytics they check whether you know the basic and business concepts behind all the analytics work you have written in your CV.\nWhat are some of the FAQs that you faced and think students must definitely prepare for?\nThe most important FAQ is to decide which sector you want to land up into. You should never aim for 200+ companies rather aim for 10 companies based upon your area of interest and start preparing for them. Another important thing to remember is that the placement semester is not for analyzing what you haven't done rather think about what you have done and how can you make that your selling point. If you have an answer for these two questions you are ready for placements\nWhat are things students can do from now till December to maximise their chances of getting through a company in this sector?\nStudy the basics of probability and statistics. Go through first 4-5 chapters of Jain and Iyengar. Learn the basics of machine learning and practice it by participating in various competitions held online. Try and get an internship in this sector.\nResources\n• Must do resources\n1. Hines for probability and statistics.\n2. Intro to machine learning by Andrew NG(Coursera)\n3. Applied multivariate statistical modelling by J Maiti(NPTEL)\n4. 50 challenging problems in probability by Frederick Mosteller\n5. Heard on the street\n• Advanced resources\n1. Introduction to algorithms by OCW, MIT\n2. McgrawHill brain teasers\n3. Caltech Machine Learning\n4. Stanford Core NLP on coursera\n• Auxiliary read\n1. Read various answers on Quora for machine learning and Data scientist\n2. Online blogs for successful data scientists\n3. Introduction to algorithms by Cormen", "page": "Placement Interview Experiences"}, {"chunk_id": "41aee756", "title": "Mohit Bhura - Placed at UBER", "text": "What was the general interview process for most companies of this sector? Please mention the number of rounds and the nature of the interview process.\nIt starts with a test comprising of a few MCQs and coding questions before the actual interview, during October-December. Once you clear that, they will usually take 2-3 technical interviews. If you clear one round, you go on to the next. In these interviews, they will ask varied questions from your CV, some technical knowhow and again, more coding questions. The biggest focus is on whether you can find an optimal algorithm to solve the given problem/ implementation, and then code it in a reasonable amount of time.\nWhat are some of the FAQs that you faced and think students must definitely prepare for?\nThe coding questions are usually from DP or graph theory, and I didn't find a new question being asked. I was asked to implement an LRU cache thrice actually! And definitely brush up on your C++/Java skills - Base class / Super Class / OOP / Abstraction / Encapsulation etc.\nWhat are things students can do from now till December to maximise their chances of getting through a company in this sector\nCode. Code. Code.\nTake an active interest in competitive programming. Participate in competitions by codechef/hackerrank/topcodef/codeforces. One advice I would give is, even if you can't solve the problem during the contest, go back later and check out the editorial, and then solve it. If you still can't, see the author's / tester's solution and then solve it. By december, you should be able to solve all problems easier than \"Medium\".\nAlso, try finishing of questions in all related domains on hackerrank - Algorithms/C++/Java/Python/Data Structures etc.\nResources\nMust do resources [Compulsory reads] - hackerrank domains, geeksforgeeks, careercup, Introduction to Algorithms by Corman/notes by Prof Abhijit Das\nAdvanced resources [They are not required for all companies, but will improve chances in top tier firms] - competitive coding on the aforementioned websites; Cracking the Coding Interview\nAuxiliary read [They are not compulsory, but will definitely help] - There is a book on competitive coding by Steven Halim, get a hold of it, and try to learn everything from it.", "page": "Placement Interview Experiences"}, {"chunk_id": "f6c6d384", "title": "Srinivasan Sivanandan - Placed at Samsung", "text": "What was the general interview process for most companies of this sector? Please mention the number of rounds and the nature of the interview process.\nFor most of the companies in Software Development sector, there was an online coding test to screen followed by 2-3 rounds of technical and HR interviews. The technical rounds were mostly based on algorithms, machine learning, programming languages, image processing, software development practices and puzzles. The HR round was based on my projects and internships along with the usual why this company? why select you? questions.\nWhat are some of the FAQs that you faced and think students must definitely prepare for?\nI would recommend students interested in these profiles to have a strong working knowledge of algorithms in atleast one programming language. Machine learning, data science and IP skills with experience in these fields through internships and projects would be an added advantage to crack the interviews. Some HR questions like \"tell me about yourself\", \"strengths & weakness\" are so frequent that the interviewer expects an immediate answer from you. Preparing for those questions well before is advisable.\nWhat are things students can do from now till December to maximise their chances of getting through a company in this sector?\nTo maximise their chances of getting through a company in this sector, students must be well prepared in data structures, dynamic programming and graph theory. With a lot of companies interested in data sciences recently, machine learning and AI knowledge is highly recommended. Students can take up courses(on-campus or through MOOCs) and do internships to gain experience in these areas. Students can try to increase their CGPA if possible as it matters a lot in the selection processes.\nResources Must do resources - geeksforgeeks, ambitionbox Advanced resourses - Introduction to Algorithms - Cormen, Probability & Statistics - Hines, Machine Learning - Tom Mitchell Auxillary resourses - MOOCs (coursera, udacity, edX)\nGeneral advice to students of all years:\n• CGPA is *very* important\n• Good Internships and projects can get help you a lot in placements\n• Have a goal and be unique in whatever you do in these 4/5 years - Companies look for unique profiles and personalities", "page": "Placement Interview Experiences"}, {"chunk_id": "9a3bf6b5", "title": "Sahil Grover - Placed at American Express", "text": "Interview Process\nRound 1 - Resume Shortlist\nResume fitting for a data analysis profile are shortlisted. So writing R, Python and programming skills in the CV should help you getting shortlisted. Almost 200 students were shortlisted for the test. Make sure you mention your courses or projects related to data analysis in the resume.\nRound 2 - Test\nDuration: 60 minutes\nNo. of Questions: 20\nThe test was on mettl.com It was a very easy test which judges your quantitative aptitude and logical reasoning (find the next shape, find the missing number). Questions like \"find the least no to be multiplied by 100! such that is its divisible by 3^50?\" , \"find the probability of dice rolled three times to sum up as 10?\".\nPreparing for CAT would do. It is a very easy test. You need you ensure that all your questions are correct as there was a lot of time.\nRound 3 - Technical Interview\nI expected a very technical round with all sorts of questions on statistics and data analysis. But it was soft spoken interview. They literally want to know why you want to join data analysis and Why Amex? And how passionate are you towards work? Interview is taken by very experienced people from the company and is more of a discussion about ur cv and projects related to data analysis. They listen to whatever code or piece of programming you have done and how well you know. I talked about the courses I took to learn data analysis on coursera, my MTP project on optimization and its algorithms and why i wanted to join Amex. My interview ended with a puzzle which was \"There is weight balance and i want to measure from 1 kg to 100 kg. So what is the minimum no of stones and their weights required to measure any material with weght between 1kg to 100 kg.\". I solved the problem and then he asked me why do you think this is the most optimum way. I answered it a bit and then he made my problem difficult by adding a information that \"we can put weights on both sides\". I was not able to solve it but defined the strategy should be used to find solution. My interview ended with my interviewer helping me solve the problem and explaining me the answers clearly. He said he will talk to HR but no HR round happened and I got selected. I would suggest to check with others about the kind of HR questions they ask.\nInterview Tips\nBe confident, talk about what you know. I started my data analysis in the last semester but was really amazed with the things I studied. So, most important thing is to find out if you like the domain or not. If the domain fits you, its the matter of showing interviewers the enthusiasm towards the subject genuinely. Placement is the matter of the interviewer understanding your motivation to work with the firm. So show them what you got for them. Knowing data analysis obviously helps but company expects you learn and grow rather learn in the company from most experienced people itself.\nResources\n• How To Ace The Brain Teaser,\nSkills\nLogical reasoning, Quantitative Aptitude, Statistical Inference, R programming", "page": "Placement Interview Experiences"}, {"chunk_id": "c6fe9839", "title": "Vaibhav Goyal - Offers from Goldman Sachs, Shell; shorlists at Deutsche Bank, AB InBev", "text": "What was the general interview process for most companies of this sector? Please mention the number of rounds and the nature of the interview process.\nDB (Finance)\nI am writing this answer from a general point of view of finance companies (DB, CS, JPM). GS was more of a Quant based role. Mostly the first step is a resume based shortlisting followed by a GD (in case of DB, CS) or a written test (in case of JPM) followed by final interviews on DAY 1. For some profiles of CS, there is a quant test (the test is supposed to be tough but I am not really sure as I did not apply for those profiles). I only appeared for the process of DB so I am only going to (qualified to) talk about DB.\nShortly after resume shortlisting, an interactive session is organised by DB. It’s a really good platform to understand the job role and get your queries answered from DB people itself. It is supposed to be a non-evaluative session but I’ll advise people to take it seriously. The GD is more of an interactive session, with a senior member of the management directing the conversation and asking for the views of everyone on a topic. On DAY 1, there will be multiple rounds of interviews for DB. My first round was a technical interview as I had a background in Finance (CFA L1 and IB Internship). For people who do not have a background in finance, first round will be a resume based interview). I was tested on various topics ranging from Corp Fin to FRA from CFA L1 but the majority of my interview was spent on my internship. Second and third rounds were both behavioural interviews with the senior management from DB. Be prepared for questions like Why Finance? Why DB? Why not (insert your major)? Why should we hire you? 3 shortcomings etc.\nGS (Quant)\nAs for GS, the first step is a written test (actually the first step is resume shortlisting but everyone is shortlisted) which comprises of three sections: Quant (Math), Machine Learning & Coding. One does not need to attempt all the sections to be selected for final interviews. I only attempted the Quant section which mainly comprised of questions from basic probability theory. Final interview was also on the same lines with puzzles and questions from basic probability theory. As the interview went on, the difficulty level of the questions kept on increasing but the domain was restricted to probability theory only. I would like to emphasise here that CODING is NOT REQUIRED for selection process of GS although obviously it is a big advantage. I have never written a line of code (except for the 1 st year PDS course) in my entire life. They are just evaluating your line of thinking and whether you will be able to learn on the job or not.\n1. Online application\n2. Online tests (Part1-20min; Part2-45 min)\n3. E-Tray exercise before the day of interview: In this exercise you will be given a role in the company and documents of certain project. Then you will be receiving a series of mails from different people in the organization or people related to the project. You have to choose the most suitable answer from 5 given options based on the information provided and assuming the role given to you.)\n4. Interview\nPart 1: Solving a case-30 min for preparation, 45 min discussion on case;\nPart 2: Series of competency based, situational and behavioural questions to be assessed against the CAR criteria)\nAB Inbev\nThe selection procedure of AB Inbev is a pretty long drawn out process. Starts with online application followed by 2 online tests. One of them is a logical reasoning test while the other one is a behavioural test. Further shortlisting is based on your test results as well as your resume. After this you will have the individual business case round. It's essentially a case study where you have to recommend 2 seasonal beers for the launch based on the given data. You will be asked follow up questions based on your recommendations. I also had a standard HR interview along with the Business Case round. If you clear this, then you'll be invited for the business game round. You'll be divided into teams (with fellow applicants) and will be given certain roles in a company like VP Sales, VP Finance, President etc.. There would be certain objectives listed for the company and together you have to achieve those. It's a really fun game and you'll surely enjoy it. If you clear that, then they will fly you to Shanghai for the final round. The final round is a panel interview with the most senior management of AB Inbev like APAC President, Head Supply, Head HR etc.\nWhat are some of the FAQs that you faced and think students must definitely prepare for?\nI would advise people to prepare for resume based and HR Questions for companies like DB, Shell, AB Inbev and puzzles for GS. Technical questions mostly depend on the profile of the individual but as a general rule people should be thorough with their resumes and should be able to talk freely about their internships/projects. Questions like Walk me through your resume, Tell me about yourself are a given and should be answered without any problems. HR prep is one of the most underrated parts of placement preparation. You are bound to face HR Questions at some point or the other in the interview whether you are sitting for a technical role like ITC or a management role like Shell or AB-Inbev. But most of the people tend to leave HR prep for too late and hence suffer during the placements. Please do not make the same mistakes.\nWhat are things students can do from now till December to maximise their chances of getting through a company in this sector?\n1. GS – If you are really sure about going to GS then start reading about probability theory, expectation theory (If you want to go through the Quant route) and try learning coding (It would be a big advantage going into the placement season). But it is not something that can’t be done from July to December.\n2. AB Inbev – Nothing\n3. Shell – Nothing\n4. Finance: Get a good internship in the sector. Most of the people who were shortlisted either had great POR’s or had good internships in this sector. Since you can’t do a lot about the former, try to work on the latter. I believe that one of the major points that differentiated my resume from the rest of the people was my internship. Try to get an internship where you get to work on a live deal (like an IPO or M&A deal). It is a real great talking point in the interviews and would set you apart from the rest. Also, if you are sure about finance as a long term career choice, try to read about certifications like CFA, FRM etc. and see if they will help you further in your career. Do not give CFA blindly just for sake of getting shortlisted. These certifications will definitely help in shortlisting but you will have to defend them in a rigorous interview.\nResources\n1. GS – Heard on the Street, How to move Mount Fuji for puzzles; Prob & Stats lectures available on DC for probability.\n2. AB Inbev – Nothing\n3. Shell – Nothing\n4. Finance: CFA L1 material on Corp Fin, Financial Reporting and Analysis (FRA); Regularly follow financial news from Bloomberg/Reuters/Economic Times; if you are really sure about finance and have nothing better to do, then you can also view lectures from Aswath Damodaran on Corporate Finance (they are available on youtube)", "page": "Placement Interview Experiences"}, {"chunk_id": "850be6b2", "title": "Rishita Das - Placed at Rolls Royce", "text": "What was the general interview process for most companies of this sector? Please mention the number of rounds and the nature of the interview process.\nMost of the Aerospace companies had the following rounds:\n- CV shortlisting (sometimes they would shortlist all),\n- Technical/Quantitative/Mental Ability/Verbal test round : sometimes (like in case of Airbus) the test was specific to the job profile we applied to and involved purely technical questions of the field.\n- Interview (technical): generally half an hour to 1 hour long. Some companies ask questions from CV and other past experiences while some others focus on conceptual questions from core Aerospace.\n- Interview (HR): They ask questions on acads and extra acads in CV and maybe things you know about their company. They try to analyze your commitment and other attributes they are looking for in your answers. Keeping cool and confident with everything in your CV is the key.\nWhat are some of the FAQs that you faced and think students must definitely prepare for?\n- At the start of any interview(technical or HR): \"Tell me about yourself\". Keep it short and personal. Don't go with the scripted form of answering this question. This question can give a good first impression.\n- \"Where do you see yourself in 5/10 years?\"\n- If you have a high CGPA, prepare to answer the question- \"What is the guarantee that you won't leave the job and go for higher studies?\" ... Do not go with a cliched answer. Prepare your own and keep it natural and ensure it doesn't sound like a rehearsed one.\nWhat are things students can do from now till December to maximise their chances of getting through a company in this sector.\n- For Core companies, go through the basic concepts, possible questions and problems/puzzles of your courses of the last few years. Some ask from fundamentals while some interviewers ask from advanced level courses from 3rd or 4th years of study. So prepare both types well. While preparing, its best to do so with at least one friend. Make an approximate schedule/timetable with a friend and decide the subjects from your 1st-4th/5th years and other relevant topics that you want to read for the interviews.\nResources\nI just went through the posts in ambitionbox and other such websites for each company. Tried to look up commonly asked question types. It particularly helped in preparing for the tests, which are usually the first round.", "page": "Placement Interview Experiences"}, {"chunk_id": "ddcbecd4", "title": "Chandan Verma - Placed at Shapoorji Pallonji Group", "text": "What was the general interview process for most companies of this sector? Please mention the number of rounds and the nature of the interview process.\nCompanies in the civil sector usually follow a 3 rounds process, starting with the Resume short listing, Group Discussion and then the final Personal Interview Round. Civil Sector comprises are of two types, construction companies and the engineering consultants. Construction companies are usually looking up for management skills along with the technical skills as compared to the engineering consultants which are more of focused on the technical knowledge. Therefore the selection process of construction firms will also require a good communication skills along with sound technical knowledge.\nThe selection process of Shapoorji Pallonji Group comprised of 3 rounds. In the first round consisted of a technical(MCQ) test and a verbal ability[MCQ] test. Further the shortlisted students had a Group Discussion round, followed by the last round of Personal Interview where questions related to HR and Technical were asked.\nWhat are some of the FAQs that you faced and think students must definitely prepare for?\nHR questions like, Tell me about yourself? or Introduce yourself? or Walk me through your resume? are very common and mostly the opening questions.\nIf you have thought of entering into this sector you should always be prepared for the questions like, Why Civil? Why construction? Why not some non-core firms? Will you be able to work on field if required? and if you are from particular specialization like Structural Engg. then be prepared to face, Why not design? Why only construction?\nWhat are things students can do from now till December to maximize their chances of getting through a company in this sector?\nFirst of all it is very important to make up your mind whether you want to go into this sector or not, riding with legs on different boat never helps. So look up good for the pros and cons and then only continue with your preparations. For preparations for technical rounds, I suggest you just need to start brushing up the material of your courses till the 6th semester, prepare a notebook to write up the key formulas and tips that you will need to give a quick look before your interviews. For the preparations for HR rounds, I suggest keep practicing group discussions with your friends, try to write answers to the commonly asked HR questions and prepare up your resume well.", "page": "Placement Interview Experiences"}, {"chunk_id": "ca57e4a6", "title": "Gaurav Kumar Jha - Placed at Mazagon Dock Ltd.", "text": "What was the general interview process for most companies of this sector? Please mention the number of rounds and the nature of the interview process.\nShort PPT--> A 45 mins test ---> immediate results (in about 20 mins) arranged performance wise (13 people shortlisted) -->Detailed PPT ---> Interview (called in the same order of results), only 1 round of interview covering both technical and HR rounds\nWhat are some of the FAQs that you faced and think students must definitely prepare for?\nAbout the test - Not a difficult test to crack if your basics are sound. It consisted of 20 short MCQs (easy) covering metacentric height calculations, trim, MCT etc. Mainly covering hydrostatics (most imp), sea keeping & maneuvering, structural terms etc. It had two 5 marks questions - to draw a standard mid ship section, and identify some structural terms like deck girder, beam, bilge keel, floor etc. and the other was to identify ship types for some given ships (Titanic, INS virat etc). Finally 2 hydrostatics numericals, 10 marks each were asked.\nTest Preparation Tips - Hydrostatics is the most important thing to be studied. I referred to \"Introduction to Naval Architecture by Eric Tupper\" for quick revision.The numericals asked, were very similar to solved examples. I had my 2nd Year's internship over there. That helped a lot. You should have a little idea of ships built over there, mainly the ship types. Stay attentive during the intro/ ppt, they talk about it. Don't hurry during the test, there's ample amount of time.\nInterview Tips - Be very thorough with your internships and project. Two of my internships were core, the other was a steel plant training. All technical questions asked were related to the core internships. They may re-frame some situations(from internship) or may go into more depths of the topic covered in internships/ projects. You might not get to the final solution directly. They mainly check your approach, they also help you and give appropriate hints if your approach is right. Explain them what you are thinking, properly. In some cases (not for me) they also asked areas of interest, choose a topic you are very confident with.\nFor HR round you need to show them how interested you are really in joining the company and why you are a good fit for them. They also ensure that you don't run away too soon. So make sure you don't give that impression. Be confident, and explain yourself properly, give instances from your CV if possible to support your answers. For eg, I was asked at the end, are you ready to learn new things / do u mind learning completely new stuff.., to which i quoted from my internship where i learnt something new and completed my job and about my BTP where i was learning something new. Extra acads (mine were decent) was a field they did not touch directly but I bought that up in the conversation to support something and they had to notice.", "page": "Placement Interview Experiences"}, {"chunk_id": "20c27eab", "title": "Other Links", "text": "This section includes links to articles written by people who have sat in CDC interviews for placements and internships or have sat offline.\n• Himanshu Mundhra", "page": "Placement Interview Experiences"}, {"chunk_id": "13477d07", "title": "See Also", "text": "• Resources for Placements", "page": "Placement Interview Experiences"}]