[{"chunk_id": "30fb7efd", "title": "Resources for Placements", "text": "December can be a harrowing time for final year students who enroll themselves for the placement process. This wiki is an effort to compile the best-practices and resources that helped students get job offers, in various sectors. Each section contains interview processes, FAQs, placement semester preparation guides and a list of essential resources.", "page": "Resources for Placements"}, {"chunk_id": "766105a7", "title": "Sectors", "text": "The companies that visit campus to recruit students can be broadly categorized under the following sectors - consulting, investment banking/ finance, software development, data analytics, FMCG, and core engineering.", "page": "Resources for Placements"}, {"chunk_id": "bde432fd", "title": "Consulting", "text": "Interview Process\nThe interview process involves multiple levels of interviews. The initial rounds may be over telephone, Skype or in person subject to the company's preference. There maybe a total of 3-5 rounds of interviews. The interviews may be of the following types :\n• Case Interviews : They are the most important/difficult interviews for a consulting job. The question may or may not involve numbers. Be sure to ask as many questions as you can, and be at your presentable best.\n• Guesstimates/ Data Interpretation : The structure and methodology is far more important in these questions, than to get the numbers right.\n• HR Interviews : This involves usual HR questions with a special preference to how presentable the candidate is, to potential clients and also on what the candidate is really interested in, as consulting companies face attrition problems all the time.\n• \"Tell me something about yourself, walk me through your resume.\"\n• \"What's the most challenging environment/work you've faced?\"\n• \"Why consulting? Why the firm? Why you?\"\n• \"Where do you see yourself 5/10 years later?\"\n• \"What are your strengths? What are your weaknesses?\"\n• \"Mention one of your failures.\"\n• \"Questions on being a team player, leader, displaying ownership, creativity and initiatives\"\nPlacement Semester Survival Guide\n• Form a case group, and practice as many cases as you can. Your interviews must ideally be your interview number 50 or above.\n• Consulting companies love high points in your CV, be it in academics, extra-academics, sports, competitions, etc. So, highlight them, or further extend the list if possible.\n• Work on your communication skills. This is generally used to reject candidates even if they are good problem solvers, as the companies require you to speak to clients on a regular basis\nResources\n• Must do resources [Compulsory reads] Case in Point - Marc P. Cosentino Case Interviews Video Lectures by Victor Cheng Case Interviews Cracked, IIT Bombay IIM-A casebook\n• Advanced resources [Not compulsory, but increases chances in top tier firms] Vault Materials, ​​Bain Practice Case Video, Capital One Practice Case Video Cases on McK/ BCG or websites of any other Tier 1 firm Buddy cases : Practice as much as possible with the buddy you are given by the company", "page": "Resources for Placements"}, {"chunk_id": "509c6652", "title": "Investment Banking/Finance", "text": "Interview Process\nPlacement Semester Survival Guide\nResources\n• Investopedia\n• M&I\n• Wall Street Oasis\n• Vault", "page": "Resources for Placements"}, {"chunk_id": "0b2e9a0f", "title": "Software Development", "text": "Interview Process\nMost software companies have a online coding test usually held in CIC or Nalanda (with own laptops) for shortlisting of candidates for the interview process. This test has short programming questions and at times knowledge questions on programming languages. Most common questions on programming languages are on C,C++ or Java. After you qualify the coding test, you get shortlisted for the interview, usually for all the SDE positions. The general process consists of 2-3 technical rounds followed by 1 HR round. Some companies (Usually Microsoft) has a Group Discussion Round too to shortlist where they give a design question of a system where everyone is asked to collaborate and discuss on how to design the specified system as Company employees judge on how much a candidate contributes. In the technical rounds, they ask 2-3 coding questions which you have to code on paper(proper syntax and everything, not pseudo code) and/or domain related questions from DBMS, Networks, OS and ML(if mentioned in the resume). The biggest focus is on whether you can find an optimal algorithm to solve the given problem/ implementation, and then code it in a reasonable amount of time.\n• The coding questions are usually from DP or graph theory. Definitely brush up on your C++/Java skills - Base class / Super Class / OOP / Abstraction / Encapsulation\n• Preparing for the typical HR questions is a must. Other than that you should have \"introduce yourself\" prepared and oriented to the company position that you are applying to.\n• Explain one of the projects that you have worked on, in detail. Be sure to go through your resume very well and have something prepared for every project/ achievement that you have written on your resume.\nPlacement Semester Survival Guide\n• Code. Code. Code. Take an active interest in competitive programming. Participate in competitions by codechef/hackerrank/topcodef/codeforces.Even if you can solve the problem during the contest, go back later and check out the editorial, and then solve it. If you still cant, see the author's / tester's solution and then solve it. By december, you should be able to solve all problems easier than \"Medium\".\n• Try finishing of questions in all related domains on hackerrank - Algorithms/C++/Java/Python/Data Structures etc.\n• Strengthen your fundamentals in the core CS subjects such as DBMS, ML(if you have mentioned it in your resume), Networks and OS.\n• Practice competitive programming regularly on sites such as codeforces, codechef.\n• Take up projects. Setup a profile on Github, push your projects there.\nResources\n• Must do resources [Compulsory reads] geeksforgeeks.com, hackerrank domains, careercup, interviewbit.com, it helps to handle the corner test cases Introduction to Algorithms by Cormen/notes by Prof Abhijit Das\n• Advanced resources [Not compulsory, but increases chances in top tier firms] topcoder tutorials on advanced topics such as binary indexed trees, suffix arrays, segment trees Cracking the Coding Interview - Gayle Laakmann McDowell\n• Auxiliary read [They are not compulsory, but will definitely help] Competitive Programming - Steven Halim", "page": "Resources for Placements"}, {"chunk_id": "ac284cf4", "title": "Job Portals", "text": "• http://hasjob.co/\n• https://news.ycombinator.com/jobs\n• http://stackoverflow.com/jobs\n• http://indeed.com/\nExternal Links\n• GeeksForGeeks\n• CodeForces\n• InterviewBit\n• LeetCode\n• andreis/interview\n• How to Break Into the Tech Industry—a Guide to Job Hunting and Tech Interviews\n• Get that job at Google", "page": "Resources for Placements"}, {"chunk_id": "be17241d", "title": "Data Analytics", "text": "Interview Process\nThere are two types of quantitative interviews - CAT format, which can be mastered by practicing any of the materials available for CAT exams and the second type is based on basic probability, theory of expectation and brain storming.\nPlacement Semester Survival Guide\n• Study the basics of probability and statistics.\n• Go through first 4-5 chapters of Jain and Iyengar.\n• Learn the basics of machine learning and practice it by participating in various online competitions.\n• Try and get an internship in this sector.\nResources\n• Must do resources [Compulsory read] Hines for probability and statistics. Intro to machine learning by Andrew NG(Coursera) Applied multivariate statistical modelling by J Maiti(NPTEL) 50 challenging problems in probability by Frederick Mosteller Heard on the street\n• Advanced resources [They are not required for all companies, but will improve chances in top tier firms] Introduction to algorithms by OCW, MIT McgrawHill brain teasers Caltech Machine Learning Stanford Core NLP on coursera\n• Auxiliary read [They are not compulsory, but will definitely help] Read various answers on Quora for Machine Learning and Data scientists Online blogs by successful data scientists Introduction to Algorithms by Cormen", "page": "Resources for Placements"}, {"chunk_id": "54c63985", "title": "FMCG", "text": "Interview Process\nPlacement Semester Survival Guide\nResources", "page": "Resources for Placements"}, {"chunk_id": "c449461b", "title": "Aerospace Engineering", "text": "Interview Process\nPlacement Semester Survival Guide\nResources", "page": "Resources for Placements"}, {"chunk_id": "41d65077", "title": "Civil Engineering", "text": "Interview Process\nPlacement Semester Survival Guide\nResources", "page": "Resources for Placements"}, {"chunk_id": "b9b3f78c", "title": "Automobile", "text": "Interview Process\nPlacement Semester Survival Guide\nResources", "page": "Resources for Placements"}, {"chunk_id": "eb62d95d", "title": "Manufacturing", "text": "Interview Process\nPlacement Semester Survival Guide\nResources", "page": "Resources for Placements"}, {"chunk_id": "22e6ed7f", "title": "Ocean Engineering and Naval Architecture", "text": "Interview Process\nPlacement Semester Survival Guide\nResources", "page": "Resources for Placements"}, {"chunk_id": "f27cd74b", "title": "Chemical Engineering", "text": "Interview Process\nPlacement Semester Survival Guide\nResources", "page": "Resources for Placements"}, {"chunk_id": "f0408fa6", "title": "Oil & Gas", "text": "Interview Process\nPlacement Semester Survival Guide\nResources", "page": "Resources for Placements"}, {"chunk_id": "a079b8a1", "title": "Biotechnology", "text": "Interview Process\nPlacement Semester Survival Guide\nResources", "page": "Resources for Placements"}, {"chunk_id": "bc2440d7", "title": "See Also", "text": "• List of internship programs", "page": "Resources for Placements"}]