[{"chunk_id": "c41542a5", "title": "Robotics", "text": "Robotics at IIT Kharagpur is worked on, promoted, and propagated by the activities of several technical societies and student run research groups. The Centre for Excellence in Robotics is the umbrella organisation of all robotics related activities, and is currently funding 12 research projects through SRIC . These projects are in multiple departments involving fields varying from humanoid, aerial vehicles, social assistants, underwater vehicles and more.\nIn addition to doing research, many of the groups participate in national and international robotics competitions, providing the involved students an opportunity to learn more about the advancements pushing forward the field of robotics. The competitions include IGVC , FIRA , IARC , Robocup , and RoboSub . Robotics is also a popular field for the Inter-Hall hardware exhibition where many halls develop products on robotics and automation, including a wall climbing human skeleton, a bomb diffusing robot, a gesture-controlled arm, a humanoid robot, all-terrain vehicles and transforming robots. [ 1 ]", "page": "Robotics"}, {"chunk_id": "82d2186d", "title": "History", "text": "A \"Lumos\" robot, showcased at Robotix 2013.\nRobotics at IIT Kharagpur has a long history which, until recently, revolved around initiatives by students. It started in the form of a small student run society called Technology Robotix Society , with the aim of spreading the culture of robotics in Kharagpur and India, in the year 2001. The society formed a group called the Kharagpur Robotics and Artificial Intelligence Group (KRAIG), which was a group of students who would teach hobby robotics to students in IIT Kharagpur. Over time, they started doing workshops across India in colleges like NIT Durgapur, JIIT, BIT Mesra and many more. As they popularised robotics in India, in order to keep the wheel running, they came up with Robotix, the annual robotics competition. The fest became a hub of hobby robotics and a huge platform for people across the country involved in hobby robotics to meet and showcase their skills. [ 2 ] [ 3 ]\nA differential drive robot built by first years in KRAIG .\nFile:Agvteam.jpg Team AGV\nSoon, robotics started becoming more popular and students started shifting from hobby robotics to robotics research. They started participating and performing in competitions like DRDO Ground Vehicle and IIT Kharagpur hosted Robocup@India in 2009 [ 4 ] with the help of Prof. Pedro Lima , former trustee of Robocup foundation and Aamir Ahmad . This brought the attention of professors on campus initiating two of the oldest robotics projects at IIT Kharagpur – AGV and KRSSG . [ 3 ]\nFile:KRSSGteam.jpg Team KRSSG with Bronze Trophy in Dajeon, South Korea during FIRA 2015.\nAs more students started to show interest in robotics, professors C.S.Kumar and D. K. Pratihar from the Department of Mechanical Engineering started offering projects in robotics. [ 5 ] Two courses were also started on robotics in the Department of Mechanical Engineering. With the advent of robotics in IIT Kharagpur, a proposal for a Centre for Excellence in Robotics was drafted with the initiative of Prof. Partha Pratim Chakrabarti , with the help of multiple professors and Nalin Gupta, a final year student and then Student Coordinator of AGV in August 2014. [ 1 ] This included 10 robotics project proposals from multiple departments, students and professors. [ 3 ]\nIn December 2014, the proposal was accepted, and included 12 projects and a total fund of ₹ 5 crore approved through the Institute and Centre for Excellence in Robotics [ 5 ] was kick-started with Prof. D. K. Pratihar as its \"Overall Coordinator\". [ 5 ] [ 3 ] Currently, all 12 projects are running independently funded through Sponsored Research and Industrial Consultancy (SRIC). [ 3 ]", "page": "Robotics"}, {"chunk_id": "391b7dd6", "title": "Courses", "text": "Currently, IIT Kharagpur officially offers only three courses related to robotics, all in the Department of Mechanical Engineering. [ 5 ]\nSubject Number | Course Name | Professor\nME60352 | Robotics | Dilip Kumar Pratihar\nME60416 | Mechanisms and Robot Kinematics | Cheruvu Siva Kumar\nMF30003 | Robots and Computer Controlled Machines | Dilip Kumar Pratihar, Asimava Roy Chowdhury\nHowever, many courses related to robotics are taught in different departments, such as Image Processing, Embedded Systems, Control Systems.", "page": "Robotics"}, {"chunk_id": "f9405d5d", "title": "Robotics in Inter-Hall Hardware Modelling Competition", "text": "Original Article: Inter-Hall hardware exhibition\nThis section requires expansion .", "page": "Robotics"}, {"chunk_id": "de6bb72a", "title": "Alumni involved in robotics-related activities", "text": "• Sumandeep Banerjee - Co-founder + former CTO, 3DPhy\n• Hema Swetha - Doctoral student in Computer Science, Cornell University\n• Dr. Aamir Ahmad - Post Doctoral Fellow in Robotics, Max Planck Institute of Biological Cybernetics\n• Sanjiban Choudhury - Doctoral student in Robotics, Carnegie Mellon University\n• Ishani Chatterjee - Masters student in Robotics, Carnegie Mellon University\n• Shushman Choudhury - Masters student in Robotics, Carnegie Mellon University\n• Mrinal Mohit - Masters student in Camera Culture, Media Lab, Massachusetts Institute of Technology", "page": "Robotics"}, {"chunk_id": "955b0664", "title": "Startups", "text": "• 3DPhy\n• Auro Robotics", "page": "Robotics"}, {"chunk_id": "260983cd", "title": "See Also", "text": "• Centre for Excellence in Robotics\n• Kharagpur Robosoccer Students' Group\n• Kharagpur Robotics and Artificial Intelligence Group\n• Technology Robotix Society", "page": "Robotics"}, {"chunk_id": "1a20a17c", "title": "References", "text": "↑ 1.0 1.1 Verified by Dementor on September 21, 2015. ↑ \"Robot festival at IIT Kharagpur\" . Times of India. October 26, 2013 . Retrieved September 21, 2015 . ↑ 3.0 3.1 3.2 3.3 3.4 Verified by Dementor on September 14, 2015. ↑ Interview of Kaustubh Tripathy, 2009 Graduate, IIT Kharagpur ↑ 5.0 5.1 5.2 5.3 Website for Centre for Excellence in Robotics", "page": "Robotics"}]