[{"chunk_id": "d84b3eea", "title": "School of Medical Science and Technology", "text": "File:MedicallScienceKGP.jpg School of Medical Science\nInnovations in technology have led to spectacular advancements in medicine. To meet the challenges posed by medicine in the 21st century, the country needs a new breed of medical professionals who can fuse together medicinal science with technology and can bridge the two disciplines. Likewise, we also need a new breed of engineers with intricate knowledge of the complexities of medical and biological sciences. In the year of its Golden Jubilee in 2001, the School of Medical Science &Technology (SMST) was started at IIT Kharagpur with the objective to provide a platform of interdisciplinary teaching and research in diverse areas of medical science and technology. The School has collaboration with some of the best medical research institutes and medical industries from all over the world. The School introduced an interdisciplinary 3 years Masters Program in Medical Science and Technology (MMST) - first of its kind in the country. Admission to the MMST program is granted to MBBS doctors each year on the basis of the performance in an entrance test conducted all over the country. The MMST program offered by the School is the only comprehensive physician-scientist training program in India which aims to bridge the gap that has historically separated biological sciences from engineering and physical sciences. The school also offers a 4 semester M.Tech program in Medical Imaging &Informatics. SMST also offers PhD programs. Several students from the school have received prestigious awards and fellowships like Nehru-Fulbright, Khorana, DAAD scholarships etc. The School has a number of well-equipped state-of-the-art laboratories and is supported by an excellent faculty, in addition to many other faculty members from different departments of the Institute who have contributed considerably in building up these programs. [ 1 ] Prof. Suman Chakraborty is currently the Head of the School .", "page": "School of Medical Science and Technology"}, {"chunk_id": "9db2a3e2", "title": "Research Areas", "text": "• Atherosclerosis and non-coding RNAs\n• Biomedical devices, Flexible electronics\n• BioMEMS\n• Bone Regeneration & Bone Tissue Engineering\n• Cardiac developmental biology", "page": "School of Medical Science and Technology"}, {"chunk_id": "85742bb6", "title": "Research Laboratories", "text": "• Ammunology\n• Bio-Instrumentation\n• Biomaterials And Tissue Engineering\n• Bio-Mems\n• Biostatistics", "page": "School of Medical Science and Technology"}, {"chunk_id": "01d98121", "title": "References", "text": "↑ http://www.iitkgp.ac.in/department/MM", "page": "School of Medical Science and Technology"}]