[{"chunk_id": "30b0fc66", "title": "School of Water Resources", "text": "The School of Water Resources at IIT Kharagpur is one of the pioneer centres for education and training in water quality and quantity management. It aims at providing integrated and interdisciplinary approaches involving hydrological, environmental, chemical, biophysical, economic, institutional, and policy-planning aspects, to solve the ever-growing water-related challenges in domestic, agriculture and industry sectors. It aims to develop knowledge, insight and engineering skills required to design, implement and evaluate water management policies and strategies. The school offers interdisciplinary full-time M.Tech. (in Water Engineering and Management) and Ph.D. (full-time/part-time) programmes to the students, professionals and researchers from multiple disciplines of Civil Engineering, Agricultural Engineering, Chemical Engineering, Biotech Engineering and Mining Engineering. Admissions are considered under Regular (with assistantship through GATE) as well as sponsored categories. The School entertains professionals working in water services sector in private organizations as well as in the water management related departments of central and state governments for short-term training and specific project assignments. They are trained and encouraged to employ the latest technologies being used worldwide for analyzing and solving the real-field problems in the water sectors.\nProf. Ashok Kumar Gupta is the current Head of the School . [ 1 ]", "page": "School of Water Resources"}, {"chunk_id": "27b5581a", "title": "Research Areas", "text": "• Bioremediation and Biodegradation\n• Contaminated Site Management\n• Fate and Transport of Contaminants\n• Integrated River Basin Management\n• Meso-scale Solute Transport Dynamics\n• Real-time flood modeling and forecasting\n• Remote Sensing in Hydroinformatics\n• Smart Water Distribution Systems\n• Surface water - Groundwater interaction\n• Water & Wastewater Treatment / Recycling", "page": "School of Water Resources"}, {"chunk_id": "4e61a463", "title": "Research Laboratories", "text": "• Water Quality Lab", "page": "School of Water Resources"}, {"chunk_id": "ee7dabdd", "title": "References", "text": "↑ http://www.iitkgp.ac.in/department/WM", "page": "School of Water Resources"}]