[{"chunk_id": "71301af1", "title": "School of Bioscience", "text": "File:Bioscience.jpg Bioscience\nThe School of Bio Science (BS) has been established to facilitate cutting-edge research and education in the fields of biological and biomedical sciences. This school builds on the strong tradition of interdisciplinary research in IIT Kharagpur. Our multi-disciplinary approach will ensure diverse areas of research that include studies at the level of molecules (biochemistry, biophysics, molecular & structural biology) to organisms (cellular and developmental biology, microbiology and immunology). The overarching goal of this school is to elucidate the structure and function of biological molecules that influence the physiology of an organism, and more importantly apply these basic findings to the discovery of novel therapeutic solutions for various human diseases to enhance human health.\nWe will use state-of-the-art facilities to study biological macromolecules in both normal and diseased states. Biophysical methods such as X-ray crystallography, NMR spectroscopy, surface plasmon resonance (SPR) spectroscopy, analytical ultra-centrifugation (AUC) and isothermal titration calorimetry (ITC) will be used to study the molecular and structural basis of macromolecular functions. A few areas of interest are - regulation of transcription factors, DNA repair mechanisms, protein folding and mis-folding, intrinsically disordered proteins, enzyme catalysis and protein engineering.\nMolecular biology studies will be supported by strong research and training programs in cell biology, developmental biology and genetics. The common themes will include regulation of gene expression, signal transduction, intracellular trafficking, cell cycle and apoptosis, cell polarity and migration, cell-cell interactions, pattern formation and organ development.\nA major focus of our research is the discovery of therapeutic strategies for various human diseases based on our fundamental molecular and cellular biology research. We will study many important diseases including, but not limited to, cancer, autoimmune diseases, neurodegenerative diseases, heart and respiratory diseases, diabetes and tuberculosis.\nFor further informations please contact at [email protected] . [ 1 ]\nProf. Amit Kumar Das is the current Head of the School.", "page": "School of Bioscience"}, {"chunk_id": "c21eaa28", "title": "Research Areas", "text": "• Ageing and neuro-degenerative disorders\n• Biochemistry\n• Biophysics\n• Cell adhesion molecules\n• Developmental neurobiology", "page": "School of Bioscience"}, {"chunk_id": "750bcfaf", "title": "References", "text": "↑ http://www.iitkgp.ac.in/department/BS", "page": "School of Bioscience"}]