[{"chunk_id": "bc53593a", "title": "Facilities", "text": "The heart of all the sports activities at Kgp is the \"Technology Student's Gymkhana\" In Gymkhana, there are 4 Badminton courts , pool table , TT tables , Squash court and Gymnasiums for both student and faculty. We also have Basketball courts, Volleyball courts, Tennis court & Swimming Pool at different locations in the campus. Moreover, KGP has 2 ultimate playgrounds. To check their exact location ,please visit our Know the campus link in the footer. Even the Halls have some courts , gym utilities and sports facilities. Halls also provide sport equipments to play any sport, and one can borrow them from the hall security office.", "page": "Sports Facilities"}, {"chunk_id": "e88835b1", "title": "Events", "text": "There are many sports events going on in the campus throughout the session.You have to practice hard and brush up your skills for participating in these events since every year the competition keeps growing fiercer. If you play Badminton or TT or Squash or any other individual game or you are an athlete then Fresher's Events is your deal. That's the platform for you to show everyone that you have got what it takes to be among the best. They are generally organised in the month of August. They are not only fun to participate in but also your first step towards your dream, THE INTER IIT .\nNext in line, are the Inter Hall Events.They are extremely important not only to the hall but also for the players. In these events teams of every hall play against other hall in order to collect points and fight for the cup of The General Championship, Sports (GC). Hall tempo is at its highest during these events. Once you enter the arena, you will automatically develop so much sento to your hall which you never felt. Last year we experienced it ourselves.\nThis has nothing to do with the topic but I'll still tell you. Last year we were sitting in the front rows of the basketball court cheering for LBS in the inter-hall final against MS, which we won. That was an incredible experience and we felt like we were playing on the court. So we shouted and hooted as hard as possible. And after we won, there was a big scuffle between the two halls, for which we were very much responsible. Anyways, getting back on track....\nBe clear that not everyone is cut out to play in GC. You have to attend the practice sessions of the game you want to participate in and then team will be selected by seeing the skill and the tempo of the player. Remember, in Kgp,Tempo always comes before skill. The team selection for individual games are greatly influenced by the Fresher's Events. Practice sessions for GC usually start in the starting of the month of January.\nThe list doesn't end here. We also have Open IIT events in which any one from the campus can participate regardless of his year or hall.They generally occur a few weeks after the winter break. Even the winter vacations are packed up.Inter IIT's take place during that time. The Inter IIT team is also selected on the basis of Inter IIT practice sessions.", "page": "Sports Facilities"}, {"chunk_id": "7a518802", "title": "Forms", "text": "Some of the facilities provided by the gymkhana require modest fees. To be specific ,they are : Gym , Squash , Billiards & Swimming Pool. You have to fill up the forms which are available on the the Gymkhana website. But number of these forms are limited so you have to be aware when the forms are being released.They are released at the start of each semester.", "page": "Sports Facilities"}]