[{"chunk_id": "5e2635ec", "title": "Squash", "text": "One of the newest additions to the Inter IIT Sports Meet, squash was Introduced as a preliminary sport in 2008 and was officially included in the point tally as the 13th sport in 2010. [ citation needed ] The sport started with an initial participation of 7 IIT's which has now reached a total of 9 IIT's with the latest inclusions of IIT Jodhpur and IIT-BHU .", "page": "Squash"}, {"chunk_id": "33894888", "title": "Background", "text": "Squash is a racquet sport played by two (singles) or four players (doubles) in a four-walled court with a small, hollow rubber ball. The players must alternate in striking the ball with their racquet and hit the ball onto the playable surfaces of the four walls of the court. The game was formerly called squash racquets, a reference to the \"squashable\" soft ball used in the game (compared with the harder ball used in its sister game racquets).\nIn Inter-IIT however, it is a purely singles team tournament where each team comprises of 4 players and of that 3 players play singles games of best of 5 sets. The first team to win 2 singles games wins the match. 9 teams in the Inter-IIT are divided into 2 groups of 5 and 4, and the top 2 from each group qualify for the semi-finals. [ unverified ]", "page": "Squash"}, {"chunk_id": "4d09d84e", "title": "Infrastructure", "text": "Currently, IIT-KGP has one court built inside the Technology Student's Gymkhana near the gymnasium. This court was built in the year 2011, just before the Inter-IIT was scheduled to be held in IIT-Kharagpur. As for the rest of the IIT's, most of the well-established IIT's have far superior infrastructure as compared to IIT-KGP with IIT's like Bombay and Kanpur having 3 courts each and Madras having 2 courts. IIT-Roorkee have the most well-established squash infrastructure with a total of 5 courts. [ citation needed ]\nProposals relating to the increase in the number of squash courts have already been discussed with Gymkhana officials and plans are in place for the construction of 2 more courts in the near future. With IIT-KGP set to host the games in the year 2018, a revamp of infrastructure would include the construction of these courts. [ citation needed ]\nAs for the basic equipment required to play the sport, apart from rackets and balls, non-marking shoes are compulsory for anyone having a desire to learn the sport. [ citation needed ]", "page": "Squash"}, {"chunk_id": "3fac7757", "title": "Inter-IIT [ citation needed ]", "text": "Year | Performance\n2010 | Groups exit\n2011 | Groups exit\n2012 | Groups exit\n2013 | 4th place finish\n2014 | Bronze medal", "page": "Squash"}, {"chunk_id": "7f9d5147", "title": "Others", "text": "Apart from this, IIT-KGP recently participated in Udghosh , the annual sports meet of IIT-Kanpur and bagged a silver medal. [ unverified ]", "page": "Squash"}, {"chunk_id": "52c598f5", "title": "Trials", "text": "Inter IIT probables are selected on the basis of performance in the Open IIT tournament held every year. All the quarter-finalists of the tournament are selected as probables.Post this, a masters tournament is held between these 8 players and the final playing team of 4 members is finalised. [ unverified ]", "page": "Squash"}, {"chunk_id": "5d2a63ef", "title": "Past Teams", "text": "Past Inter IIT teams are as given below [ unverified ] :\nOngoing Inter IIT match between IIT-KGP and IIT-Madras\nBronze-Winning squash team of IIT-KGP\n2010\nSachin Sharma IM'11 (C)\nShirin Kumar\nAnant Agarwal GG'15\n2011\nSachin Sharma IM'11\nShirin Kumar (C)\nAnant Agarwal GG'15\nRaghav Singhal IM'15\n2012\nAbhishek Nahar MA'14 (C)\nAbhishek Malhotra CH'15\nAnchit Singh CY'16\nShubhayan Ghoshal IM'15\n2013\nAnant Agarwal GG'15 (C)\nAbhishek Malhotra CH'15\nAnchit Singh CY'16\nShubhayan Ghoshal IM'15\n2014\nAnchit Singh CY'16 (C)\nAbhishek Malhotra CH'15\nAnant Agarwal GG'15\nSanket Mandal ME'18", "page": "Squash"}, {"chunk_id": "3318b47f", "title": "Office Bearers", "text": "The current office bearers in the Technology Student's Gymkhana are [ citation needed ] :\nSecretary - Pranjal Jain\nGeneral Secretaries - Sanket Mandal, Gaurav Shenoy", "page": "Squash"}, {"chunk_id": "6f68e433", "title": "Institute award holders", "text": "Institute award holders in the sport are [ citation needed ] :\n• Anant Agarwal - Instiute Blue\n• Abhishek Malhotra- Institute Blue\n• Abhishek Nahar- Special Mention\n• Shubhayan Ghoshal- Special Mention", "page": "Squash"}]