[{"chunk_id": "cf93ffca", "title": "SRIC", "text": "The Institute has laid strong emphasis towards generation of resources and active collaboration with national / international industries and R&D organisations with escalating cost of state of the art R&D activities. Sponsored Research & Industrial Consultancy (SRIC), a special R&D Cell, was set up in 1982 as an interface between funding agencies and the Institute to handle sponsored research projects and industrial consultancy assignments. The cell, equipped with computerised office and in-house banking facility, has the capacity to handle 600 R&D projects at a time frame. SRIC has so far handled about 1221 research projects worth Rs. 104 crores. Currently the centre has over 450 sponsored projects from national and international clients to the tune of over Rs. 40 crore. [ 1 ] SRIC also has a student body called Technology Transfer Group .", "page": "SRIC"}, {"chunk_id": "d9f685c6", "title": "Projects", "text": "Indian Institute of Technology has been a pioneer in dealing the technical projects ever since its establishment in 1951.So here is the list of both Sponsored and Consultancy Projects undertaken by the institute.\n• Sponsored Projects\n• Consultancy Projects", "page": "SRIC"}, {"chunk_id": "2096a7bc", "title": "Intellectual Property Rights", "text": "• The Institute strongly believes that the intellectual property rights of a person are not only to be protected but also commercially exploited.\n• Workshops and Seminars have been organised in the Institute to enlighten the faculty, scientists and students on the various IPR issues. 127 patents have so far been filed on various innovations/development of technologies, of which about 25 patents have been granted.\n• The Institute has set up an IPR and Industrial Relations Cell under SRIC to look after the interest of the faculty members and the funding agencies.\n• A few technology transfer agreements has been made on enzyme based un-hairing process using agro-residues, acid-proof cement & allied products from rice-husk ash, low-cost portable weigh bridge, nano-sized zirconia powder, heat resistant cable insulants etc and two major know-how transfers have been already finalised.", "page": "SRIC"}, {"chunk_id": "334f8c5a", "title": "Contacts", "text": "Contact List of SRIC [ 2 ] :\nName | Designation | Office Ph. No. | Email ID\nS K Biswas | Senior Administrative Officer | 282190 | sumit[at[adm.iitkgp.ernet.in\nR Banerjee | Assistant Registrar | 282088 | raj[at]sric.iitkgp.ernet.in\nB Dutta | Administrative Officer | 282204 | bdutta[at]adm.iitkgp.ernet.in", "page": "SRIC"}, {"chunk_id": "5a5ece0d", "title": "External links", "text": "List of past clients and sponsors. [ 1 ]", "page": "SRIC"}, {"chunk_id": "79132257", "title": "References", "text": "↑ 1.0 1.1 SRIC TTG Website ↑ IITKGP Website", "page": "SRIC"}]