[{"chunk_id": "f97548f3", "title": "Student Brotherhood Fund", "text": "Every year all the students have to necessarily pay an amount of Rs. 200 towards student brotherhood fund.", "page": "Student Brotherhood Fund"}, {"chunk_id": "1c2c7801", "title": "Glossary", "text": "(i) ' Rules ' mean rules framed by the Committee.\n(ii) ' Committee ' means Students' Brotherhood Fund Committee (SBFC).\n(iii) ' Director ' means Director of the Institute who shall remain as the Patron of the Committee.\n(iv) ' Chairman ' means Chairman of the Committee.\n(v) ' Secretary ' means Secretary of the Committee.\n(vi) ' Donor ' means Donor for the Fund.\n(vii) ' Fund ' means Students' Brotherhood Fund of lIT Kharagpur.\n(viii) ' Students ' means the on-roll students of IIT Kharagpur and who contribute to SBFC Fund through their semester fees.\n(ix) ' Member ' means a Member of the Committee as contemplated below.\n(x) ' Session ' means Academic Session staring from the month of July of every year and continuing till the month of June in the next calendar year.\n(xi) ' Auditing ' means auditing as contemplated in paragraph H (M) below.", "page": "Student Brotherhood Fund"}, {"chunk_id": "e721dd16", "title": "Composition of the committee", "text": "1. One Faculty Member (nominated by the Director) - Chairman\n2. Dean (Undergraduate Studies) - Member\n3. Dean (Postgraduate Studies & Research) - Member\n4. Dean (Students' Affairs) - Member\n5. President, Technology Students' Gymkhana (TSG) - Member\n6. Chairman, Hall Management Centre (HMC) - Member\n7. Vice President (VP), TSG - Member\n8. One Assistant/Deputy Registrar (nominated by the Director) - Secretary\nTenure\nFor SI. No. 1 & 8 = As would be deemed fit by the Director\nFor St. No. 2 to 7 = Ex-officio\nFrequency and quorum of Meetings : At least once in every semester and five\nmembers shall form a quorum for a meeting of the Committee.", "page": "Student Brotherhood Fund"}, {"chunk_id": "e3fdf3c2", "title": "Objectives of the fund", "text": "The primary goal of the fund is to promote the feeling of oneness in the student fraternity of IIT Kharagpur within the Halls of Residence as well as outside.\nThe funds can be used in following two ways by the deserving student applicants to meet their own educational/medical expenses.\n• Loans of Honour(interest free but to be refunded)\n• Donations(non-refundable)", "page": "Student Brotherhood Fund"}, {"chunk_id": "4d9aaf09", "title": "Procedure to avail the funds", "text": "Students have to follow f\n• Students are to apply in a SBFC Form for \"Loan of Honour\" and on a plain paper for the \"Donation\" to meet their own educational and/or medical expenses.\n• Such applications accompanied with all relevant paper documents must be addressed to the Chairman, SBFC through (a) the concernedHead of the Deptt. / Centre/ School and (b) any of the Dean PGS)/ (UGS)/ (SA). The\n• Committee may also invite applications from the needy students for such types of financial assistance through a circular to all concerned. Such circular must contain all the detailed procedure of applying for the purpose.", "page": "Student Brotherhood Fund"}, {"chunk_id": "95c8f993", "title": "Things to be noted", "text": "Loan of Honour/ Donation amount will not ordinarily exceed Rs. 50,000 at a time. Depending upon the merit of the case, SBFC may decide upward revision of the aforesaid upper limit to an applicant in an exceptional condition/ situation whatsoever.\nSubject to availability of funds and merit of the case, such assistance amount may be made available\n(a) twice to a student during the total span of his/her stay at this Institute to continue studies in a 4/ 5 year programme, and\n(b) once to those in a 2/ 3 Year course", "page": "Student Brotherhood Fund"}, {"chunk_id": "497ddb41", "title": "Repayment of the sanctioned loan", "text": "• Student Members (who are sanctioned \"Loans of Honour\") are required to repay the loan amount when their financial position improves either during their study period at the Institute or immediately after their placement on completion of their studies.\n• Reminders may be sent at periodical intervals after a period of 2 years (from the date of sanction of the loan amount).\n• The Committee shall have the power to write-off, with the prior approval of the Director, any amount lying outstanding against student members for the last five-years.", "page": "Student Brotherhood Fund"}, {"chunk_id": "608467c2", "title": "Transactions for year 2019-2020", "text": "Following are the details of the transaction made during the year 2019-2020 (i.e. from 01-07-2019 to 30-06-2020)\n• Student's Contribution transferred from lIT Kharagpur to Brotherhood Fund = Rs. 21,77,400\n• Fund utilized : Donation to students for Medical Reimbursement = Rs. 3,22,022 Loan issued to various Warden, Halls of Residence for distribution to needy Students = Rs. 5,52,384\n• Closing Balance of Bank Account as on 30-06-2020: Syndicate Bank (A/c-9556XXXXXXXX9X) = Rs. 1,13,873 Syndicate Bank (A/c-9556XXXXXXXX8X) = Rs. 72,54,015\n• Fixed Deposit in Syndicate Bank as on 30-06-2020: Face Value of TDR = Rs. 1,38,47,671 Accrued Interest = Rs. 6,62,161 Total = Rs.1,45,09,832", "page": "Student Brotherhood Fund"}, {"chunk_id": "cc687688", "title": "Management of the Fund", "text": "The fund shall be managed by the Committee, consisting of two members, viz., the Chairman and the Secretary,", "page": "Student Brotherhood Fund"}, {"chunk_id": "62f94749", "title": "Accounts of the Fund", "text": "• All money received by the Fund shall be deposited in two separate Savings Bank Accounts known as \"Students' Brotherhood Fund Committee\" and \"S8FC Special Fund\".\n• Both the accounts will be with the syndicate Bank, SRIC TIT Kharagpur. The \"SBFC Special Fund\" will be operated exclusively meant for 'donations' sanctioned to the students (which need not be refunded) in the Syndicate Bank, SRIC JIT Kharagpur.\n• Both the accounts shall be jointly operated by the Chairman and the Secretary. The Committee shall have the power to invest surplus money of the fund in a suitable manner duly ratified by the Committee.\n• The Accounts of the Fund shall be audited annually on Academic Session basis (i.e., from July to June) by a member of the Institute with the approval from the Director. The audited statement of Accounts shall be considered by the Committee and submitted to the Director with their observations.", "page": "Student Brotherhood Fund"}, {"chunk_id": "4ae51af0", "title": "Mode of Operation of the Fund", "text": "• To operate and maintain proper bank accounts and ledger registers, etc., for Students' Brotherhood Fund Committee and also to arrange auditing the accounts of the same.\n• To submit periodic reports on the activities on an academic year basis and statements of accounts on a financial year basis to the Director, lIT Kharagpur.", "page": "Student Brotherhood Fund"}, {"chunk_id": "4685af00", "title": "Amendment to the Rules", "text": "• The Committee may amend or delete any of these rules or introduce any new rule or rules subject to approval of the Director.\n• These rules repeal all previous rules.", "page": "Student Brotherhood Fund"}, {"chunk_id": "1f367dc6", "title": "Reference", "text": "The information above was possible because of an RTI application submitted to IIT Kharagpur. Please click here to read the original reply from institute.\nFollowing was the original query submitted:\n• Every semester a part of the fees which each student has to compulsorily pay is Brotherhood fund but no one has any idea how this is used and when in need how a student can avail this facility.\n• I would like the institute to kindly let me know how much money has been collected in this fund till now, where and how much of it is used, and lastly how much money is left in the fund right now.\n• Also, the exact conditions and method by which one can make a withdrawal/use this fund.", "page": "Student Brotherhood Fund"}]