[{"chunk_id": "97c082ae", "title": "Summer quarter", "text": "The Summer Quarter is a period of additional classes and instruction organised every year during the summer vacations, to help undergraduate students who did poorly during the regular semester. To understand the Summer Quarter rules in detail, please read through the UG Regulations. [ 1 ] Summer Quarter may not be organised for every subject.", "page": "Summer quarter"}, {"chunk_id": "13ce2d19", "title": "Duration", "text": "The duration of the Summer Quarter shall be seven weeks from around the middle of May till around the end of June. The exact dates for holding the Summer Quarter for a particular session shall be decided by the Senate every year while finalizing the Academic Calendar.", "page": "Summer quarter"}, {"chunk_id": "34185138", "title": "Attendance Requirement", "text": "The attendance requirement for the Summer Quarter shall be the same as for a regular semester. A student who does not satisfy the norms will not be allowed to appear at the examination.", "page": "Summer quarter"}, {"chunk_id": "69b9d1be", "title": "Eligibility", "text": "• The students of 4-year B.Tech. (Hons.), 5-year B.Arch. (Hons.) and 5-year Integrated M.Sc. courses are eligible to register for the Summer Quarter if any is offered. Students of 5-year Dual Degree program are eligible to register for only those subjects, which are listed in the curriculum up to their eighth semester of study if any is offered.\n• Only those students will be permitted to register themselves for a subject offered in the summer quarter who have cleared all institute and hall dues till date and have paid the necessary fees and mess advances for the summer quarter for which they are registering.\n• A student will be eligible to register in a subject if he/she actually appeared at the last end-semester examination in that subject and obtained the grade ‘F’.\n• A student, who could not appear at the end semester examination due to self-illness or calamity in the family, will also be eligible to register for the subjects concerned in the Summer Quarter if his/her attendance was satisfactory in the judgement of the teacher.\n• Students who have obtained CGPA lower than 6.00 may be allowed, on the recommendation of the head of the department and the approval of the [[Dean (Academic Affairs)]], to re-register in one or more subjects in which he/she received ‘P’ grade(s), so as to improve his/her CGPA to 6.00 or above, provided that the subject(s) is/are otherwise being offered in that semester and there is no clash in the time table. The grade will be revised and recorded only if there is an improvement.", "page": "Summer quarter"}, {"chunk_id": "33e944d5", "title": "Supplementary Exam", "text": "Main article: Supplementary Exam\nNo Supplementary Examination shall be held in a subject that is being offered in the Summer Quarter of the session unless extraordinary circumstances justify it.", "page": "Summer quarter"}, {"chunk_id": "81a8ecff", "title": "References", "text": "↑ \"UG Regulations\" (PDF) . IIT Kharagpur. pp. 16,17 . Retrieved Jan 31, 2012 .", "page": "Summer quarter"}]