[{"chunk_id": "d4ca9030", "title": "Supplementary Exam", "text": "• A student will be eligible to appear in the supplementary examination in a subject if he/she actually appeared at the last end-semester examination in that subject and obtained the grade 'F'.\n• However if a student has been absent in the End Semester Examination. Due to medical reasons, that are duly certified by B C Roy Technology Hospital or Due to a calamity in the family his/her case will be considered for supplementary with full credit. In such cases, the student must apply in writing to the Dean (Undergraduate Studies) through the Head of the Department.\n• All medical cases will be put up for consideration to the medical board. Only upon certification by the medical board, the student will be granted full credit.\n• A student will not be allowed to appear in more than 5 (five) subjects in the supplementary examinations and Summer Quarter put together.\n• Intending students must submit their application, countersigned by the teacher(s) of the subject(s) or the Head of the Department concerned, along with the necessary fees to the Academic Section by the date as announced by a notification.\n• The supplementary examinations shall be held on such dates as laid down in the Academic Calendar for the year or as notified separately.\n• The grade in the subject scored by the student appearing in the supplementary examination will be recomputed by substituting the marks of the end-semester in the total marks scored by that scored in the supplementary examination.\n• A student is entitled only to one grade lower than the actual grade thus scored, except that the performance grade ‘P’ remains unaltered.\n• The final grades awarded to the students must be sent to the Academic section on or the date specified in the academic calendar.\n• With effect from the academic year 2016-2017, only the students of the first year and final year will be eligible to appear in the supplementary examination in a subject if he/she actually appeared and obtained Grade ‘F’. However, if a student has been absent in the End Semester Examination Due to medical reason, duly certified by B.C. Roy Technology Hospital or Due to a calamity in the family, he/she will be considered for the supplementary examination with full credit. In such cases, the student must apply in writing with relevant documents to the Dean (Undergraduate Studies) through the Head of the Department before a given deadline.\n• Students intending to appear for the Supplementary Examination must apply online through ERP. The requirement of the concerned teacher/HOD giving approval on ERP or on hard copy is done away with. After the student registers online, academic section/ERP may send a note to the faculty member concerned with a request to set the supplementary examination paper.", "page": "Supplementary Exam"}, {"chunk_id": "f262d9ff", "title": "See Also", "text": "Summer quarter", "page": "Supplementary Exam"}, {"chunk_id": "1b1db602", "title": "References", "text": "UG Regulation Document", "page": "Supplementary Exam"}]