[{"chunk_id": "27faa236", "title": "Swimming Pool", "text": "Technology Swimming Pool or just swimming pool is located in the Gymkhana park near the TSG Lake .\nLoading map...\nIt is most centrally located in beside the Technology Student Gymkhana. The Swimming pools with their placid, clean, transparent and lovely-to-behold water are the star attraction of the technopolis. The open air swimming pool is best place to swim. The Pools, which remain open from morning to late evenings, provide sport, exercise and relaxation par excellence.", "page": "Swimming Pool"}, {"chunk_id": "3aab10dc", "title": "Acquiring Swimming Form", "text": "The Swimming Form can be acquired online through the website of Technology Aquatic Society .", "page": "Swimming Pool"}, {"chunk_id": "108a58c7", "title": "Rules", "text": "• Members shall not be entering the pool except on their schedule date and time. Unauthorized entry to the swimming pool is punishable offence.\n• Non members can swim by availing week end coupon on Saturday and Sunday on payment basis. But they must submit photo ID and undertaking to the TAS office with regard to assigning self responsibility in case of any untoward incident in the pool. In case of any unavoidable situation necessary medical certificate has to be produced (you may contact swimming pool coach / supporting staff).\n• A card holder may avail weekday coupon once in a week (Monday to Friday) on payment basis (please contact swimming pool coach / staff).\n• Under any unavoidable circumstances paid complementary card may be issued with a validity of minimum & maximum period of fifteen days and ninety days respectively. Vice Chairman (TAS) is the only authorize person to approve such card.\n• Six-day card will be issued with prior permission of Vice Chairman on the basis of recommendation of a Medical Practitioner.\n• Please don't ask for form for candidate below four feet height. If found otherwise at any point of time even after submitting duly filled forms along with necessary fees will be summarily cancelled without any refund of the fees deposited.\n• Form is 'Non Transferable'. In this regard if a member is proved to be fraud his/her membership will be immediately cancelled and shall not be allowed to avail any future membership.\n• Only members shall be allowed to enter the changing room during their specific slot. Guardians are not allowed to enter the changing room under any circumstances.\n• Summer session is from March to July of a year. The summer session membership is not strictly renewable.\n• Invalid card shall not be allowed. If found with invalid card shall be punished with a fine of Rs. 1000/-. Membership may be cancelled or both the punishments may be in vogue simultaneously.\n• Regular session is from July of a year to June of the next year. Regular membership is renewable (up to 4 years).\n• Members shall enter the pool only with swimming costume (as shown in the DRESS CODE). Learners should use red cap and swimmers have to use any cap other than red cap.\n• Card has to be produced at the counter and members shall have to put their signature in the register before entering the changing room. (Toiletries like oil, soap, color etc. should never be used before entering the pool).\n• Members are not allowed to enter the pool with any valuables like mobile, ear ring, chain, necklace, ring, etc. Loosing them in the pool may clog the vents & damaged the pool. TAS will not take any responsibility of any valuables.\n• Coach/trainer are only empowered to train/teach swimming in the pool. Nobody should try to teach swimming.\n• After changing the swimming costumes, keep your all things in the changing room and take proper shower before entering the pool. If a member comes in his/her own slot he/she can swim. Swimming pool will not run unless there are at least five members at any given point of time.\n• A boy up to 10 years of age is allowed in the ladies slot. Once a boy member attains 10 years of age should change his slot of swimming (immediate next January). Otherwise, if such as member is identified, shall be punished with a fine of Rs.500/-.\n• Always use ladder at the shallow end. Please abide by the instructions given by the coach/trainer. Otherwise membership may be cancelled.\n• Due to students' activities at times, swimming pool may remain partly / fully closed or T AS may change the time of slot with prior notification.\n• Inter IIT aquatic medal winners will get free card for swimming in the final semester only.\n• If a member loses his / her card, may apply for a duplicate card. The member has to collect a form from the TAS office @ Rs.20/- and submit the duly filled form along with original FIR copy and bank receipt of the fee for duplicate card (Rs. 200/-).\n• For any unnatural situation be it natural calamity or technical reason, the Swimming pool may remain temporarily stopped or the slot(s) may be cancelled for that day.\n• Be careful before depositing any money to the SBI TAS A/c. A/C No. of TAS is 10224333533. Once deposited money will not be refunded or adjusted under any circumstances.\n• For any other information you may please contact with the Manager in the TAS office in TSG building between 6 to 7 pm from Monday to Friday.\n• At the time of form submission you have to provide identity proof for verification of form field Roll No./ EC Code/ Date of birth/ Relationship with member.", "page": "Swimming Pool"}]