[{"chunk_id": "96e97743", "title": "Switch over", "text": "IIT Kharagpur has several opportunities for students to opt for different type of degree than what they are pursuing and higher specialization, as the need might be. For example, third year B.Tech (Hons.) students will have the option to switch over from 4 year B.Tech (Hons.) course to a 5 year Dual Degree course in the same department, including a choice of the specialization. [ 1 ]", "page": "Switch over"}, {"chunk_id": "d4ec9193", "title": "Switch over to Interdisciplinary Dual Degree", "text": "Students admitted to the 4-year B. Tech (Hons.) / 5-year Dual Degree Program through JEE (Advanced) are eligible for switch over to the Dual Degree programs of Engineering Entrepreneurship / Financial Engineering . The constraints for such arrangement is that the interested student must have completed all the prescribed course work for the first two semesters in first attempt with a minimum CGPA of 6.00.\nThe notification is brought during the spring semester of academic year, and accordingly, an eligible student must make his application through i) online application and ii) submission of signed hard copy to academic section by the specified deadline.\nAn important point to that note that application for branch change is also made during the same time, and both of these processes are independent of each other. In case an application is approved for the both, change of branch allotted to a student would prevail over the option of Interdisciplinary Dual Degree Program.", "page": "Switch over"}, {"chunk_id": "911d84a3", "title": "Switch over to Dual Degree", "text": "Third year B.Tech (Hons.) students have an option to switch over to an existing 5-year Dual Degree course ( one-way and not the reverse ) in the same department, including a choice of specialization, offered at 2-year M.Tech. level in the Department maintaining proportionate distribution of seats.\nThe student must have completed all the curricular requirements up to sixth semester and must not have any backlog subjects with a minimum CGPA of 6.00. This notification, too, is brought during the spring semester of academic year, and accordingly, an eligible student must make his application through i) online application and ii) submission of signed hardcopy to academic section by the specified deadline.", "page": "Switch over"}, {"chunk_id": "3f1b6ce2", "title": "References", "text": "↑ \"UG Regulations\" (PDF) . IIT Kharagpur . Retrieved 3 August 2015 .", "page": "Switch over"}]