[{"chunk_id": "info_f860d2", "title": "Technology Adventure Society - Quick Facts", "text": "File:Tadslogo.png\nActivities | cycle trip, Trek, Adventure Weekend, Rappelling, Zipline, E-Sport Tournament, Guest Lecture\nFounded | 2008 ( 2008 )\nFounder(s) | Ankit Joshi\nNumber of members | 42\nWebsite | tadsiitkgp .in", "page": "Technology Adventure Society"}, {"chunk_id": "bda55c73", "title": "Technology Adventure Society", "text": "It is a non-profit organization which comes under the Gymkhana .It's main focus is to maintain the spirit of adventure in each and every student and teachers in Kharagpur. It provides an exposure outside of the campus . They conduct various events throughout the year which help students and teachers to explore and experience the new things within the campus. For this they organize many activities", "page": "Technology Adventure Society"}, {"chunk_id": "373ac6af", "title": "About Us", "text": "Founded in the year 2008, with a vision to promote adventurous sports and activities in the young and enthusiastic minds. We are committed to assisting you in achieving your wildest adventures as you build new friendships, challenge your limits, unwind your spirits, and learn about the natural world around you!\nEveryone has heard of extreme sports like Mountaineering, Rock Climbing, Mountain Biking, Hang Gliding, Bungee jumping, but only few take the leap into the thrilling world of adventure sports.Why regret not having tried it at all? Drop the fear and take the risk. TAdS is here to ensure you take that extra step and never regret it.\nYou do not have to worry about arrangements, technical assistance & equipment; all you need is the strength to face your fears & the will to achieve the aim. For the rest, there is TAdS! Let the adventure begin!!!", "page": "Technology Adventure Society"}, {"chunk_id": "1ffeeace", "title": "Event List", "text": "1.Cycling trip\n2.Rappelling\n3.Zipling\n4.Laser Tag\n5.Human Foosball\n6.Paint-Ball\n7. Zorbing\n8. Archery\n9.Go - Karting\n10.Summer trek\n11.Winter trek", "page": "Technology Adventure Society"}, {"chunk_id": "70d3af74", "title": "Cycling trip", "text": "It's basically consists of 80-90 students and 8 to 10 Associate members of the team, the main motto for this trip is to get students to know about their campus and make them aware about the greenery of the campus.", "page": "Technology Adventure Society"}, {"chunk_id": "1ea8aa66", "title": "Rappelling", "text": "It is done in the building of MMM hall . It is one of most adventurous events .It is basically a wall climbing type of event .", "page": "Technology Adventure Society"}, {"chunk_id": "ef7364ec", "title": "Zipline", "text": "The zipline event occurs over the terrace of the gymkhana, allowing participants to glide down the zipline over the serene gymkhana lake.", "page": "Technology Adventure Society"}, {"chunk_id": "57ace837", "title": "Human foosball", "text": "It is organized near Gymkhana , and in this event there is a group of 10 participants 5 on one side and remaining on other side . They are provided with full proof jackets, masks, hand guns and balls .It is like the counter strike game , where one team has to attack on another team .It's really a very fun event .", "page": "Technology Adventure Society"}, {"chunk_id": "e25244e6", "title": "Zorbing", "text": "In this event , there is group of four participants ,who fight amongst each other . In this sport , participants are put inside an orb, generally made up of transparent plastic and fight together and roll down and collide with each other.", "page": "Technology Adventure Society"}, {"chunk_id": "369704e0", "title": "Go - Karting", "text": "It is organized in the Gymkhana ,and many enthusiastic students who miss driving here or who like racing , participate in this event .In this event , organizers provide cars and tires to set track for safety and many students enjoy a lot in this event .", "page": "Technology Adventure Society"}, {"chunk_id": "d993cad2", "title": "Trekking", "text": "It is a 10-12 days event conducted after end-sem exam , aimed at those group of students who appreciate the beauty of nature . It is organized in both summer and winter and at various places like Kareri lake trip, Dharamshala , Manali ,Dodital lake , Delhi etc.", "page": "Technology Adventure Society"}, {"chunk_id": "82afb510", "title": "Har ki Dun", "text": "The Trek From Taluka To Gangad\nMost trekkers know Har Ki Dun for its culture and history and trek to only Har Ki Dun but end up missing out on the beauty and variety the Ruinsara Tal has to offer. This is one of the most underrated sections of the trek. In less than five minutes of starting your trek, you find yourself on an undulating trail right beside the Thamsa river. You are constantly under a canopy of fresh green. Quaint old wooden bridges across the river appear out of nowhere giving you great picture opportunities. You cover miles on this trail without breaking a sweat. You’ll notice that the coniferous forest gets denser as you go further. The narrow trail snakes through this dense dark forest for a good hour before opening up to the traces of civilization — the ancient village of Gangad. We are not used to such leafy starts on treks. It was almost like a walk in a picture-perfect pine tree park.\nSwargarohini- The Way to HEAVEN\nYou never hear trekkers talk about any campsite on the Har Ki Dun trek. Like everyone else, I assumed Kalkatiyadhar to either be a small settlement or just beside it. Quite contrary to my expectations, Kalkatiyadhar turned out to be a vast green meadow. What blew me away was the expanse of the valley. We were in the middle of multi-level cricket-field-sized meadows, set at a vantage height. To my distant left, the trail climbed towards Swargrohini peaks, which were just peeking on the horizon. To my far right were dense jungles with mountains rising behind them. This was the trail to Ruinsara. To my right across the river was a meadow set amidst a boundary of pine trees. Behind me, I could trace the trail all the way down to Seema and even see the Kedarkantha summit miles away behind Kotgaon.\nThe stories of the ancient villages\nA lot has been said everywhere about the ancient villages of Har Ki Dun. You spot these villages from a distance, spread out on the mountainside, with houses almost hanging in the air. I could not wait to climb up to them and see what the interiors looked like. Spending a night in the village home takes you back hundreds of years. The stories of the village elders and the smiles of the youngsters are something that you want to capture and take back with you. The villages complete the famed Har Ki Dun experience. On our trek, you get to stay in at least two different villages – Gangad and Osla. Flowering bushes border the meadows throughout while tiny colorful flowers grow from the ground almost everywhere in spring.\nHar Ki Dun and Ruinsara Tal valleys\nI loved the expanse of the Har Ki Dun valley. The valley has everything going for it. Big snow-clad mountains towering right in front of you. A big river flowing right in the middle. Lovely green meadows stretching far and wide. I could sit there and just take in this scene the whole day. Ruinsara Tal on the other hand feels like a faraway world. The isolation grips you. It’s just you, the mountains and the lake. Looking at the mountains reflecting in the clear blue lake had a big calming effect on me. Devs Thatch turned out to be the best-kept secret of the entire Har Ki Dun – Ruinsara trail. You hardly see much of this meadow from anywhere else but when inside it. The secret is indeed well wrapped around by pine trees! I loved the meadows because they flow down from top to bottom for 600 meters and stretch for almost 2 km in length.", "page": "Technology Adventure Society"}, {"chunk_id": "f2f10354", "title": "Kedarkantha", "text": "It was on the 2nd of May when the sun at the east was peeping out behind the clouds, and we were waiting for a few to join us. It was 9 a.m. on the fresh summer day. They finally arrived and we departed, in a train which took us to Dehradun. We then took a bus to Sankri. Accompanied by a group of enthusiastic people on the bus, we played Truth or dare, bluff, and Mafia with them. Despite our expectations, we developed a very good bond at the earliest. On the way, in our exciting journey, we were amazed by the scenic beauty of the Yamuna river and the wide-spread Pine forests. Meanwhile, the bus stopped. YES! We reached Sankri. Our joy bound no words. We kept our luggage safe in our base camp and got ready fast to start our first summer trek.With no further delay, we all began. Our minds were all set with the aim of completing the trek within a few hours. Eventually, we felt exhausted during the journey and thought to rest. But then we realized that we had just finished a single kilometer! In Spite of the exhaustion and debilitation, our seniors motivated us to keep our spirits high. A part of our team who were playing songs was suggested to enjoy vocals and visuals, by a senior, instead of using electronics. Meanwhile, one of our friends shared a bagful of gummy bears with us, which really helped us to take easier breaths at higher altitudes. After climbing planes and rocks, we reached a checkpoint-a mesmerizing lake, hidden between the snow-covered majestic mountains, offering scenic Himalayan landscapes - JUDA KA TALAB. Greeneries around were enhancing the grace of Heaven. Nearby the lake, we encountered a hut-like place, where we were served hot Maggie to satiate our hunger. We continued our move. At a point in time, we realized that most of us were suffering mild headaches and the reason wondered us all because we had crossed 9000 ft !!! It was dusk and we decided to camp. The location was a semi-snowy ground with green trees around and we all worked together to make our tents. Yep! Our tents were ready and then it was bonfire time! However, gathering sticks was a hectic task. One of the seniors, who had been to almost 10-12 treks, narrated us horror stories. We were thoroughly enjoying the moment with chit-chat commentaries. We then decided to doze off under the twinkly sky lit up with a million stars, admiring how the Milky Way was spewing its milk across the sky.Our next wonderful day started at 4 a.m.After staying there for a long while, we decided to descend. We decided to enjoy it to the fullest as we were then aware of the path. Few of us slid the snowy steeps. It was undoubtedly fun. It was dusk again and we were again into tenting and chit-chat mode, sharing our memories with each other which multiplied the happiness. Next day of descending started with hesitation at dawn because the water was damn cold that none literally dared to touch it. We continued the descent. We were almost back to the bottom and noticed our tanned skin blaming the hot sun. Eventually, it was dusk again and we made our tents ready. We engaged our chit-chats with interesting games. We played Uno, True or Dare, and a few more. Again our chit-chats continued very long that we legit ended the conversation discussed Egyptian Mythology. OUR JOURNEY CONTINUES...", "page": "Technology Adventure Society"}, {"chunk_id": "889a6358", "title": "HAMPTA PASS : A STAIRCASE TO HEAVEN", "text": "It was on the 2nd of May when the sun at the east was peeping out behind the clouds, and we were waiting for a few to join us. It was 9 a.m. on a fresh summer day. They finally arrived and we departed, in a train which took us to Dehradun. We then took a bus to Sankri. Accompanied by a group of enthusiastic people on the bus, we played Truth or dare, bluff, and Mafia with them. Despite our expectations, we developed a very good bond at the earliest. On the way, in our exciting journey, we were amazed by the scenic beauty of the Yamuna river and the wide-spread Pine forests. Meanwhile, the bus stopped. YES! We reached Sankri. Our joy bound no words. We kept our luggage safe in our base camp and got ready fast to start our first summer trek.With no further delay, we all began. Our minds were all set with the aim of completing the trek within a few hours. Eventually, we felt exhausted during the journey and thought to rest.But then we realized that we had just finished a single kilometer! In Spite of the exhaustion and debilitation, our seniors motivated us to keep our spirits high. A part of our team who were playing songs was suggested to enjoy vocals and visuals, by a senior, instead of using electronics. Meanwhile, one of our friends shared a bagful of gummy bears with us, which really helped us to take easier breaths at higher altitudes. After climbing planes and rocks, we reached a checkpoint-a mesmerizing lake, hidden between the snow-covered majestic mountains, offering scenic Himalayan landscapes - JUDA KA TALAB. Greeneries around were enhancing the grace of Heaven. Nearby the lake, we encountered a hut-like place, where we were served hot Maggie to satiate our hunger.he location was a semi-snowy ground with green trees around and we all worked together to make our tents.Yep! Our tents were ready and then it was bonfire time! However, gathering sticks was a hectic task. One of the seniors, who had been to almost 10-12 treks, narrated us horror stories. We were thoroughly enjoying the moment with chit-chat commentaries. We then decided to doze off under the twinkly sky lit up with a million stars, admiring how the Milky Way was spewing its milk across the sky.Our next wonderful day started at 4 a.m. We all were up in the dawn to catch the glimpse of the serene, spectacular sunrise from an altitude of 12,000 ft. After the long admiration, carrying the peaceful vibes, we continued on our way to the top of the peak. Yeah! We finally did it. We reached a place which is least intervened by humans. Our cheerfulness bound no words. Everything around was eye-catching. We were admiring each and every moment and we clicked lotta pictures there thereby saving those moments. We also found a beautiful Lord Shiva idol which added more bliss to the place. We worshipped with complete serenity. We were still glaring at the vast, widespread mountains. All of us were sunk in the awe of the marvelous scenery. After staying there for a long while, we decided to descend. We decided to enjoy it to the fullest as we were then aware of the path. Few of us slid the snowy steeps. It was undoubtedly fun. It was dusk again and we were again into tenting and chit-chat mode, sharing our memories with each other which multiplied the happiness. Next day of descending started with hesitation at dawn because the water was damn cold that none literally dared to touch it. We continued the descent. We were almost back to the bottom and noticed our tanned skin blaming the hot sun. Eventually, it was dusk again and we made our tents ready. We engaged our chit-chats with interesting games. We played Uno, True or Dare, and a few more. Again our chit-chats continued very long that we legit ended the conversation discussed Egyptian Mythology. Our trip came to an end and it was time to return back. We were cherishing the moments with memories but still were with a heavy heart to leave the magnificent place. Those stilled memories in cameras and phones will stay evident for our entire lifetime. This gist of our Kedar Kantha journey puts us in Nostalgia and YEAH! OUR JOURNEY CONTINUES...", "page": "Technology Adventure Society"}, {"chunk_id": "7c4a37f2", "title": "Founders", "text": "• Mr. Ankit Joshi\n• Mr. Kushal Suhasaria\n• Mr. Shekhar Suman", "page": "Technology Adventure Society"}, {"chunk_id": "e04e4e91", "title": "Governers 2023-2024", "text": "• Mr. Aditya Singh Shekhawat\n• Miss. Archie Avirati\n• Mr. Harsh Khasbage\n• Miss. Ashwini Tayade", "page": "Technology Adventure Society"}, {"chunk_id": "03ad3c0d", "title": "Advisors 2023-2024", "text": "• Mr. Abhinil Kumar\n• Miss. Mainka Raj Todawat\n• Mr. Suraj Gupta\n• Mr. Vansh Agarwal", "page": "Technology Adventure Society"}, {"chunk_id": "f208ab77", "title": "Members 2023-2024", "text": "• Aaditi Ujgare\n• Akash Katravath\n• Ananya A\n• Abhishek Chaudhary\n• Archana S\n• Abhishek Sajwan\n• Bhawani Shankar ola\n• Harsh Raj Gupta\n• Kartikey Verma\n• Mahim Dungarwal\n• M.Kartheek Naik\n• Swara Mohite\n• Nishant Mishra\n• Palak Kothari\n• Parth Prakash Mall\n• Praveen Kumar Yadav\n• Roshmita Rajesh\n• Sandeep Patel\n• Sanjana Haldar\n• Shivam Kumar\n• Shreyans Sharma\n• Shreyansh Mishra\n• Shreyas Bahadure\n• Shrirang Elkunchwar\n• Simran Kumari\n• Sushant Pandey\n• Yashika\n• Dhanavath Pranay Naik\n• Indra Kumar mv\n• Nehal Gangadhar Chaudhari\n• Rahul Verma\n• Shubham Vishwakarma", "page": "Technology Adventure Society"}, {"chunk_id": "9740dabe", "title": "Social Media Links", "text": "Facebook page= https://www.facebook.com/TAdS.IIT\nInstagram page= https://www.instagram.com/tads_iitkgp/", "page": "Technology Adventure Society"}, {"chunk_id": "fd94b3e3", "title": "Contact Us", "text": "Email: [email protected] [ ]", "page": "Technology Adventure Society"}, {"chunk_id": "25ad3d13", "title": "References", "text": "Visit our website : www.tadsiitkgp.in", "page": "Technology Adventure Society"}]