[{"chunk_id": "7e7beb39", "title": "Touch Left and Touch Right", "text": "Touch Left and Touch Right is an online campaign inspired on the format of R U OK? day aimed at increasing interaction and face to face communication among the students in the community. The event urged students to come out and interact with friends in their neighboring rooms. [ 1 ]", "page": "Touch Left and Touch Right"}, {"chunk_id": "1118ad64", "title": "Background", "text": "The event was inspired in wake of a tragic suicide of a fourth year student from Nehru Hall of Residence, [ 2 ] unfortunately the fourth such tragedy of 2017. [ unverified ] Previously, a similar event called Reach Out Week was organized with similar ideas.", "page": "Touch Left and Touch Right"}, {"chunk_id": "a737c460", "title": "Details", "text": "The Facebook event was hosted by the Counselling Center , IIT Kharagpur page and a Facebook event was created from April 23 to April 29. [ 1 ] The post mentions:\nA boarder of the wing has to check his next rooms' boarders in left and right, several times a day regarding 'R U Ok'? Is there life is going alright? Not necessarily things has to be alright but each and everybody should know that there are people to whom they really matters. Mutual exchange of worldly concerns, are what is highly encouraged. You physically go and check, have a soulful chat. Let us know in our survey link here how many times a day you are actually able to dedicate your service to the fellow student. If you find something unusual with you or your next door neighbor, please do not hesitate to call us or email us immediately. Let's make this campaign a great success. With each knock on the next door our IIT KGP will regain it's habitual warmth and Care.\nOn 22nd April, Director sent out an email in the evening to everyone with the following message:\nDear Students, Tragedy has struck us again and we have lost another life in the most unfortunate manner. We are all plunged in sadness. Like in the previous incident, in this case also, we are unable to determine any valid reason for taking such a drastic step. Even close friends, co-worker groups, teachers and thesis supervisor are unable to fathom a cause. Yet it is difficult to imagine one going for such an act unless there is some deep difficulty within. That even closest people here could not gauge this is something about which we are very very concerned. We all need to come together at this time when we are all heartbroken to ensure that we care for each other. There is a need for direct connect and bonding. We need to properly address this crisis while we implement long-term plans. We are in the middle of end-term examinations. I am therefore requesting everyone to take a little bit of your time every day during the next seven days to reach out and meet with your wing mates and friends at some designated hour (say 7 pm for 10 minutes before you go for dinner) to see if everyone is okay. If anyone of you feels uncomfortable, please seek help immediately from faculty, friends, staff or anyone you know. If you feel anyone else needs help, please report the same to someone in the hall, department or administration. The institute administration, wardens, hall / gymkhana office bearers, faculty, staff, counselling centre, hospital, security, are available to help you. Please spread the message that giving and taking help is the best solution to such situations. Many suggestions are being received by us and we are looking at them carefully though we may not be able to reply to each one at this moment. I thank everyone who has come out to assist during this period. Let reaching out and personal (not only digital) bonding be our way of remembrance of the lives lost. Let us resolve to passionately communicate that this is not a way to end any problem we face. Let us work together to help each other to try and ensure that we never face a similar situation again. I seek your kind cooperation. Regards PPC", "page": "Touch Left and Touch Right"}, {"chunk_id": "1f7a6a24", "title": "References", "text": "↑ 1.0 1.1 \"Touch Left Touch Right\" . Counselling Center, IIT Kharagpur. 22 April 2017 . Retrieved 22 April 2017 . ↑ \" \" IIT Kharagpur student found hanging \" \" . The Hindu. 22 April 2017.", "page": "Touch Left and Touch Right"}]