[{"chunk_id": "b47bc28c", "title": "Syllabus", "text": "Course offered by Centre for Theoretical Studies, IIT Kharagpur\nPre-requisites : Linear Algebra, Probability and Statistics\nQuantum Mechanics:\n• The basics of Quantum Mechanics: Bra-Ket Notation, Measurement, Pauli's Spin Matrices, Density Matrices, EPR Paradox, Bell's theorem\n• Quantum Information: Von Neumann Entropy, Maximally Entangled States, Single Valued Decomposition and Schimdt Number, Purification, Partial Trace\nQuantum Computing :\n• Basic ideas of Computing - Turing Model, Circuit Model\n• Quantum Gates\n• Quantum Circuits\n• Quantum Algorithms Deutsch Algorithm Deutsch-Jozsa Algorithm Quantum Fourier Transform Grover's Search Algorithm\n• Quantum Error Correction. Bit flip Error correction Sign Flip Error correction Shor's 9 bit code", "page": "TS70006: Quantum Mechanics and Quantum Computing"}, {"chunk_id": "95fa3b27", "title": "Student Opinion", "text": "As above mentioned the course requires Linear Algebra & Probability & Statistics as Pre-requisites. You need to have taken the 2 courses or convince the Professor that you already know these topics. Quantum Mechanics is a bit hard topic. So in the short time, it might be difficult to grasp the ideas of Quantum Mechanics, if you studying it for the first time in this course. A bit of self-study is needed to understand Quantum Mechanics part of this course, if the pace of the course is fast.\nThe second half of the course Quantum Computing, requires minimum basics discussed in the first half of the course. Linear Algebra basics come into use here. Just following the classes will be helpful to understand the topics.", "page": "TS70006: Quantum Mechanics and Quantum Computing"}, {"chunk_id": "881bea57", "title": "Classroom resources", "text": "Quantum Mechanics:\n• Assignment 1 - 2021\n• Assignment 1 - 2021 Solutions - UNVERIFED\n• Assignment 2 - 2021\n• Quiz 2020\nQuantum Computing:\n• Quantum Computation and Quantum Information by Nielsen and Chuang : First 2 chapters are good enough for the course\n• Quantum Computing for Computer Scientist : Algorithms are well explained in this book\n• Assignment 2021\n• Assignment 2021 Solutions - UNVERIFED\n• Previous Year Assignments 2019\n• Exam with Solutions 2021", "page": "TS70006: Quantum Mechanics and Quantum Computing"}, {"chunk_id": "e19d24bd", "title": "Additional Resources", "text": "• Linear Algebra 3blue1brown Playlist MIT OCW Lectures by Prof. Gilbert Strang\n• Quantum Mechanics Lectures by Professor Susskind - One of the Best introductory Lectures MIT OCW Lectures Quantum Physics I - Prof. Allan Adams and Prof. Barton - If you want to get a deeper understanding of QM and have time\n• Quantum Computing Quantum Computation and Quantum Information by Nielsen and Chuang Quantum Computing for Computer Scientist Qiskit Textbook : A good place to read and implement - both basics and algorithms", "page": "TS70006: Quantum Mechanics and Quantum Computing"}]