[{"chunk_id": "cd1b063c", "title": "TSG", "text": "This article is incomplete . Please help to improve the section, or discuss the issue on the talk page .\nTechnology Students' Gymkhana is the hub of the numerous extra-curricular and co-curricular activities in IIT Kharagpur ranging from sports to socio-cultural. From its inception in 1952, the Gymkhana has played a key role in the everyday lives of Kgpians cultivating and nurturing their extra-curricular talents. The moto of Technology Students' Gymkhana is \"Yogah Karmasu Kausalam\" which in English means \"Perfection in action is Yoga\". The Technology Students' Gymkhana, IIT Kharagpur is managed by the students, for the students, under the guidance and active participation of the faculty and staff members.", "page": "TSG"}, {"chunk_id": "2b3d5110", "title": "Awards", "text": "The Gymkhana shall make the following Individual awards annually and present it to the deserving students at the annual Gymkhana farewell function.", "page": "TSG"}, {"chunk_id": "496b7029", "title": "Sports and Games", "text": "(For graduating students)\n• Bhandarkar Cup - It was donated in 1952 by Sri R. S. Bhandarkar who was associated with the Institute in its early years in his capacity as the Assistant Educational Advisor, Govt. Of India, Eastern Region. The Cup is a rolling trophy awarded annually to the Best Outgoing Allrounder who has performed with distinction, particularly in sports.\n• Institute Blue - It is conferred to the outgoing students who have significantly contributed to the Sports & Games at IIT Kharagpur and have brought laurels to the institute in different competitions including InterIIT Sports Meet.\n• Honorable mention - This award is to reduce the number of Institute Blue awardees.\n• Special Mention - For all students.\n• Alumni Cup - It is a rolling trophy awarded annually to a non-graduating student who has performed with distinction in Sports & Games and Social throughout the year.", "page": "TSG"}, {"chunk_id": "6e4c567f", "title": "Social and Cultural", "text": "(For graduating students)\n• Srimati Chandramani Cup – It was donated in 1971 by Prof. K.G.Chandramani of the Mechanical Engineering Department in memory of his mother Smt. Cheti Chandramani. It is a rolling trophy awarded annually to the Best Outgoing All rounder who has performed with distinction, particularly in social and cultural activities.\n• Institute order of merit\n• Honorable mention\n• Special Mention (for all students)\n• Alumni Cup", "page": "TSG"}, {"chunk_id": "9a111c28", "title": "Technology", "text": "(For graduating students)\n• Prof. G. S. Sanyal Cup – was donated in 1971 by Prof. G. S. Sanyal who has been associated with the Institute since 1954. It is a rolling trophy awarded annually to the Best Outgoing All-rounder who has performed with distinction particularly in technology activities.\n• Institute Order of Merit\n• Honorable Mention\n• Special Mention", "page": "TSG"}, {"chunk_id": "3d1e0e66", "title": "Ashoke Mukherjee Cup", "text": "It is a rolling trophy awarded annually to an outgoing student who has made an outstanding voluntary contribution to the Gymkhana.", "page": "TSG"}, {"chunk_id": "40fabce3", "title": "Societies", "text": "Along with the activities of the general championships, there are many student run groups that tap the talent of the creative pool of people that we have. These societies cover a wide area of human interest ranging from robotix, dramatics, arts, innovation and finance. These group of people with similar interests work together for the team and also represent IIT Kharagpur at various national and international events.", "page": "TSG"}, {"chunk_id": "c794f81a", "title": "Kharagpur Data Analytics Group", "text": "Kharagpur Data Analytics Group, or KDAG is aimed at bringing Data Analytics and Machine Learning enthusiasts together under the umbrella of a single society, and provide ample opportunities & resources that are required to build a successful career in this emerging domain.\"", "page": "TSG"}, {"chunk_id": "660cd1a4", "title": "Business Club", "text": "B-Club , or Business Club , serves as a platform for the students of IIT Kharagpur to brainstorm on the business frontiers of Consulting, Finance and Analytics. While for its own members, B-Club does this by conducting several intra-club knowledge meetings all year long, the non-club members get a chance to participate in discussions, seminars and workshops through the multiple Open House Sessions conducted regularly throughout the semester, where imminent speakers from the club or from the industry are invited to interact with the audience of IIT Kharagpur interested in the myriad facets of business.\nThe members of B-Club have represented IIT Kharagpur in various national and international level competitions and conferences and have brought laurels to the institute. Its interaction with the national audience is further bolstered by its flagship event – The Indian Case Challenge, a battle of wits, where students from top business schools and undergraduate colleges meet over a 2 day event, held in IIT Kharagpur, to trump the cards in their favour, in what is touted to be India’s largest business case study competition.", "page": "TSG"}, {"chunk_id": "8b5ca2e0", "title": "Communiqué", "text": "Communiqué is the official soft skills and personality development society of Indian Institute of Technology, Kharagpur. It is a student body working towards developing strong communication skills in the students of IIT-Kharagpur by conducting workshops and guest lectures by stalwarts in this field. Mock group discussions/personal interviews, workshops on business communication and email-etiquettes are some of the major events. In order to improvise oratory skills, eloquence, spontaneity and confidence, glossophobia treatment sessions are conducted on a regular basis.", "page": "TSG"}, {"chunk_id": "4fd3e64e", "title": "Debating Society", "text": "Debating Society is indisputably the best stand for argument devotees to endow their dexterity, consistent involvement at national level debates gives it peak of the utmost active society.", "page": "TSG"}, {"chunk_id": "a1cb8c0a", "title": "Eastern Technology Music Society", "text": "ETMS is one of the most popular student societies of IIT Kharagpur. Comprising of 15-25 talented musicians, the society presents a scintillating Performance Day in the Autumn Semester and on the Spring Fest Opening Day Ceremony in the Spring Semester. Apart from reproducing popular Hindi numbers to the finest detail, ETMS is also well known for popularizing not-so-well-known bands and musicians through its productions.", "page": "TSG"}, {"chunk_id": "27ee898e", "title": "Quiz Club", "text": "The IIT Kharagpur Quiz Club is an active interest group which aims to promote the culture of quizzing on the campus and provides a platform to bring all the quizzers together. The group has conferred upon itself a number of honors in a very short span of time. Last year, members of the Quiz Club won laurels for the Institute in many different Inter-College events at IIT Bombay, MNIT Allahabad, NIT Durgapur, ISI Kolkata etc. They also won Open Quizzes at Bhubaneshwar and the regional level Tata Crucibles, often beating corporate teams along the way.", "page": "TSG"}, {"chunk_id": "f0f2ceb7", "title": "Spectra", "text": "The Design and Art Society of IIT Kharagpur – Spectra is a student initiative that aims to strengthen and promote the roots of fine arts among the students of IIT Kharagpur .With many talented artists and exhibitionists as its members the society promises to be a valued treasure for the connoisseurs of fine arts.", "page": "TSG"}, {"chunk_id": "d4116a70", "title": "TLS", "text": "Technology Literary Society or TLS is a group of creative writers and designers who are involved in various literary events and publications around the campus.", "page": "TSG"}, {"chunk_id": "8da235dc", "title": "Technology Adventure Society", "text": "Technology Adventure Society is an initiative by TSG IIT Kharagpur to provide a platform for students and faculty of the institute to explore and experience outdoor beyond the campus. It will be organizing expeditions covering a host of activities such as trekking, rock climbing, mountaineering, cycling and a plethora of similar activities all throughout the year in different areas of the country. So “pack your rucksacks and be ready to plunge in the arena of Adventure which will rush every single drop of adrenaline in your body!!", "page": "TSG"}, {"chunk_id": "c95af33b", "title": "Technology Dance Society", "text": "Technology Dance Society , a group of Dance fanatics, is IIT Kharagpur’s largest society [ when? ] .", "page": "TSG"}, {"chunk_id": "6b95c90b", "title": "Technology Robotix Society", "text": "Technology Robotix Society , is a focal point for activities and projects related to robotics in the campus. With its reach expanding steadily each year, it has also cemented its position as one of the nerve centres of amateur robotics in India. It conducts many events throughout the year, specifically aimed at undergraduate students, with a general aim of spreading robotics culture in the campus and around.", "page": "TSG"}, {"chunk_id": "42a3c413", "title": "Technology Filmmaking and Photography Society", "text": "Technology Filmmaking and Photography Society is the official club of IIT Kharagpur for students interested in filmmaking, photography and film-appreciation.\nFounded in 2010 by a few film enthusiasts, TFPS has come a long way in promoting filmmaking and film appreciation among the campus fraternity as well as outside. It has also been a launchpad for students interested in pursuing careers in the Entertainment Industry.", "page": "TSG"}]