[{"chunk_id": "48d54677", "title": "UARE", "text": "The University of Alberta Research Experience (UARE) is a research internship program allowing top senior undergraduate students from key partner universities to conduct research at UAlberta under the supervision of faculty members who are experts in their field. UARE placements are available during winter (January to mid-March) and summer (May to August) for a period of 10-12 weeks.\nUniversity of Alberta International provides full support for participants before, during and after their placement. A formal orientation, professional development seminars, academic networking opportunities, and a poster symposium are all offered to program participants.", "page": "UARE"}, {"chunk_id": "67c7a12d", "title": "Eligibility", "text": "• Senior undergraduate students (3rd or 4th year)\n• Enrolled in an undergraduate degree program at a designated partner institution (Partner Institutions in India: IIT Bombay, IIT Kharagpur)\n• Have a minimum Grade Point Average of 3.0 or B on a 4-point scale (or equivalent etc).\n• Past UARE participants are ineligible\nThere are many projects in a number of disciplines like Computer Science, Mechanical Engineering, Civil Engineering, Aeronautical Engineering, Chemical Engineering, Biotechnology, Environmental Engineering etc.", "page": "UARE"}, {"chunk_id": "d5c9adf5", "title": "Application Procedure", "text": "The projects for summer are typically posted on their website by mid-September. The deadline to apply for UARE Summer 2016 was October 31, 2015.\nYou must upload the following documents with your online application:\n• Letter of intent\n• Scanned Official Transcript\n• Resume/CV\n• Two academic references, submitted directly from the referee via the system", "page": "UARE"}, {"chunk_id": "2585dad7", "title": "Acceptance Notification", "text": "The notification of acceptance generally comes as an email between mid December and February. The official offer letter, along with the immigration package is emailed to the students by mid march.", "page": "UARE"}, {"chunk_id": "9fd819a0", "title": "Stipend", "text": "Currently the scholars receive a total amount of CAD 5,000 (CAD 2,000 commitment from the UAlberta faculty member or department; CAD 3,000 is funded centrally). A lump sum of CAD 3,000 is given to the students immediately upon arrival. The rest of the stipend, CAD 2,000 is dispatched late June, after the students are granted tax exemption. All the expenses including air tickets, housing and food for the 8 weeks stay in the US are to be borne by scholars from the above mentioned amount.", "page": "UARE"}, {"chunk_id": "26964661", "title": "Location", "text": "University of Alberta is located in Edmonton, capital of Alberta, Canada. UAlberta's main campus is located in the centre of Edmonton, just minutes from downtown and surrounded by the beautiful river valley. With a major transit station on campus, there is easy access to the city’s many attractions. During the internship, opportunities to participate in cultural and social events such as city festivals or day trips to nearby attractions are offered on a weekly basis. A trip to the Rocky Mountains is made available to every intern.", "page": "UARE"}, {"chunk_id": "049a177a", "title": "Housing", "text": "Interns are responsible for their own housing. A few students stay in the Lister Centre, but most interns stay in subleased apartments, which are cheaper and available on campus or right outside campus. Since housing is cheaper outside campus, a number of students opt to stay far from the campus and take a convenient 10-15 minute ride to the campus in the LRT. Subleases can be easily found by visiting facebook pages listing sublease ads. Facebook groups formed by the scholars also turn out to be extremely useful sources of information.", "page": "UARE"}, {"chunk_id": "8cd8c682", "title": "Visa", "text": "The application process for Canadian work permit visa is smooth. The application process is clearly listed on the Canadian immigration and travel website. Ideally, the VISA is delivered to you within 2 weeks of applying. However, the processing time of a work permit visa is known to vary between 20 days and 2 months. Hence, it is in your best interest to apply as soon as you receive the award letter and all the supporting documents.", "page": "UARE"}, {"chunk_id": "5cdbca76", "title": "See also", "text": "• List of internship programs\n• How to get a visa to Canada", "page": "UARE"}]