[{"chunk_id": "7fdf0fdc", "title": "VGSoM", "text": "File:VGSoM.jpg School of Management\nVinod Gupta School of Management (VGSoM) was set up as the first school of management within the IIT system in 1993, with the help of a distinguished alumnus & a life time Fellow of the Institute, Mr. Vinod Gupta (B. Tech. 1967), the former CEO and Chairman of InfoGROUP (previously known as InfoUSA) whose generous endowment of 2 Million US Dollars was matched by liberal support from the Government of India. The mission of the school is to develop outstanding management professionals capable of playing leadership roles in their chosen careers in organisations in different sectors of the economy, especially in technology-driven and knowledge based industries that are characterized by high degrees of globalisation, dynamism, complexity and innovativeness. The school offers a Doctoral programme in management (PhD) and an MBA programme for working executives over weekends in Kolkata and Bhubaneswar. The school also regularly organizes guest lectures, Mangement Development Programmes (MDPs) and training programs for educators in India and abroad. The school also offers a unique need-based scholarship to its students with the sole aim to ensure access of deserving students to world class management training. Highly qualified faculty with outstanding academic credentials and diverse industrial/consultancy experience associate with colleagues in India and abroad to provide the best possible learning environment to our students. Faculty also contribute to the knowledge base through their research and consultancy projects with their partners in the industry and academics. Now, more than two decades after its inception, the school has grown holistically, winning several accolades and setting up new benchmarks for excellence. As a part of the world renowned IIT Kharagpur system, the school enjoys access to state of the art infrastructure, one of the most well equipped libraries in the country, and a very large, well established network of alumni. Please visit our beautiful campus and meet us to know more. The school can also be contacted at +91.3222.282297 . [ 1 ] . More information can be found on their website\nProf. Prabina Rajib is the current Head of the School.", "page": "VGSoM"}, {"chunk_id": "e776dd54", "title": "Research Areas", "text": "• Asset Pricing\n• Behavioral Finance\n• Behavioural issues in Microfinance\n• Business Valuation\n• Cognitive Studies, Organizational Behavior\n• Consumer Behavior\n• Corporate Finance\n• Customer Relationship Management\n• Cyber ethics : security and privacy\n• Earnings Management\n• E-commerce Technology and Applications\n• Ethics\n• Financial Economics and related Studies\n• Financial Management\n• Financial Markets and Risk Management\n• Financial Reporting and Analysis\n• Healthcare and Higher Education\n• Human Resource Management\n• Information Security\n• Information security risk management\n• Leadership\n• Management Information Systems\n• Marketing managment\n• Marketing to the Bottom of the Pyramid\n• Mergers and Acquisitions\n• Organizational Behavior\n• People Analytics\n• Quality Management\n• Services Marketing\n• Social Media Marketing [eWOM]\n• Spirituality and work\n• Statistical Decision Modeling", "page": "VGSoM"}, {"chunk_id": "c9c1efe0", "title": "References", "text": "Vinod Gupta School of Management\n↑ http://www.iitkgp.ac.in/department/BM", "page": "VGSoM"}]