[{"chunk_id": "162f308d", "title": "Viterbi-India Program", "text": "This article does not cite any references or sources . Please help improve this article by adding citations to reliable sources . Unsourced material may be challenged and removed .\nThe Viterbi-India Program is a fully funded program which provides opportunities to undertake a research internship at the University of Southern California for a period of 8 weeks in the summer. The Viterbi-India Program is a result of the partnership between the Indo-US Science and Technology Forum and the Viterbi School of Engineering, University of Southern California. Every year around 20 students are selected from colleges and institutions all over India. The selections are made based on the applicant's profile and attitude towards research which include CGPA, research interests, previous research experience and technical skills, and additionally, expectations from research.", "page": "Viterbi-India Program"}, {"chunk_id": "db238902", "title": "Eligibility", "text": "The program is only open for Indian students pursuing a Bachelors or a Masters degree in Electrical Engineering, Computer Sciences or Computational Sciences, at any recognized institution of higher education in India.", "page": "Viterbi-India Program"}, {"chunk_id": "a396eb82", "title": "Application Procedure", "text": "The application process generally starts from August ever year. A notification is put on IUSSTFs website and colleges are notified. Often posters are put up in the respective departments. The application procedure involves filling a digital form, acquiring Letters of Recommendation and emailing the completed form to the mentioned address.\nFilling up the application form involves writing page long essays about one's research interests, technical skills, previous research experience, purpose of the internship and what one would gain from the research. The application also asks for the names in order of preference of at most three USC professors, whom the applicant would be interested in working with.", "page": "Viterbi-India Program"}, {"chunk_id": "bcc32aad", "title": "Acceptance Notification", "text": "The notification of acceptance generally comes as an email between late January and February. The final list is published only after the selected candidates have accepted the internship. The official offer letter is mailed by mid March.", "page": "Viterbi-India Program"}, {"chunk_id": "521ddc3e", "title": "Stipend", "text": "Currently the scholars receive a lump sum of $2630 in cash and traveler's cheques before leaving for the US. The remaining $370 out of the total $3000 as mentioned in IUSSTFs website, is utilized for health insurance at USC. Return air tickets are arranged by the IUSSTF and the cost is borne by them.\nAll the expenses including housing and food for the 8 weeks stay in the US are to be borne by scholars from the above mentioned amount, which could be managed provided the scholars spend responsibly.", "page": "Viterbi-India Program"}, {"chunk_id": "a106c199", "title": "Location", "text": "USC is located in Los Angeles (LA), one of the most of popular cities of the USA, also famous for hollywood. Los Angeles has excellent public transport, making is easy and convenient to move within the city. Though the USC campus and its neighboring areas are patrolled by security personnel, crime rates are on the higher side in the USC and LA neighborhood, and one must be careful while staying out at night.", "page": "Viterbi-India Program"}, {"chunk_id": "04157be9", "title": "Housing", "text": "Scholars are responsible for finding their own housing. Most interns stay in subleased apartments. Subleases can be easily found by visiting facebook pages listing sublease ads. Facebook groups formed by the scholars also turn out to be extremely useful sources of information.", "page": "Viterbi-India Program"}, {"chunk_id": "72429121", "title": "Visa", "text": "Of late, owing to the repurcussions of the pandemic, the application process for the US visa is very cumbersome. It is extremely difficult to get appointment slots at the Consulates for weeks together, and the awardees are advised to be on their toes in ensuring that they get through the visa process. The application process is clearly listed on the US immigration and travel (ustraveldocs) website.", "page": "Viterbi-India Program"}, {"chunk_id": "acaac307", "title": "See also", "text": "• How to get a visa to USA\n• List of internship programs", "page": "Viterbi-India Program"}]