[{"chunk_id": "info_bc08b5", "title": "WM60011: Sectoral Water Demand And Distribution - Quick Facts", "text": "WM60011\nCourse name | SECTORAL WATER DEMAND AND DISTRIBUTION\nOffered by | School of Water Resources\nCredits | 4\nL-T-P | 4-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester | {{{semester}}}", "page": "WM60011: Sectoral Water Demand And Distribution"}, {"chunk_id": "6dc9732b", "title": "Syllabus mentioned in ERP", "text": "Introduction to water distribution system to different sectors: Domestic, Industrial, Agricultural. Present status of water distribution system in India and Abroad. Types of distribution system: Pipe network, canal network system, lift irrigation. Sources of water distribution system: surface storage reservoirs and run-of-the-river (weirs/ barrages) diversion schemes, surface ponds, open wells, dug wells, tube wells, infiltration galleries, collector wells. Flow mass curve analysis for design of reservoir capacity.Water demandsupply analysis through population forecasting. Drinking and irrigation water quality standards. Assessment of drinking and irrigation water demands.Components of domestic water supply system; Hydraulics of domestic pipe network design: Single network, looped network. Minimization of losses in domestic water supply system.Pumping systems and storage structures. Design of pressurized distribution system with associated controls and storage structures for drinking and irrigation water supplies; Introduction to pipe network design software EPANET.Automation techniques for drinking water distribution systems using SCADA.Principles of Canal system design. Overview of major and minor conveyance and distribution systems for irrigation water (canals, control structures, cross drainage works, distributaries, water courses and field channel for gravity irrigation) including the design of these systems; lift irrigation system. Canal hydraulics (computer simulation) models, canal scheduling (Warabandi, Shejpali, rotational), Computer models of canal operation.Design of pressurized irrigation system (Drip and Sprinkler system).", "page": "WM60011: Sectoral Water Demand And Distribution"}, {"chunk_id": "c8840296", "title": "Time Table", "text": "Day | 8:00-8:55 am | 9:00-9:55 am | 10:00-10:55 am | 11:00-11:55 am | 12:00-12:55 pm | 2:00-2:55 pm | 3:00-3:55 pm | 4:00-4:55 pm | 5:00-5:55 pm\nMonday | NC444\nTuesday\nWednesday | NC444 | NC444\nThursday | NC444\nFriday", "page": "WM60011: Sectoral Water Demand And Distribution"}]