[{"chunk_id": "0dc00853", "title": "Yahoo! HackU", "text": "Yahoo! HackU was a weekend hackathon event conducted annually by Yahoo in various universities across the World. HackU was a popular event among students due to its prizes and good food. The event was last organized in KGP during 28th Feburary to 3rd March 2013. [ 1 ]\nThe event was discontinued probably due to reduction in India wide operations by Yahoo and its eventual shutdown. [ 2 ]", "page": "Yahoo! HackU"}, {"chunk_id": "61e63d82", "title": "2013", "text": "The winners were: [ 3 ]\nWinne r: Vipul Jain, Nadeem Anjum, Saurabh Agrawal, Devender Bindal for WikiGist\nRunner Up : Rajanya Dhar, Sonam Kumari, Sunandita Patra, Anusha Suresh for Follower Circles\nSecond Runner Up : Shrey Sharma, Vikas Sahu, Aayush Goel, Vinodh Kumar Sunkara for Story Line\nHackers Choice award : Siddharth Rakesh, Arpit Kumar, Sachin Kumar, Yash Bajaj for Train QueRies . This was based on popular voting.", "page": "Yahoo! HackU"}, {"chunk_id": "4d769774", "title": "2012", "text": "The winners were: [ 4 ]\n• Kaushik, Anjani, Saurabh and Sumit for a YouTube playlist recommender\n• Rahul, Subhro, Sanket and Amit for RailConnect an app to find train connectivity between any two different train stations on the basis of parameters like maximum buffer time.\n• Vishwas, Tabassum, Debajit and Amit for QuickTweet-n-Mail a browser extension which lets you quickly tweet and email an interesting picture.\n• Mogili, Mahesh, Maila and Bipin for HackingFood an app which can find you food recipes on the given the ingredients you have.", "page": "Yahoo! HackU"}, {"chunk_id": "3c5e0143", "title": "2011", "text": "The winners were: [ 5 ]\n• Shubham Agrawal, Rishav Agarwal, Ashish K Yadav and Naveen K Sharma for RailMapia which provides an easy to use interface to see different trains between two stations.\n• Arpit Agarwal, Vikash Agarwal, Aditya Mangal and Rajanya Dhar for StockNetwork a tool for buying and selling using social dynamics.\n• Aditya Barelia, Anshul Singhle, Umesh Kumar Sharma and Rohit Kumar for ssh-SMS a tool for controlling your computer through SMS", "page": "Yahoo! HackU"}, {"chunk_id": "195fe8c1", "title": "References", "text": "↑ \"Yahoo HackU Schedule\" . Retrieved 15 September 2015 . ↑ \"Yahoo starts fresh layoffs; India operations will be reduced to support functions\" . Economic Times. 8 October 2014 . Retrieved 15 September 2015 . ↑ \"YDN Blog\" . Retrieved 16 September 2015 . ↑ \"HackU 2012 Blog\" . Retrieved 15 September 2015 . ↑ \"YDN Blog: Holi(y) HackU – A recap from IIT Kharagpur\" . Retrieved 16 September 2015 .", "page": "Yahoo! HackU"}]