[{"chunk_id": "info_dd3758", "title": "180 Degrees Consulting - IIT Kharagpur (180DC) - Quick Facts", "text": "Activities | Consultancy\nFounded | 2020 ( 2020 )\nWebsite | www .180dciitkgp .in\nUnder TSG | Yes", "page": "180 Degrees Consulting - IIT Kharagpur (180DC)"}, {"chunk_id": "5b5896bd", "title": "Introduction", "text": "180 Degrees Consulting is the world’s largest organisation for non-profits and social enterprises with operations in more than 35 countries. The IIT Kharagpur branch of 180 Degrees Consulting (abbreviated as 180DC) was founded in April 2020 by Amritash Bharadwaj, Nikita Kishore, Adarsh Gupta, Aniket Shah and Keshav Godala with an aim to provide quality consultancy services to socially conscious corporations and NGOs to help them achieve the impact they seek to create.\nBeing students of the oldest, largest and most versatile of IITs, the team consists of driven and capable people with diverse skill sets across various fields. It is a platform where students can gain leadership skills, consulting experience and professional etiquette with a chance to derive value through the quality of their collaborative work.", "page": "180 Degrees Consulting - IIT Kharagpur (180DC)"}, {"chunk_id": "c091ea7d", "title": "Selections", "text": "Selection procedures for 180DC are held at the start of the autumn semester. New recruits are taken in from the first year only. The selection procedure consists of multiple rounds of interviews and discussions wherein prospective members aren’t judged on their knowledge of consultancy frameworks, but rather their problem-solving approach and whether they are able to present their thoughts in a structured manner.\nThe selection procedure evaluates the candidates on Structured Thinking, Problem Solving, Work Ethic, Time Management, Speaking, Writing and Design skills . Good knowledge of business and finance is appreciated but is not the main factor of evaluation. We expect an optimal amount of time and dedication.", "page": "180 Degrees Consulting - IIT Kharagpur (180DC)"}, {"chunk_id": "ce99a4d3", "title": "Training Sessions", "text": "The main opportunity to learn in 180 Degrees Consulting is via training sessions. Seniors organise these sessions to polish the skills of new recruits and also teach them various consulting techniques and frameworks. These knowledge meetings also involve case study competitions/workshops.", "page": "180 Degrees Consulting - IIT Kharagpur (180DC)"}, {"chunk_id": "7969be76", "title": "Organisational Structure", "text": "• Advisors consist of fourth and fifth-year members and are the senior-most members whose experience helps in guiding the overall direction of the organisation.\n• Directors are members who are in their third year of study. They are responsible for heading various different portfolios and projects within the organisation.\n• Executive Heads are the members who are in their second year of study. They are responsible for executing the portfolio and project work assigned by the Directors.\n• Consultants comprises the students who are in the first year. They take care of executing various plans and projects of 180DC", "page": "180 Degrees Consulting - IIT Kharagpur (180DC)"}, {"chunk_id": "6a0cab30", "title": "Advisors (2024-2025)", "text": "• Aditya Dubey\n• Roshni Biswas\n• Sourashis Chattopadhyay\n• Samyak Jain\n• Sushant Jha\n• Sagar Kumar\n• Rishabh Mishra\n• Jagori Bandyopadhyay\n• Veeransh Mehta\n• Sudeep Bhurat", "page": "180 Degrees Consulting - IIT Kharagpur (180DC)"}, {"chunk_id": "44819cfb", "title": "Directors (2024-2025)", "text": "• Shristi Singh\n• Parag Agarwal\n• Gaurav Jindal\n• Ataullah Baig\n• Abhishek Das\n• Vihar Davuluri\n• Sreelekshmi Kishore", "page": "180 Degrees Consulting - IIT Kharagpur (180DC)"}, {"chunk_id": "a058806c", "title": "Advisors (2025-2026)", "text": "• Sushant Jha\n• Sagar Kumar\n• Rishabh Mishra\n• Jagori Bandyopadhyay\n• Sudeep Bhurat\n• Shristi Singh\n• Parag Agarwal\n• Gaurav Jindal\n• Ataullah Baig\n• Abhishek Das\n• Vihar Davuluri\n• Sreelekshmi Kishore", "page": "180 Degrees Consulting - IIT Kharagpur (180DC)"}, {"chunk_id": "e3171d47", "title": "Executive Directors (2025-2026)", "text": "• Akshat Mittal\n• Moulik Mishra\n• Videh Jha\n• Anushka Mukherjee\n• Gargi Bhagwat\n• Arghyadip Pal", "page": "180 Degrees Consulting - IIT Kharagpur (180DC)"}, {"chunk_id": "c8f391bb", "title": "Projects", "text": "The organisation’s work includes client negotiation, acquisition, onboarding and providing consultancy services to clients. The services include (but are not limited to) evaluating project feasibility, providing financial and CSR strategies, doing market research & data analysis etc. The deliverables provided have helped several NGOs and organisations in many ways like helping them getting more funds, solving infrastructural/systemic problems, acquiring more volunteers etc.\n180DC has collaborated with various renowned organisations, some of them are listed below:", "page": "180 Degrees Consulting - IIT Kharagpur (180DC)"}, {"chunk_id": "da47c638", "title": "1) Government of MP", "text": "Client Feedback: “180 Degrees Consulting IIT Kharagpur was of immense help in making policies to recover revenue loss faced by the Madhya Pradesh Government due to COVID-19 pandemic. Their way of working is very organised and innovative. All the consultants we’d interacted with were very hardworking, inquisitive and enthusiastic. They found to be quick to grasp the requirements and work accordingly. We appreciate their efforts and applaud their dedication, they have made a huge difference.”", "page": "180 Degrees Consulting - IIT Kharagpur (180DC)"}, {"chunk_id": "81d3c4cc", "title": "2) World Vision India", "text": "Client Feedback: “The performance and practical insights provided by the team of 180DC IIT Kharagpur in the unemployment report was of immense help while planning programs in rural and urban areas of various cities. Consultants were equipped with knowledge of ML and Data analytics and handled large youth databases of 2000+ youth with utmost professionalism to provide us with data-backed insights. We hope to collaborate with 180DC for future projects.", "page": "180 Degrees Consulting - IIT Kharagpur (180DC)"}, {"chunk_id": "1de480c7", "title": "3) Robin Hood Army", "text": "Client Feedback: “We found 180 Degrees Consulting, IIT Kharagpur works to be very impressive and phenomenal. We definitely appreciate the kind of work they have done and how well they analysed the ethos of Robin Hood Army”.", "page": "180 Degrees Consulting - IIT Kharagpur (180DC)"}, {"chunk_id": "1be0834c", "title": "PM School 2024 - Product Management Workshop", "text": "This was one of the major initiatives taken by 180DC, IIT Kharagpur in 2024.\nPM school is an organisation that provides programmes for aspiring project managers which include live classes and case studies. 180 Degrees Consulting with the help of PM school had organised a workshop which involved giving tips and suggestions on how to crack project management interviews and also described the work of a project manager in a corporate company. Along with this 180DC also organised a product-case competition, in which a total of 200+ students took part.", "page": "180 Degrees Consulting - IIT Kharagpur (180DC)"}]