[{"chunk_id": "4b7581c0", "title": "Introduction", "text": "Awaaz, as said ‘The Voice of KGP’ is the main media body of IIT Kharagpur, actively reaching to the entire KGP campus, students, faculties and to the alumni network. As an independent student organization, Awaaz brings out the latest happenings, intricate campus news, the debate on the issues of general interest, make a bridge between students, faculties and college administration. Mainly, it was founded to make people aware of the latest campus happenings but with time, its realm extended and now it has become a reliable source of news. Started with a monthly newsletter, Awaaz has spread roots to social media to interact better. Awaaz has always taken the initiative to present the scenario in a better way. It tries to make students relate themselves by panji dude, cartoon corner, Bhaat along with the columns like Know Your Entrepreneur, Surveys, poll of the week, Know Your professor, Jewels of Kgp, Human Rights. Awaaz gives all information about General Championship and elections. Awaaz keeps an eye on each and every important happenings of IIT Kharagpur.", "page": "Awaaz"}, {"chunk_id": "6e397dad", "title": "Mission", "text": "To report and present different views about events which affect the campus community and to give voice to the matters regarding students welfare. We bring out the monthly campus newsletter of IIT Kharagpur published in Hindi. Awaaz, as the name suggests, aims to provide a voice to the student community in front of the administration. Awaaz presents and reports the various issues in the campus to the entire student fraternity and the administration and bring out collaborative solutions to make things better in the institute. Awaaz has always been committed to bring change in the campus and promotes unbiased journalism.", "page": "Awaaz"}, {"chunk_id": "7eed454a", "title": "Structure", "text": "The team of Awaaz, IIT Kharagpur consists of the following hierarchy of journalists:\n• Chief Editors (Fifth Years)\n• Editors (Fourth Years)\n• Sub-editors (Third Years)\n• Senior Reporters (Second Years)\n• Junior Reporters (First Years)\nEach level of journalists consists of a miscellany of students engaged in various domains. While some captivate the readers by their marvellous literary skills, some are crackerjack cartoonists and designers. Everyone comes from different cultures, backgrounds and opinions and blend together to bring unbiased journalism into action.", "page": "Awaaz"}, {"chunk_id": "66139513", "title": "Mediums of Journalism", "text": "1. Monthly Newsletter\nAwaaz publishes a monthly Hindi newsletter that comes with various articles and news based upon the interests of the readers. The newsletter covers a variety of sections that can intrigue the readers.\n2. Facebook Page\nThe Facebook page of Awaaz is a platform which aims to provide the readers a quick and reliable way to be cognizant about all the recent happenings in the campus.\n3. Website\nAwaaz has a website that contains a record of the entire content that is published. Details about the website has been described in the sections below.\n4. Mobile Application\nThe mobile application of Awaaz aims to maintain an easy to access portal to get in touch with the campus news. The application also provides live notifications for various activities that happen in the campus.\n5. Youtube Channel\nThe youtube channel provides the audience a common platform to view all the videos published by Awaaz, which premierly include election SOPs, interviews, event videos etc.", "page": "Awaaz"}, {"chunk_id": "29dbaae5", "title": "Newsletter", "text": "The newsletter published by Awaaz, IIT Kharagpur is a six-page compilation of exciting articles and cartoons. The first two pages of the newsletter focus on highlighting various issues faced by the students in the campus or discussing some new initiatives by the institute. The third page is the ‘Bhaat’ section and includes humorous articles that don’t fail to tickle the funny bone of the readers. The fourth page is the editorial section, describing some topic of national importance. The fifth page of the newsletter, ‘Tarang’, brings to the readers various articles in the series of KYE, KYP, Jewels of KGP, Humans of KGP etc. The last page, ‘Khabrein’, consists of various news related to IITs in the recent past. Also, the newsletter includes two cartoons: the Panji Dude and the Cartoon Kona, wonderfully depicting the happenings in the campus. It also features \"'Panji Dude\"' which is a cartoon character depicting a student of KGP whose CG is always 6 but has the ability to cope up with the problems in a very creative way. And newsletter also has a Cartoon Corner which depicts any of the latest important happenings via cartoon characters.\nPanji Dude\nPanji dude is a fictional character featured in the newsletter. It was a brainchild of Mr. Vikash Kumar, former chief editor and one of the founder members of Awaaz. In a literal sense, Panji Dude is a five-pointer who doesn’t go to classes or know much about studies. What distinguishes him from the rest of the students is his creative lifestyle and how he is in a class of his own when it comes to providing an out-of-the-box solution to any problem that students face in the campus. The Facebook page of Panji Dude provides Awaaz an unofficial platform to highlight the problems in the campus through sarcastic texts and cartoons.", "page": "Awaaz"}, {"chunk_id": "2b7688fe", "title": "Website", "text": "The website of Awaaz, IIT Kharagpur contains a wide range of articles and sections, some of which are as follows:\n1. Articles\nThe website contains a medley of articles ranging from topics of student interest to interviews. There are some series of articles initiated by Awaaz.\nKnow Your Professor (KYP) includes the interviews of some of the well-known professors of the institute. Prof. Somesh Kumar, Prof. Parama Barai and Prof. Navtej Singh are some of the professors in this series.\nKnow Your Entrepreneur (KYE) includes the interviews of some of the greatest entrepreneurs who are alumni of the institute, talking about their student life and experiences of their startup. Inshorts, Anthill Creations and CyberEye are some of the startups in this series.\nJewels of KGP is a series about some of the gems that IIT Kharagpur has produced, excelling in life during or after graduation from the institute. Mr. Lakshya Jain, Dr. Harish Hande, Mr. Shikhar Patranabis are some of the people in this series. The website also includes articles of general interest like National Digital Library, Foreign University Training, Relevance of EAA etc.\n2. Information Portal\nThe website includes an information portal that provides a wide range of details like Department Change statistics, food outlets in the campus, emergency contacts, details about various scholarships etc.\n3. Placement and Internship Statistics\nAwaaz releases a detailed analysis for placements and internships every year for the students for their future reference. The analysis includes percentage placements, department-wise and course-wise analysis of the same.\n4. General Championship\nThe Inter-hall General Championship is one of the most awaited event in the campus during the year. The thrilling General Championship results are timely reported and updated by Awaaz.\n5. TSG Elections\nAwaaz reports to the general student body the complete SOPs and Proposals of all the candidates standing for various posts in the elections.\n6 . आप की राय-\nA new Web series ‘आप की राय’ in which we will create a poll on a weekly basis which would cover general, administrative and national issues. Our report on that would be a reflection of the views of the student community of IIT Kharagpur.", "page": "Awaaz"}, {"chunk_id": "2734c77e", "title": "Initiatives", "text": "“I still believe that if your aim is to change the world, journalism is a more immediate short-term weapon.” - Tom Stoppard\nThe media body of any institution plays a significant role in improving the conditions of the institution and make sure that the demands of the general body reach the concerned authorities. Progress reaches the society only when change is observed. Awaaz has tried to bring a change in the institute and students’ lives every then and now. Some of the initiatives have been described below:\nSting Operation on Passport Bribery Case: A common complaint of the police officers asking for bribes was reported by a lot of students. The bribe amount varied from around 200 to 500 rupees. Awaaz conducted a sting operation and recorded the incident stealthily. The recording along with the report of a survey conducted by Awaaz was submitted to the concerned authorities and bribery was almost curbed.\nCV Module: When the ERP-based CV Module was newly introduced in the institute, the students faced a lot of problems due to the highly inefficient and buggy platform on which they were supposed to make their CV. Awaaz conducted a survey and prepared a report to submit to the administration. The report was considered by the administration and the CV Module was halted for a few days to come up with a better version of the same.\nSecurity Issue: In 2016, the campus had way too less number of security guards and CCTV Cameras. The report submitted by Awaaz regarding the same was considered and led to a lot of changes on the security front in the campus.\nCleanliness Issue: On the behalf of the entire student community, Awaaz demanded an increase in the number of dustbins in the campus and use of steel dustbins instead of plastic ones. The struggle bore fruits and the requests were considered by the institute.", "page": "Awaaz"}, {"chunk_id": "c78cc7cd", "title": "Events Conducted", "text": "Awaaz, IIT Kharagpur conducts two events in the span of one year:\nPanch Parmeshwar: In the splendour of Spring Fest, Awaaz conducts ‘Panch Parmeshwar’, an event that attempts to bring the funniest and most delightful village memories back for the students. The participating teams are presented with an amusing and tangled case and the dispute is led to the Panchayat where they have to win the case by defending their side through relevant and humorous arguments.\nKavyanjali: Poets across the nation gather together for a poetic evening at the campus!", "page": "Awaaz"}, {"chunk_id": "e36f05d9", "title": "Selection Procedure", "text": "Selections to Team Awaaz are held once every year, for both first and second year students, in the month of August. Awaaz selects around 25 students in total just after the Freshers’ Introductory Seminar. The selection procedure consists of a group discussion task and a written test followed by a personal interview.", "page": "Awaaz"}, {"chunk_id": "0b2ad96d", "title": "Alumni of Awaaz, IIT Kharagpur", "text": "2006 | Ashutosh Kumar | Gautam Sinha | Rahul Ranjan Mishra | Ritesh Gupta | Vivek kumar thakur | Ashutosh kumar\n2007 | Kumar Abhinav | Shyam sunder | Arunabh parihar\n2008 | Pankaj Kumar Soni | Sumit Singhal | Abhinav Prasad\n2009 | Avimuktesh Bharadwaj | Varun Prakash\n2010 | Aman Kumar | Ashutosh Kumar Mishra | Siddharth Doshi\n2011 | Madhusudan | Anurag Katiyar | Kunal Minda | Nishtha Sharma\n2012 | Nishtha Sharma | Simmant Ujjain | Swati Das\n2013 | Animesh Choudhary | Amit Kumar Dalmia | Rohan Bhatore | Vaibhav Shrivastava | Sughandha | Sushil Rathi | Charuvind Atre | Pushpam Bharadwaj | Raja Paswan\n2014 | Prashant Jha | Sangam Trithraj | Vikas Kesari | Vikas Dubey | Gopinath Soren | Kunwar Akash | Neeraj Kashyap | Gyaan Prakash\n2015 | Nikesh Kumar | Krati Aggrawal | Shubham Bisht | Manpreet Singh | Manish Choudhary | Prashant Kartikey | Krunal | Bhavya Kumari | Parbani Kisku\n2016 | Pranay Prasoon | Anjali Goyal | Pragati Patidar | Priyanka Raj | Gyandeep Kumar | Shailesh Kumar | Vaidehi Bhardwaj | Ankit Bansal | Rameshwar Jaiswal | Nancy Charaya\n2017 | Shubham Sharma | Manoj Meena | Siddhant Gupta | Khushboo Kumari | Ramesh Thakur | Sumit Pandey | Ayush Pandey\n2018 | Kaustubh Mirge | Nihal Gupta | Chirag Bariya | Sumit Pandey | Shubham Singh\n2019 | Nawazish Parwez | Ayush Gautam | Smita Mandal | Bhawana Bansal | Subhajit Kumar Barman | Shashwat Mishra | Astha Pandey\n2020 | Rahul Raj | Swapnil Singh | Saloni Meshram | Sheet Kushal | Lovish Chopra | Navin Kumar", "page": "Awaaz"}, {"chunk_id": "6016193a", "title": "External Links", "text": "• https://facebook.com/awaaziitkgp\n• https://www.instagram.com/awaaziitkgp\n• https://youtube.com/user/awaaziitkgp\n• https://issuu.com/awaaz\n• https://linkedin.com/company/awaaz-iit-kharagpur", "page": "Awaaz"}, {"chunk_id": "9e28382a", "title": "Contact us", "text": "Phone No: Rishabh Raj : 9117337131\nEmail: [email protected] OR [email protected]\nEmail: [email protected]", "page": "Awaaz"}]