[{"chunk_id": "info_e112ad", "title": "CodeClub - Quick Facts", "text": "Activities | Hackathons , Code.Fun.Do , CodeNites , Bitwise\nFounded | 2013 ( 2013 )\nFounder(s) | Ashish Vasava, Yash Bajaj\nNumber of members | 40\nWebsite | cse .iitkgp .ac .in /~depsoc /codeclub .html\nContact | +91 787 268 8505 (Vadde Santosh Pradeep Chandra) +91 851 390 2048 (Abhishek Niranjan)\nUnder TSG | No", "page": "CodeClub"}, {"chunk_id": "e26f3d5d", "title": "CodeClub", "text": "Code Club is the department society of Computer Science & Engineering . It is IIT Kharagpur's programming and computer science organization. It is responsible for organizing CodeNites which are a series of Intra KGP coding competitions, designed to promote a culture of competitive programming in the campus. It also organizes BitWise , the annual fest of the Computer Science and Engineering Department.", "page": "CodeClub"}, {"chunk_id": "fbd2224c", "title": "Selection process", "text": "Code Club holds Fresher Selections at the beginning of the academic year to select first year students from the Department of Computer Science and Engineering as coordinators in the society. Selection procedure consists of a group-discussion round followed by personal interview for the shortlisted candidates. Prospective members are selected based on their ability to think outside the box, their dedication, their enthusiasm, and their zeal to learn.", "page": "CodeClub"}, {"chunk_id": "dc51b90e", "title": "Structure", "text": "Code Club , IIT Kharagpur has the following structure:\n• Presidents and Advisors are fourth year members of the society who give overall direction to the club and frame its vision for the future.\n• The executive body of Governors and General Secretaries is made up of third year students. They are responsible for the running and management of the society.\n• Second year members of the society work as Secretaries and are responsible for day-to-day functioning of the club and execution of its plans.\n• Members in their first year of study make up the body of enthusiastic Coordinators of CodeClub.", "page": "CodeClub"}, {"chunk_id": "a7249d32", "title": "Current Leadership", "text": "• Presidents: Sudutt Harne (CS '21), Nikhil Nayan Jha (CS '21)\n• General Secretaries: Achal Gupta (CS '20), Krushna Gaurkar (CS '20)\n• Professor In-charge: Dr. Rogers Mathew, Prof. Swagato Sanyal\n• Tech Team:", "page": "CodeClub"}, {"chunk_id": "adf0ffdc", "title": "Code.Fun.Do / Code.Fun.Do++", "text": "Main article: Code.Fun.Do\nCode.Fun.Do is a Microsoft sponsored hackathon, organized by CodeClub [ 1 ] , IIT Kharagpur, requiring student teams to come up with an hacked application prototype in 24 hours. The complete program is spread over the entire weekend involving workshops, coding, and demos followed by results and prize distribution. Winners usually take away exciting Microsoft products (Nokia Lumia, for example) while t-shirts and participation certificates are awarded to all teams who give the demo. [ 2 ]\nIn Autumn 2018, CodeFunDo++ was organised. Students had to come up with ideas on the given problem statement. The selected ideas had to be remotely worked on. Of the successful submissions, 5 teams qualified to the next stage.", "page": "CodeClub"}, {"chunk_id": "8678ce21", "title": "CodeNites", "text": "CodeClub organizes fortnightly coding contests to promote a culture of competitive programming on campus, in collaboration with HackerRank for the student community at IIT Kharagpur [ 3 ] . The problems for these contests are usually set by fourth and fifth year students from the Computer Science Department. Participating programmers from campus have their submissions scored on the basis of the accuracy of their output and the execution time of their solution. Programmers are then ranked and win prizes based on their accomplishments, to drive competition among users [ 4 ] .", "page": "CodeClub"}, {"chunk_id": "a237c1a8", "title": "Fresher's Event", "text": "At the beginning of each academic year, CodeClub hosts a Fresher's event to introduce computer science freshmen to the department. This event includes a cultural show with acts, plays, dances etc. put up by students in their first year of study. The annual event acquaints freshmen to the resources and opportunities available to them, along with helping them build relations with other students from the Computer Science Department.", "page": "CodeClub"}, {"chunk_id": "22bd0231", "title": "Bitwise", "text": "Main article: Bitwise\nBitwise is an annual programming, application and web development fest organised by CodeClub , the CSE Department Society of IIT Kharagpur [ 5 ] over three days in the 2nd week of March. With huge support from the Department of CSE, the Bitwise team works intensely and enthusiastically to bring out the best workshops, guest lectures, and events centered around the most trending topics of Computer Science. The last iteration, Bitwise 2015, was held from March 13 to March 15, 2015. Prizes worth close to ₹ 200,000 were distributed.\nSSD was the title sponsor [ 6 ] for Bitwise 2015, and Xerox , [ 7 ] its associate sponsor, with HackerRank [ 8 ] slated to be the coding partner.", "page": "CodeClub"}, {"chunk_id": "ccc77029", "title": "Computer Science Workshops", "text": "CodeClub organizes workshops and knowledge sessions on various computer science topics and programming languages. These sessions are open to students from all years of study across departments and fields, and have upperclassmen sharing their knowledge and experience on the various topics of the workshop. Classes on Python Programming and the Divide & Conquer Paradigm have been held in the Autumn 2015 semester [ 9 ] .", "page": "CodeClub"}, {"chunk_id": "69cadfe0", "title": "UpAI Summit 2018", "text": "Up AI Summit 2018 was organised by Code Club, IIT Kharagpur in the first week of October. It started with an open for all boot camp workshop. had various talks, workshops and challenges / competitions on the budding fields of Machine Learning / Deep Learning. on this 2.5 days summit.", "page": "CodeClub"}, {"chunk_id": "e46e9ff0", "title": "References", "text": "↑ \"Code Fun Do - Code Club, IIT Kharagpur\" . Retrieved 30 September 2015 . ↑ \"Code Fun Do - Code Club, CSE, IIT Kharagpur\" . Retrieved 15 September 2015 . ↑ \"CodeNite 7.0\" . Retrieved 30 September 2015 . ↑ https://en.wikipedia.org/wiki/HackerRank ↑ http://cse.iitkgp.ac.in/ ↑ http://www.ssdkolkata.net/ ↑ http://www.xerox.com ↑ https://www.hackerrank.com ↑ https://www.facebook.com/CodeClub.IITKGP", "page": "CodeClub"}]