[{"chunk_id": "info_446717", "title": "Developers%27 Society - Quick Facts", "text": "[[File:|DevSoc, IIT Kharagpur]]\nFounded | 2022 ( 2022 )\nUnder TSG | Yes", "page": "Developers%27 Society"}, {"chunk_id": "013105bb", "title": "Developers%27 Society", "text": "The Developers’ Society is an initiative by the Tech Team, Technology Students’ Gymkhana, Indian Institute of Technology Kharagpur, to foster and encourage the software development culture at IIT Kharagpur. Ideated as a group of developers of the institute, the society is responsible for developing and maintaining applications valuable to the student community as well as fostering the software development culture of the institute.", "page": "Developers%27 Society"}, {"chunk_id": "32b62e75", "title": "Background", "text": "In view of improving the eaning development culture at IIT Kharagpur, the Tech Team, Technology Students' Gymkhana, in the academic session 2022-23, laid the groundwork for the foundation of the Developers' Society.", "page": "Developers%27 Society"}, {"chunk_id": "8f6c8655", "title": "Motive and Aim", "text": "In light of the need to improve existing applications and the potential for automating various workflows on campus, the Developers’ Society aims to bring together a group of individuals who are motivated and interested in developing new applications that benefit the student community and hence, encourage the software development culture in IIT Kharagpur.\nThe Developers’ Society aims to:\n• Support the software development culture of IIT Kharagpur.\n• Promote and impart programming skills, technologies and frameworks.\n• Foster good programming practices in the student developers’ community.\n• help Technology Students’ Gymkhana develop projects aimed at improving the student community and, therefore, the technological advancement of IIT Kharagpur.", "page": "Developers%27 Society"}, {"chunk_id": "28d5f07b", "title": "Teams and Hierarchy", "text": "• Development Team :\n• Finance and Operations Team :\n• Outreach Team :", "page": "Developers%27 Society"}, {"chunk_id": "d140d151", "title": "Current Heads", "text": "Name | Position\nKunal Verma | Executive Head\nNabhya Khoria | Finance and Operations Head\nGaurav Sresth | Finance and Operations Head\nSai Kalyan | Outreach Head\nTushar Kanwaria | Outreach Head\nTejas Ambhore | Development Head\nNilesh Das | Development Head\nVaibhav Mohite | Development Head\nAman Kumar | Development Head\nShivesh Chaturvedi | Development Head\nNishakar Kumar | Development Head", "page": "Developers%27 Society"}, {"chunk_id": "b13be115", "title": "Projects and Activities", "text": "The current projects implemented under Developers' Society are:\n• ApnaInsti :", "page": "Developers%27 Society"}]