[{"chunk_id": "f9ca8314", "title": "Entrepreneurship Cell", "text": "Entrepreneurship Cell , IIT Kharagpur ( E-Cell ) is a non-profit student’s organization dedicated to promoting the spirit of entrepreneurship among students throughout India . [ 1 ] [ 2 ] Established in 2006 under the aegis of STEP (Science and Technology Entrepreneurs’ Park), [ 3 ] IIT Kharagpur, E-Cell has since been involved in more than 35 startup companies in the initial stages of their existence. [ 4 ]", "page": "Entrepreneurship Cell"}, {"chunk_id": "5a280156", "title": "Vision", "text": "The basic aim of E-Cell is to encourage college-level students today to start their own enterprise . [ 5 ] This, it does by the following means:\n• Organising Workshops and Lectures periodically to create awareness about entrepreneurship.\n• Functioning as a guide for students with creative ideas which can be transformed into successful companies.\n• Providing Mentorship through individuals for students launching their start-ups.", "page": "Entrepreneurship Cell"}, {"chunk_id": "3b51bfe6", "title": "History", "text": "E-Cell was formed in 2006, from the Students Chapter of TIETS (Technology Incubation and Entrepreneurial Training Society), a body under SRIC (Sponsored Research and Industrial Consultancy), [ 6 ] IIT Kharagpur, by the efforts of some enterprising students. The first ever edition of its flagship event, the Global Entrepreneurship Summit (GES) was held in 2007 (then known as Entrepreneurship Summit or E-Summit), while that of its Nation-wide drive, Entrepreneurship Awareness Drive (EAD) was organized in 2009. E-Cell today has more than 50 members from within IIT Kharagpur, and several more outreach members from various other colleges in the city.", "page": "Entrepreneurship Cell"}, {"chunk_id": "ef3a1950", "title": "Activities", "text": "E-Cell conducts a myriad of activities throughout the year, for the benefit of students within IIT Kharagpur as well as those in other colleges throughout India.", "page": "Entrepreneurship Cell"}, {"chunk_id": "11432e95", "title": "Global Entrepreneurship Summit", "text": "Global Entrepreneurship Summit (GES) [ 7 ] is the flagship event of E-Cell, which is organized during the second weekend of January. First held in 2005, by the then TIETS-Student Chapter, with just one in-house competition, viz. Concipio, it grew on to become a full-fledged Entrepreneurship Summit in 2007 to the Global Entrepreneurship Summit in 2010, attracting participation from different countries like Singapore, Germany, the United States of America and Japan. It is a platform where entrepreneurial minds throughout the world meet, where inspired by old ideas, new ones arise and where these ideas are put to test. It is a get-together of motivated students, aspiring entrepreneurs as well as established professionals, who meet under various formal and informal sessions, which include Guest Lectures, Workshops, Conferences such as Venture Capitalist Conference, Global Entrepreneurship Conference, etc.", "page": "Entrepreneurship Cell"}, {"chunk_id": "e007fcd3", "title": "Global Entrepreneurship Conference", "text": "With the advent of new technologies and the world wide web , the world has become a small place to live in, and boundaries are political than physical. Hence, development taking place in one country of the world seldom fails to have an effect in another. With this in mind, E-Cell hosts the Global Entrepreneurship Conference (GEC), in which organizations from across the Globe participate and, through Video Conferencing discuss the entrepreneurial ecosystem prevailing in their respective countries and try to gather the best of that taking place in different countries. This conference is represented by a panel from each of the organizations, and is screened to the audience at IIT Kharagpur. The participating institutions include Harvard Business School and Illinois Institute of Technology , United States of America ; Oxford Entrepreneurs, England ; Industrial Development Authority, Ireland ; National University of Singapore , Singapore ; Ludwig-Maximilians-Universität , Germany ; TiE Japan.", "page": "Entrepreneurship Cell"}, {"chunk_id": "b31b6e76", "title": "Startup Fair", "text": "Startup Fair is a platform which involves interaction of Entrepreneurs and students and aims to help Start up to recruit the finest talent for internships/jobs. Besides, due to the presence of a large number of Venture Capitalists in the GES, it is also an opportunity for the Startups to showcase their growth to the VCs and apply for their funding.", "page": "Entrepreneurship Cell"}, {"chunk_id": "ef9cd526", "title": "Entrepreneurship Awareness Drive", "text": "Held in September–October of every year, Entrepreneurship Awareness Drive (EAD) [ 8 ] is an initiative by E-Cell to promote entrepreneurship and encourage students from across India to embrace the concept of starting one's own enterprise. It comprises a series of Guest Lectures, termed Entrepreneurship Awareness Camps (EACs) in cities throughout India in a span of 10 days, each hosted in a reputed college of the respective cities. Each EAC includes a successful entrepreneur speaking about their entrepreneurial experiences and the joys and hardships of their journey to success. The speakers in EAD 2009 consisted of personalities of the likes of K.D. Singh of Alchemist Group, Arbind Singh of Nidan (Social Entrepreneur of the year 2008), [ 9 ] Gerard J. Rego of Vayugrid Inc., Murugavel Janakiraman of Bharatmatrimony.com and Vasant Subramanian, the then President of TiE, Kolkata Chapter .", "page": "Entrepreneurship Cell"}, {"chunk_id": "f4463e0d", "title": "Competitions", "text": "E-Cell conducts 6 major competitions, the winners of which are provided with the resources which they will require to develop their ideas into a company, viz., Incubation , Mentorship and Financing . The final judging round of all competitions is done during the Global Entrepreneurship Summit.", "page": "Entrepreneurship Cell"}, {"chunk_id": "9bfb1dd9", "title": "Empresario", "text": "The entrepreneurship cell of IIT Kharagpur is all set to launch the preliminary round of Empresario 13 , the annual business plan competition among students across the globe.", "page": "Entrepreneurship Cell"}, {"chunk_id": "2fa44ec8", "title": "Concipio", "text": "Concipio is the annual in-house Business Plan competition organised by the Entrepreneurship Cell, IIT Kharagpur. The competition promises to bring about a fruitful transition in the regular placement culture of the institute with the introduction of Entrepreneurial avenues to the students. The competition is aimed to transform the raw ideas that are born in the institute into full fledged business models.", "page": "Entrepreneurship Cell"}, {"chunk_id": "93d81bdd", "title": "Envision", "text": "Envision is a Product design competition organized by the Entrepreneurship Cell, IIT Kharagpur. It caters to those visionaries who have it in them to impact our present, and revolutionize our future. The aim of this competition is to provide an arena where the next generation of block-buster products can be showcased and to provide a platform for the winners to take their idea to the next level. With the assistance of the TePP, feasible products can get up to 30 lacs wotrh of funding and mentorship.", "page": "Entrepreneurship Cell"}, {"chunk_id": "760b1fe1", "title": "Pensez", "text": "Pensez is the annual Case Study Competition organised by the Entrepreneurship Cell. The problem statements are designed to inculcate an innovative strategy of analysing phenomena relating to entrepreneurship in general. It includes Sociological, Industrial and Technological aspects designed to focus on certain trends and issues in entrepreneurial spheres.", "page": "Entrepreneurship Cell"}, {"chunk_id": "5ed23a4f", "title": "Eclairez", "text": "Social entrepreneurs are not content just to give a fish or teach how to fish. They will not rest until they have revolutionized the fishing industry. [ 10 ] Eclairez is a Social Entrepreneurship Challenge aimed towards those individuals who have the gumption to empower those at the bottom of the pyramid as well as earn profits for themselves while doing so. This competition aims at the amalgamation of students, NGOs, incubators, social entrepreneurs, venture-capitalists and corporations to develop and encourage the spirit of Social entrepreneurship . It is a platform for Social entrepreneurs to showcase their innovative solutions to society's most pressing social problems.", "page": "Entrepreneurship Cell"}, {"chunk_id": "4475ff29", "title": "CleanTech Challenge", "text": "Cleantech Challenge is a Clean Technology -oriented Business Plan competition organized by E-Cell. Its uniqueness lies in the fact that it is the first of its kind in India. Clean Technology or \"Cleantech\" is any company or business model that uses innovative technology to create economically viable products and services that offer competitive returns for investors and customers, while providing solutions to global problems. It incorporates products and services that improve operational performance, productivity or efficiency while reducing costs, inputs, energy consumption, waste or pollution. They are expected to help our society move away from a dependence on non-renewable fuels and foster a healthy natural environment.", "page": "Entrepreneurship Cell"}, {"chunk_id": "f4eecf48", "title": "Negocio", "text": "Negocio is a web and mobile applications based b-plan competition organized by the Entrepreneurship Cell, IIT Kharagpur. The competition promises to bring out new ideas and formulate revolutionary revenue models in the Web and Mobile Apps Spectra which are yet to be ventured. [ 11 ]", "page": "Entrepreneurship Cell"}, {"chunk_id": "857e0c39", "title": "Guest Lectures", "text": "E-Cell addresses the latter through the various Guest Lectures which are conducted as part of GES. Talks by various authorities on entrepreneurship are conducted, as they serve as motivation as well as guide-posts for aspiring entrepreneurs. Some of the speakers in this platform include: [ 12 ] Arjun Malhotra Co-founder, HCL Technologies and Chairman, Headstrong ; Vinod Dham , Inventor of the Pentium Chip ( Father of Pentium Chip [ 13 ] ); Sanjeev Bhikchandani , Founder, Naukri.com ;\" Alok Patnia , Founder at Taxmantra.com \", K.D. Singh , Founder, Alchemist Group; Sunil Handa , Serial entrepreneur, Faculty, IIM Ahmedabad and Management Guru ; Padma Shri Anil Gupta Faculty, IIM Ahmedabad , Padma Shri Awardee (for distinguished achievements in the field of management education); Sramana Mitra Forbes Columnist and Strategic Consultant; Dominique Trempont Board of Directors , 3Com, Finisar, Energy Recovery Inc., associated with Steve Jobs as CFO of NeXT; Anand Sen , Vice-President, Tata Steel ; Rashmi Bansal , Writer of books such as Stay Hungry Stay Foolish .", "page": "Entrepreneurship Cell"}, {"chunk_id": "767d084b", "title": "Workshops", "text": "Workshops tend to have a large impact on the task encouraging the spirit of entrepreneurship in young minds. These workshops focus on a wide variety of topics and aim at building a broader understanding of new forms of innovation and analysing the key challenges posed to entrepreneurs. They typically address some of the critical issues faced by entrepreneurs like Business-plan writing and funding one’s own venture. Other technical and non-technical areas like Risk Management , Financial Analysis , opportunities of innovation and entrepreneurship available in certain sectors, are also taken up. These workshops are conducted annually by organizations like Intel , Novell , CII -Sorabhji Godrej , Seeders, Wipro (WiCamp) etc.", "page": "Entrepreneurship Cell"}, {"chunk_id": "13f28808", "title": "Knowledge Camp", "text": "Knowledge Camp is held annually within the Institute and aims at encouraging students to interact among themselves regarding new emergent technologies and business issues like alternate energy, finance, carbon trading etc. The topics chosen are from those in which there is active research with applications in industry and at the same time general enough to invoke interest. A typical Knowledge Camp session would begin with the introduction of the topic, declared well in advance, followed by presentations by speakers. Every member is by default invited to make presentations, with the liberty of content and duration. While the delivery is on, the topic is open to the house for questions and to add to any of the subtopics covered. Although they need not be after rigorous research or core calculations, such content is more than welcome. A reliable source is acceptable for discussions as well as presentations. It provides a learning platform for students from all disciplines and areas irrespective of their year of study. Presenters include students and research scholars presently working in the fields.", "page": "Entrepreneurship Cell"}, {"chunk_id": "c607758d", "title": "Fund-a- KGP ian", "text": "Alumni of IIT Kharagpur are a very important source of funds for development projects within the Institute. Taking this into account, E-Cell has a unique programme by which it recommends to the alumni network, certain good ideas that students of the institute have come up with. These entries are then scrutinized by the respective alumni, who then help finance or mentor these ideas, as they develop into a full-grown company.", "page": "Entrepreneurship Cell"}, {"chunk_id": "a95e22c9", "title": "Innovation Platform", "text": "Innovation Platform (IP) is a platform provided by E-Cell for those students interested in starting-up. Entrepreneurial ideas are invited from the First Year students of the Institute, and the best among these, selected by professors, are then provided with funding by TIETS and mentoring by the professors. This takes place alongside the regular academic course, so that when the students leave the Institute at the end of their fourth- or fifth- year, as the case may be, their idea grows into a company that can face the stiff competition in the real world. Some of these ideas, related to product designing have been awarded the coveted Kishore Vaigyanik Protsahan Yojana ( KVPY ) scholarship, offered by the Government of India.", "page": "Entrepreneurship Cell"}, {"chunk_id": "d6375156", "title": "Rajendra Mishra School of Engineering Entrepreneurship", "text": "The Rajendra Mishra School of Engineering Entrepreneurship , IIT Kharagpur was started in the year 2010, largely due to the efforts of E-Cell. This is the first school in India, which imparts entrepreneurial education at college level. Students of IIT Kharagpur have the option to take up the M.S. course offered by SoEE, alongside their regular B.Tech course, and upon successful completion of the both the courses, are awarded a Dual Degree (B.Tech.+M.S.). Under this course, students have subjects which, unlike MBA courses that deal with corporate management, help them in the specific task of management within a startup, which is quite different from the former. In the fifth-year, students are provided with funding up to Rs. 1 Lakh and also mentoring and incubation to enable them to develop their own company.", "page": "Entrepreneurship Cell"}, {"chunk_id": "55dbd3b5", "title": "Deferred Placement Programme", "text": "Deferred Placement Programme (DPP) acts as a cushion to those who want to pursue with their entrepreneurial idea after completion of their study in the Institute. Under this programme, if the student does not wish to take up a campus placement offer, he/she can pursue with their startup, and if, after a period of one year, they wish again to take up a job, may attend the campus-interviews in the year subsequent to that of their passing out. IIT-Kharagpur is the first institute to offer this programme at Undergraduate-level.", "page": "Entrepreneurship Cell"}, {"chunk_id": "a0fedbe0", "title": "Kairos Society", "text": "The Kairos Society , a US-based not-for-profit student-run organization [ 14 ] organizes an annual Summit on Entrepreneurship. In the 2010 edition of this summit, the Indian team consisted of four members from E-Cell. Furthermore, the delegation was formally endorsed by Mr. Sashi Tharoor personally. [ citation needed ]", "page": "Entrepreneurship Cell"}, {"chunk_id": "e1be99bb", "title": "References", "text": "↑ http://articles.timesofindia.indiatimes.com/2012-11-05/news/34926566_1_fms-students-e-cell-student-activities ↑ http://articles.timesofindia.indiatimes.com/2012-12-21/indore/35952856_1_iit-k-entrepreneurship-awareness-drive-iit-kharagpur ↑ http://www.stepiitkgp.in/otheractivities.html ↑ http://www.ecell-iitkgp.org/about_us/portfolio ↑ IIT Kharagpur event comes to NIT Rourkela ↑ http://www.iitkgp.ac.in/sric/ ↑ http://www.ecell-iitkgp.org/events/esummit/ ↑ http://www.ecell-iitkgp.org/events/ead ↑ http://www.khemkafoundation.org/awards/social-entrepreneur-of-the-year/2008-finalists/arbind-singh-nidan ↑ Drayton, Bill. http://www.betterworld.net/quotes/entrepreneur-quotes.htm ↑ https://www.facebook.com/photo.php?fbid=10152564437703266&set=a.137744623265.142018.129788793265&type=1&theater ↑ http://www.ecell-iitkgp.org/events/guest-lectures ↑ http://www.neaiuv.com/ourppl_vinoddham.htm ↑ http://www.kairossociety.com/about/about-kairos-society/", "page": "Entrepreneurship Cell"}, {"chunk_id": "e5932a15", "title": "External links", "text": "• IIT Kharagpur\n• Entrepreneurship Cell\n• Global Entrepreneurship Summit\n• Science and Technology Entrepreneurs' Park, IIT Kharagpur", "page": "Entrepreneurship Cell"}]