[{"chunk_id": "0a7b4d54", "title": "Gopali Youth Welfare Society", "text": "Gopali Youth Welfare Society commonly abbreviated as GYWS is a government-registered NGO in West Bengal and aims to improve the living standards of people in Gopali village. The organisation was started in 2002 and registered on 20 April 2005 under the West Bengal Societies Registration Act, 1961. It is mainly run by the students of IIT Kharagpur with the help of professors of IIT Kharagpur and local citizens of Gopali village. It mainly focuses on Child education along with Women Empowerment, Eradicating Child Labor among many other causes.\nThe organisation has initiated several programs of free education, social awareness campaigns and vocational training.", "page": "Gopali Youth Welfare Society"}, {"chunk_id": "9d00bbbf", "title": "History", "text": "The organisation was started in 2002 by Mrinal Kanti Bhanja, and registered on 20 April 2005 under the West Bengal Societies Registration Act, 1961. It is mainly run by the students of IIT Kharagpur with the help of professors of IIT Kharagpur and local citizens of Gopali village. Jagriti Vidya Mandir was started in the year 2008 in a rented campus, and was shifted to a permanent campus in the year 2012. LIGHT, the pan- India expansion initiative of the socity, was started in the year 2017.", "page": "Gopali Youth Welfare Society"}, {"chunk_id": "359a4d93", "title": "Jagriti Vidya Mandir", "text": "Marking illiteracy as its prime concern, GYWS embarked on an education program in April 2008: Jagriti Vidya Mandir, an English Medium primary school. Its main motto is \"not to make the children literate, but to make them educated.\nFoundation Day: It is conducted in the month August every year. Members of GYWS conduct events and various competitions for the children.\nTeachers’ Day: We celebrate Teachers’ Day in our school to show our respect to our teachers and to make our students know the importance of teachers in life.\nSports Day: It is the annual sports meet conducted in our school. It is conducted in the month of October.\nRepublic Day: Speech by the chief guest, flag hoisting followed by the performances of the children takes place.\nAashayein: It is the Annual day celebration of our school in which the students of JVM come and perform in IIT KGP so that they get a broad platform. Generally, it takes place in the month of March.", "page": "Gopali Youth Welfare Society"}, {"chunk_id": "0cac2ec3", "title": "Prayas", "text": "Skill development : Under this initiative, our objective is to impart skills to the youth first so that they can become an earning hand for their family.In this program, we train and develop educated but unemployed youth in line with industry requirements and provide them employment opportunities.\nLive Project : Live Project is the channel to put the budding managers on the track of social work. The project involves in selecting the potential candidates from the various institutions giving them the liberty to work on a problem and expanding the scope of the work.\nGreenovation: It is an ambitious project aimed at introducing low cost and organic farming techniques to farmers of nearby areas of kharagpur. School children are also involved so that they can develop interest in agriculture.", "page": "Gopali Youth Welfare Society"}, {"chunk_id": "b6c9a5df", "title": "Udyat", "text": "Under Teacher Training ,the PG and RS students try to help the teachers to improve their ability to teach.The students of JVM are taught how to operate computers in this initiative.We plan to extend this initiative for the students of other schools too.A weekly Science based fun activity has been conducted in Jagriti Vidya Mandir. Objective is to bring gleams in the eyes of children while learning in school. The students conduct sessions to project curious science and textbook fundamentals in an Involved manner.Along with the regular school, JVM students are also taught on Sundays.They are motivated to study hard and also are given coaching for JNV entrance test.", "page": "Gopali Youth Welfare Society"}, {"chunk_id": "db58d7d1", "title": "LiGHT", "text": "Living In Greater Horizons Together. After the success of strategies and plans of the Gopali Youth Welfare Society (GYWS) near the area of IIT Kharagpur, the society planned to reciprocate similar models of social upliftment throughout the nation.LIGHT currently has four centers-Bhopal(MP), Gaya(Bihar), Kancheepuram(Tamil Nadu), Samvedana(Maharashtra).", "page": "Gopali Youth Welfare Society"}, {"chunk_id": "94738e7c", "title": "Paperkraft", "text": "Aimed ‘ Generating Employment, Preserving Environment and empowering women ‘ , As part of this project, students volunteer to collect old newspapers from the Halls of Residences of IIT Kharagpur. These are given to poor rural women, free of charge, to make into ‘thongas’ or paper bags. Currently 30 women are associated with the production process who were given a week long training to make thongas.\nPaperKraft thus provides an opportunity to the destitute women to become self-employed. Also it promotes a cleaner and greener environment as it recycles degradable waste materials into something and also provides a viable substitute to plastic bags which are non-biodegradable. Thus PaperKraft is a sustainable, employment-generating, and environment friendly.", "page": "Gopali Youth Welfare Society"}, {"chunk_id": "13858b1a", "title": "KGP BloodConnect (K.B.C.)", "text": "K.B.C. [ 1 ] is an initiative started by Gopali Youth Welfare Society & Student Welfare Group -IIT Kharagpur . It was realised by us that whenever there is a requirement of blood, many people are willing to donate blood but due to some or the other reasons communication gap becomes their barrier and as a result prompt help doesn't reach to the patient which is very essential in case of an emergency .\nK.B.C. can become a sailing medium of contact for the donor and patient and this particularly is our motto along with spreading awareness about blood donation behind starting such a program.\nK.B.C. is also associated with ' Kharagpur Voluntary Blood Donor Organisation (KVBDO)' and have contacted the local hospitals of Kharagpur including Kharagpur Railway Hospital. It's not that K.B.C is only for the students but it will benefit local people in and around Kharagpur.", "page": "Gopali Youth Welfare Society"}, {"chunk_id": "0f516f14", "title": "Pedals for Progress", "text": "Some of the kids need to travel long distances to come to school and then go back again. Owing to these hectic travel, GYWS initially booked a Cab to supplement their requirements. But the cab has been unable to reach out every child because of which students either walk down the road or their parents have to go with them. So, GYWS members collect bicycles from passing out IIT Kharagpur students, repairs them and gives them to the JVM children. In this way, children coming from far off places can travel comfortably.", "page": "Gopali Youth Welfare Society"}, {"chunk_id": "1d7b29a2", "title": "Yogdaan", "text": "Yogdaan is an initiative taken by GYWS in which the members go door to door of each and every student of IIT Kharagpur campus and request them for donation for their school construction project.Since last 3 years they have been doing yogdaan annually and have been getting a very good response from them every year. With the wholehearted support from students in the very first year of yogdaan, GYWS had bought land for school construction, and from the fund of next yogdaan, two classrooms had been completed there and from last year's yogdaan fund, the work is in progress currently, and the good news is that school has been started in new campus.", "page": "Gopali Youth Welfare Society"}, {"chunk_id": "7bc79b11", "title": "Spring Fest Stall", "text": "While everyone gets busy enjoying during the glamorous Spring Fest , GYWS Members in turn look after the stall which is majorly prepared to promote the activities and partially to collect funds for the betterment of the children.", "page": "Gopali Youth Welfare Society"}, {"chunk_id": "1c1fa084", "title": "Annual Day", "text": "Like every other school, JVM also celebrates Annual Day, which has been named Aashayein, with full flair. First Annual Day was held in 2009. Support by advisory committee and presence of dignitaries which includes Director, IIT Kharagpur Prof. Partha Pratim Chakraborty has helped GYWS & JVM celebrate annual days without any serious concern with limited monetary resources.", "page": "Gopali Youth Welfare Society"}, {"chunk_id": "41fb7395", "title": "Objectives", "text": "Taking part in promoting education for the children belonging to destitute families.\n• Making people aware of the rights, duties and responsibilities as an individual, a villager, a citizen.\n• Providing preventive, promotive and curative health care services for the people in general and women and children in specific.\n• Empowering the rural women through microfinance and Self Help Group(PAPERKRAFT).\n• Imparting vocational training for rural youth with a view to making them self – supportive and acquiring skill suited to their needs.\n• To give emphasize on food security of the community as well as right to safe drinking water and healthy sanitation.\n• To provide support to the vulnerable person materially and emotionally.\n• To initiate an appropriate early childhood development and rehabilitation of the children with disabilities including older persons.\n• Development of micro – level infra structural facilities.\n• Promotion of local resources to function as self-sustaining development units.\n• Integration of crop cultivation, agri – horticulture, agro – forestry, livestock rearing and fish culture and increase their production.\n• Building confidence among the target groups to create their own resources and recycle those in sequential manner for sustainability.\n• Eradication of Child Labour", "page": "Gopali Youth Welfare Society"}, {"chunk_id": "62270b86", "title": "Media Recognition", "text": "GYWS is being recognized by various media and prominent personalities for the noble work done by the group. Following are the testimonials for the organization in recent past -\n• IITians run school to bridge social divide - The Times Of India [ 2 ]\n• IITians take education beyond Hallowed Campus - The Telegraph [ 3 ]\n• Dainik Bhaskar [ 4 ]\n• Pratidin [ 5 ]\n• Appreciation from Mr. Roy Da Silva, President of IIT Foundation [ 6 ]", "page": "Gopali Youth Welfare Society"}, {"chunk_id": "67a3d4fb", "title": "References", "text": "↑ K.B.C. ↑ The Times of India ↑ The telegraph ↑ Dainik Bhaskar ↑ Pratidin ↑ Roy Da Silva, President of IIT Foundation\nAnnual report 13-14\nAudit report 13-14", "page": "Gopali Youth Welfare Society"}, {"chunk_id": "8660afed", "title": "External Links", "text": "Gopali Youth Welfare Society Official Website\nGopali Youth Welfare Society Facebook Page\nGopali Youth Welfare Society Linked Profile\nGopali Youth Welfare Society Google Plus Profile\nGopali Youth Welfare Society Twitter Handle\nGopali Youth Welfare Society Youtube channel", "page": "Gopali Youth Welfare Society"}]