[{"chunk_id": "a6f6f023", "title": "International Relations Cell", "text": "Students' International Relations Cell is formed under Dean of International Relations, with the aim of assisting the Office of International Relations in facilitating the development and management of a variety of partnerships, linkages and networks with institutions of academic excellence and repute all over the world. It is dedicated to formulate and implement proposals for creating opportunities for international exchange of students as well as academic staff with high quality institutions and to discover better means of collaboration with international institutions. This shall be fostered through the process of internationalization of the institute while keeping in tandem with its vision and mission and with the premier objective of providing direct benefit to its students and faculty members. The International Relations Cell is a voluntary non-profit organization: more than any material incentive, there is a spirit of team-work, the enthusiasm of being a part of an institute body and an insight into the day-to-day world, which the members of the International Relations Cell will always cherish and preserve.", "page": "International Relations Cell"}, {"chunk_id": "dba602ca", "title": "History", "text": "The charter of Students' International Relations Cell (SIRC) was originally adopted and enacted on 01 October, 2015 and was approved by Dean of International Relations and Dean of Undergraduate Studies. Following this, the flagship programs of SIR Cell, namely, Semester Away Program (SAP) and Foreign Training Program (FTP) was started in the academic session 2016-2017.", "page": "International Relations Cell"}, {"chunk_id": "ec60e477", "title": "Objectives", "text": "The objective of the International Relations Cell is to assist the Institute and the Office of IR in the following ways:\n• Development of activities and partnerships which are sustainable by improving academic and research relations between the institute and its key international partners.\n• Increasing students exchange opportunities by facilitating research partnerships which have intellectual value and impact and hence promoting our research globally.\n• To promote relationships between foreign universities and the Institute and to help define the scope of such relationships through appropriate MoUs.\n• To interface with other internal entities to facilitate the visits of delegations and students coming to the institute.\n• To act as an interface between the office of IR and the undergraduate students of the Institute.", "page": "International Relations Cell"}, {"chunk_id": "6e5a01bd", "title": "Responsibilities", "text": "The responsibilities of the SIR CELL as prescribed by the Office of International Relations, IIT Kharagpur are as follows:\n• To assist the Office of International Relations, IIT Kharagpur in improving our global rank and reputation among international audiences\n• To assist the Office(IR) in promoting our research globally and enhancing knowledge transfer opportunities through international engagements and collaborations.\n• To assist the Office (IR) in developing international programs in a way that deems fit and beneficial for our students, staff, and partners with the support of Institute’s faculties, schools and departments.", "page": "International Relations Cell"}, {"chunk_id": "ec086a4b", "title": "Organizational Structure", "text": "The International Relations Cell shall comprise of the following, in order of hierarchy:\n• Chief Patron : The Director, IIT Kharagpur shall be the chief patron of the Students' International Relations Cell.\n• Honorable Chairperson : The Dean of International Relations, IIT Kharagpur shall be the honorable Chairperson of the Students' International Relations Cell.\n• Consulting Supervisor: The Vice President, Technology Students’ Gymkhana, IIT Kharagpur shall be the consulting supervisor of the International Relations Cell.\n• Advisory Committee: The Advisory Committee shall act as the advisory body for the incumbent Executive Committee. Every Executive Committee Member, on completing his/her tenure in the Executive Committee, assumes the post of an Advisor. The tenure of the advisor may be a maximum of two academic years as per institute regulations.\n• Executive Committee: The Executive Committee shall be responsible for the initiatives and activities of the International Relations Cell. The Executive Committee shall be accountable to the Chief Patron, the Chairperson and the Advisory Committee. General Secretary : There shall be two General Secretaries of the Students' International Relations Cell. He/ She shall have been associated with the SIR CELL for a minimum of one academic year and having undergone at least two year of education in the Institute. Coordinator: He/ She shall have been associated with the SIR CELL for a minimum of one academic year and having undergone at least two year of education in the Institute. Student Member: He/ She shall have completed at least one year of study in the institute.", "page": "International Relations Cell"}, {"chunk_id": "69e8d23f", "title": "Activities", "text": "SIRC works in tandem with the staff and faculty members associated with the International Relations Office on the development and management of a variety of international partnerships, linkages and networks. They are effective in identifying international research and internship programs; student exchange programs; and foreign training programs.\n• Reciprocal Student Exchange Programme\n• Foreign Training Programme\n• International Faculty Newsletter\n• FT Seminar\n• MS PhD Seminar\n• FT Blog Series\n• Global Leadership Series\n• Institute Lecture Series\n• Organisation of Hult Prize, IIT Kharagpur\n• Organisation of Dyuti", "page": "International Relations Cell"}, {"chunk_id": "8056287d", "title": "List of G.Secs", "text": "Year\n2021-22 | Kamal Kyal (CE) | Mansi Uniyal (EE)\n2020-21 | Rishabh Srivastava (ME '22) | Sankalp Srivastava (EE '22)\n2019-20 | Parth Gupta (HS '22) | Annanya Singh (AE '21)\n2018-19 | Ritik Chachan (IE '20) | Manthan Doshi (MT '21)\n2017-18 | Shubham Srivastava (PH '20) | Raj Kolamuri (ME '19)\n2016-17 | Asish Koruprolu (EC '18) | Bhanu Gupta (NA '19)", "page": "International Relations Cell"}, {"chunk_id": "f3cd93c2", "title": "Achievements", "text": "We are working towards innovation. We feed on ideas and turn them into reality at the Institute level. Taking new initiatives and working on every individual’s idea is something that makes us unique.\nPaths trodden to internationalize our institute:\nInternational Semester Exchange Program : Exchange of students between IIT Kharagpur and foreign institutes for a semester or two to have an enriching experience of studying in a foreign university while paying the fees of their respective host institutes.\nForeign Training Portal: Launch of a unique portal facilitating the process of getting foreign internships.\nNewsletter: The International Relations Cell Newsletter is an initiative to summarize all the open International Scholarships and competitions along with Indo-X Grants that are available for professors.\nThere are a lot of other exciting proposals we are working on to improve IIT KGP's stand on the international front.", "page": "International Relations Cell"}, {"chunk_id": "54fc8a38", "title": "External links", "text": "• IIT Kharagpur", "page": "International Relations Cell"}]