[{"chunk_id": "c8087cca", "title": "Kharagpur Linux Users Group", "text": "Kharagpur Linux Users Group is a informal discussion group for people who are enthusiastic about software development, technology and open source in general. KLUG meetings are traditionally held on Fridays at Insti Foyer or BC Roy Hall 's canteen.", "page": "Kharagpur Linux Users Group"}, {"chunk_id": "4418e8c2", "title": "History", "text": "The earliest known Linux Users Group at KGP was started back in 2004, [ 1 ] though a thread on their Yahoo group suggests that there used be a LUG even before 2004. [ 2 ] They held few informal meetings and a install fest. [ 3 ] The group, however, died out by the end of academic year in 2007. [ 4 ] Ramkumar Ramachandra mentioned about another Linux Users group which used to exist between 2006 and 2008. [ 5 ] KGP: KGP Group of Programmers (a recursive acronym) which came up in 2009 [ 6 ] [ 7 ] was also an attempt to build a programmer's community in KGP that group too died out. The current form of KLUG was formed by Ramkumar Ramachandra (PH '12), Sanjoy Das (MA '13) and Anurag Priyam (ME '13) in 2011.", "page": "Kharagpur Linux Users Group"}, {"chunk_id": "95fe4c03", "title": "Structure and Functioning", "text": "The discussion at KLUG typically do not have a fixed agenda. People start off by discussing different projects they have been working on but often conversations diverge to very diverse topics including anything from history, privacy and copyright laws, economics to philosophy. KLUG follows a flat hierarchy and an system of open membership. Open membership implies that anyone is free and welcomed to attend the discussion. New members are usually asked to introduce themselves to the group.\nImportant minutes of the meetings or meetup notices are posted to the KLUG's google group , which is open for anyone are join. KLUG has recently moved to slack channel for real time communication and hangout in place of IRC channel #klug-devel on freenode. A public log of all the communication on previous channel can be found here .\nPeople interested in joining KLUG's slack channel use the self invite link http://klug-slack.herokuapp.com/.", "page": "Kharagpur Linux Users Group"}, {"chunk_id": "210ea977", "title": "References", "text": "↑ \"Announcement of LUG@IITKGP\" . Retrieved 17 September 2015 . ↑ \"Why don't we have a LUG at KGP?\" . Retrieved 17 September 2015 . ↑ \"Summary of the workshop\" . Retrieved 17 September 2015 . ↑ \"Messing History\" . Retrieved 17 September 2015 . ↑ \"Ram's answer on \"Why isn't there any Programming Club in KGP? \" \" . Retrieved 17 September 2015 . ↑ \"Sanket Agarwa's Blog about KGP\" . Retrieved 17 September 2015 . ↑ \"KGP-Django-website\" . Retrieved 17 September 2015 .", "page": "Kharagpur Linux Users Group"}]