[{"chunk_id": "0e8e9a56", "title": "Science Education Group", "text": "We surely feel proud when we enter IIT Kharagpur campus and look at the main building where it is written: Dedicated to the service of the nation. Indeed, there has been tremendous progress in the development of science and technology and IIT Kharagpur has remained devoted in this regard from its very inception. The world has reached to a point where people plan for ‘space travel’ or ‘Mars mission’. Today, medical science has developed so much that it can cure almost all diseases. The revolution in the field of information technology during the last couple of decades is easily noticeable. IIT Kharagpur is now recognized globally for serving all these fields.\nHowever, this has been only one face of development. While we live with all the comforts in the 2,100 acres campus of IIT Kharagpur, millions of people of India are struggling everyday to make their both ends meet. The recent NSSO data shows that 670 million Indians in rural areas live on Rs 33 per day. Unequal distribution of wealth has become more and more prominent with the fact that 10% of the population holds three quarters of India's wealth and 1% holds half of it. While the employment growth slowed to 0.3%, the slowest in four years, employment growth in the manufacturing companies plunged to (-)5.2% in 2014-15 from 3.2% in 2013-14. The news of farmer suicide is haunting us almost everyday. The society has remained trapped inside poverty, unemployment, corruption, caste oppression, violence against women, communal disturbances and so many. Surely, there has been a huge gap in the development of science and technology and its service to the society.\nWith all these odds and with the concern for the society, the Science Education Group (SEG) was formed by the students of IIT Kharagpur in early 1980's. SEG involved itself in searching different dimensions connecting science and society. It actively took part in theoretical discussions and social practices to do justice to its quest for social and scientific knowledge. The group functioned till early 1990's. However, their rich experiences and the present time have inspired a group of students and professors to carry forward the banner of SEG. We believe that this campus acts as a sanctuary with all sorts of privileges and keeps us disconnected from the issues that affect the vast masses of people in India. Since, we proudly state that we are “dedicated to the service of the nation”, SEG thinks that it is our responsibility towards our nation to question and analyze the status quo to better serve the society. As written by Bhagat Singh “Any man who stands for progress has to criticize, disbelieve and challenge every item of the old faith”, SEG would like to act as a platform to study various scientific and social issues by holding sessions for discussions and debates. Objectives of SEG can be listed as follows:\n• Hold sessions for discussions and debates on various scientific and social issues.\n• Study, discuss and debate the thoughts of Bhagat Singh, Ambedkar and other progressive thinkers.\n• Conduct various social welfare programs inside the campus or in nearby villages.", "page": "Science Education Group"}]