[{"chunk_id": "e6e9bd9e", "title": "Overview", "text": "SHARE is an innovative, student-led organization that bridges academic knowledge with real-world consulting to generate meaningful impact. It empowers high-potential university students with practical skills, preparing them to become socially responsible, results-driven leaders who add value to both businesses and society. With a proven track record in international case competitions and hands-on experience across diverse sectors including technology, consulting, and sustainable development SHARE’s teams consistently deliver creative, effective, and actionable strategies that transcend conventional solutions.", "page": "ShARE"}, {"chunk_id": "0eac7c53", "title": "Services", "text": "SHARE offers a comprehensive range of services, including the development of strategies for market entry, geographic expansion, and the identification of new market opportunities. The team conducts in-depth analysis of market trends and customer insights to design pricing strategies aligned with product value propositions. Additionally, SHARE supports clients by creating business plans, identifying potential investors, and crafting compelling pitch presentations. Their expertise also extends to data analytics, insight generation, and delivering tailored recommendation plans.", "page": "ShARE"}, {"chunk_id": "ba54fd6a", "title": "Selections", "text": "SHARE conducts its recruitment process at the beginning of the autumn semester, which includes a group discussion followed by a personal interview. Candidates are evaluated not on their prior knowledge of consulting, strategy, or market research, but on their ability to think critically, approach problems logically, and communicate ideas clearly and coherently.\nThe evaluation emphasizes structured thinking, analytical problem-solving, and a strong sense of commitment. SHARE seeks individuals who can manage their time effectively and demonstrate a high level of professionalism within the team.", "page": "ShARE"}, {"chunk_id": "1adb50f9", "title": "Learning Culture", "text": "At SHARE, the primary mode of learning for first-year students is through knowledge meetings, where senior members lead sessions to introduce and explain essential consulting functions such as market research, strategy development, pricing analysis, and data-driven decision-making. These sessions not only facilitate learning but also foster active discussions and strengthen relationships between peers and senior members.\nSHARE further enhances experiential learning through intra-team competitions specifically designed for first-year students. These include a traditional case study challenge, an equity research report, and a distinctive event called Bid to Pitch . In Bid to Pitch , participants begin by conceptualizing a startup idea and delivering a brief pitch to their peers. After the pitches, teams bid on the ideas they find most promising, effectively \"purchasing\" one to develop further. They then transform the chosen concept into a comprehensive, real-world business plan and deliver a final presentation that simulates an actual product or company launch. These initiatives are crafted to cultivate creativity, strategic thinking, and collaboration in a dynamic, hands-on environment.", "page": "ShARE"}, {"chunk_id": "8e7f86c3", "title": "Events", "text": "• Case Study Competition : To develop critical thinking and business acumen, first-year students examine and offer strategic answers to real-world problems that businesses face.\n• Bid to Pitch : In order to foster entrepreneurial thinking and valuation skills, participants bid on startup ideas and pitch business models, simulating investment decisions.\n• Equity Research Report : Students gain experience with financial analysis and stock evaluation by creating expert-caliber equity research reports on publicly traded companies.", "page": "ShARE"}, {"chunk_id": "7d63beb8", "title": "Organizational Hierarchy", "text": "• Advisors are the senior-most members of SHARE, typically in their fourth or fifth year. They draw upon their extensive experience to provide strategic guidance and help shape the overall direction of the organization.\n• Presidents are third-year students who lead and manage key projects across SHARE, ensuring that all initiatives are aligned with the organization’s goals and vision.\n• Managers , in their second year, are responsible for executing project portfolios and overseeing daily operations. They also play a crucial role in coordinating knowledge meetings and organizing internal competitions.\n• Associates are first-year students who support project work assigned by senior team members. Through their involvement, they gain hands-on experience and develop foundational skills essential to consulting and strategic problem-solving.", "page": "ShARE"}, {"chunk_id": "c9f0edd1", "title": "Presidents (2024-2025)", "text": "• Kunal Patil\n• Sumanth Javvaji\n• Gaurav Sharma\n• Saurabh Chavan", "page": "ShARE"}, {"chunk_id": "511447d5", "title": "Presidents (2025-2026)", "text": "• Aarya Majali\n• Parth Khose\n• Reyansh Jain\n• Sarthak Yadav\n• Subhayu Paul", "page": "ShARE"}, {"chunk_id": "2e7cfcbe", "title": "Work", "text": "SHARE undertakes a diverse range of consulting-focused projects that highlight the organization’s core strengths in strategic thinking and problem-solving. These projects typically involve market research, competitor analysis, business model development, pricing strategies, and go-to-market planning. In alignment with SHARE’s broader service offerings, projects may also include crafting strategies for market entry or geographic expansion, analyzing customer insights to optimize pricing, developing investor-ready pitch decks, and conducting data-driven analysis to generate actionable recommendations.\nThrough collaborations with startups, companies, and other external partners, SHARE delivers high-impact, practical solutions while providing its members with valuable, real-world consulting experience.\nPast collaborations have spanned various industries and include organizations such as:\n• Vivaldis\n• Money Club\n• Incubate Funds\n• Runway\n• Gram Vikas Trust\n• Bosch-SDEX\n• Fluxgen\n• Culture OS\n• Amazon-Smartbiz\n• Trezix\n• CineStox", "page": "ShARE"}, {"chunk_id": "afb14385", "title": "References", "text": "https://share-iitkgp.com/home\nhttps://www.linkedin.com/company/share-iit-kharagpur/\nhttps://www.instagram.com/share_iitkgp?igsh=MWVvNHF0aHl0bmZnaQ==", "page": "ShARE"}]