[{"chunk_id": "info_f35fd6", "title": "Space Technology Students%27 Society - Quick Facts", "text": "Founded | 2008 ( 2008 )\nFounder(s) | Mayur Maheshwari [ unverified ]\nNumber of members | 45\nWebsite | www .facebook .com /spAts .iitkgp /\nUnder TSG | No", "page": "Space Technology Students%27 Society"}, {"chunk_id": "8b1fad33", "title": "Space Technology Students%27 Society", "text": "Kalpana Chawla Space Technology Cell, IIT Kharagpur\nSpace Technology Student Society (spAts) is a student initiative that functions as the student body of Kalpana Chawla Space Technology Cell (KCSTC), the contact point of Indian Space Research Organisation (ISRO) at IIT Kharagpur. It organises the annual Space Technology and Astronomy themed fest, National Students' Space Challenge [ 1 ] (NSSC) every year since 2011. spAts ignites a passion for space exploration at IIT Kharagpur by organizing talks, discussions, stargazing sessions, lectures, and presentations.\nThe group publishes a bi- semester newsletter, ' The Moonwalk ', which features on latest ventures in space technology and astronomy related articles and developments. [ 2 ]", "page": "Space Technology Students%27 Society"}, {"chunk_id": "4c1bfd78", "title": "History", "text": "The Space Technology Students' Society was founded way back in 2008 by a group of students extremely enthusiastic about the frontiers of space technology. It was formed as an official student body under the Kalpana Chawla Space Technology Cell (KCSTC). Since then, the society has grown in size and activities. The idea of a national level space-oriented fest was conceived and thus implemented as the National Students' Space Challenge (NSSC) in the year 2011. NSSC has been successfully organised for twelve more editions since then.\nA subgroup of spAts, the FQTQ team which is a dedicated Astronomy discussion group was formed in 2016 under the guidance of Siddhant Singh.", "page": "Space Technology Students%27 Society"}, {"chunk_id": "4379cf95", "title": "Functioning", "text": "The student body of spAts is divided into two subgroups - the core teams consisting of Design team, Tech team and Management team (which is more concerned with management and outreach) and the FQTQ team (which is more based on Astronomical discussions and applications). spAts organises sky-gazing sessions, space-themed discussions and talks, webinars, lectures, presentations and publishes the bi-semester newsletter, \"the moonwalk\" for the people in the IIT Kharagpur community. The teams also organise the National Students' Space Challenge during the months of September-October.", "page": "Space Technology Students%27 Society"}, {"chunk_id": "a3d4b850", "title": "Selection Procedure", "text": "spAts organises its selections during late August, once per year that is aimed only for the newly joining freshers for a continued membership till the end of the members' tenure. spAts organises an introductory seminar before the selections, where the functioning of the society as well as about NSSC is presented.\nThe interested candidates join as Junior Coordinators (JCoords) who conduct the NSSC. For the JCoord team, the candidate's technological, management, communication skills etc. are considered.\nLater, selections for joining the spAts team happen, where interested candidates select one portfolio from the FQTQ team, Design team, Tech team and Management team where emphasis is given on prior knowledge in the specific portfolio, presentation skills, previous experience with the concerned technologies and knowledge in the fields of Astronomy and Astrophysics. Selections are done in three rounds, an initial interview, a task round and a final interview where the task submissions are reviewed.", "page": "Space Technology Students%27 Society"}, {"chunk_id": "19a031cc", "title": "Organisational Structure", "text": "spAts is mainly comprised of its two subgroups - the Core teams and the FQTQ team. Each subgroup have their own undertaking tasks but mainly the whole team collectively organises the NSSC fest.", "page": "Space Technology Students%27 Society"}, {"chunk_id": "8a4f5a0f", "title": "Core teams", "text": "These teams are mainly responsible for Management, Outreach, Communication, Publicity, Sponsor handling, Design, Web Design and Finance for the fest and the other activities spAts organises. The core teams consist of the Design team, the Tech team and the Management team", "page": "Space Technology Students%27 Society"}, {"chunk_id": "25a53367", "title": "FQTQ team", "text": "FQTQ stands for From Quarks to Quasars, which describes the team more oriented to astrophysics in general. They hold periodic discussions and presentations on various topics along with sky-gazing events, open talks, webinars and content development.", "page": "Space Technology Students%27 Society"}, {"chunk_id": "375fa1c4", "title": "NSSC", "text": "Conducting the fest remains a major task for the whole spAts team. The team structure is as follows -\n• 5th and the 4th years comprise the Steering Committee (SCom)\n• 3rd Years are the Heads\n• 2nd Years function as Sub-Heads for the various events\n• First Years contribute as Junior Coordinators (JCoords) for the fest", "page": "Space Technology Students%27 Society"}, {"chunk_id": "c3557f42", "title": "List of Activities", "text": "spAts organizes a lot of activities within the campus, as mentioned below.", "page": "Space Technology Students%27 Society"}, {"chunk_id": "1335d30b", "title": "Induction Workshop", "text": "The spAts team interacts with the new coming Freshers batch during the Induction Programme through a series of presentations and workshops. In 2018, presentation on the life cycle of stars, the ever endless universe; and hand-on experience through water rocket lift-off workshop was conducted. The workshop received a positive response from the participants.", "page": "Space Technology Students%27 Society"}, {"chunk_id": "af083732", "title": "National Students' Space Challenge", "text": "The National Students' Space Challenge , abbreviated as NSSC , is an annual space-themed fest organised in the month of September-October since the year 2011. It is India's first and the largest space technology and Astronomy themed fest. The whole spAts team is indulged in organizing the fest.\nFor more details find it on - NSSC", "page": "Space Technology Students%27 Society"}, {"chunk_id": "4f11a8d8", "title": "Sky-Gazing Sessions", "text": "spAts also works to popularize astronomy among the people in the KGP community. Hence it organizes sky-gazing sessions every semester and also to cover exciting astronomical events, like the super blood red moon 30th January, 2017.", "page": "Space Technology Students%27 Society"}, {"chunk_id": "db9babc5", "title": "Space Month", "text": "Every Year spAts observes the month of March as Space Month, where a series of open discussions, webinars quiz or presentations are held. This space month primarily aimed to bring and contribute towards recent developments in space technology.", "page": "Space Technology Students%27 Society"}, {"chunk_id": "b57e9973", "title": "The Moonwalk", "text": "The Moonwalk is a bi-semester newsletter brought by the spAts team. It includes articles written on several astrophysical ideas, new perspectives arising in space and planetary sciences, recent developments in the field, contributions by eminent scientists over the world and discoveries.", "page": "Space Technology Students%27 Society"}, {"chunk_id": "5f795a66", "title": "Awards and Achievements", "text": "Competition | Venue | About | Year | Position\nAstro Quiz, Supernova, TechNex | IIT (BHU) Varanasi | Team name - \"TheKGPCrux\" | 2019 | GOLD\nExploring the Interstellar, Supernova, TechNex | IIT (BHU) Varanasi | Observational astronomy based event | 2019 | SILVER\nScientists of Utopia, Supernova, TechNex | IIT (BHU) Varanasi | Case study event | 2019 | SILVER\nScientists of Utopia, Supernova, TechNex | IIT (BHU) Varanasi (Online) | Case study event | 2021 | GOLD\nAstro Quiz, Supernova, TechNex | IIT (BHU) Varanasi (Online) | Space Quiz Event | 2021 | GOLD\nInternational Astronomy and Astrophysics Competition | Online | Eeshaan Sethia (Subhead) - International Runner Up | 2022 | National Topper", "page": "Space Technology Students%27 Society"}, {"chunk_id": "23c6b97f", "title": "References", "text": "↑ NSSC ↑ \"Reaching for the stars\" . The Statesman. 9 August 2013 . Retrieved 9 August 2013 .", "page": "Space Technology Students%27 Society"}]