[{"chunk_id": "info_13b134", "title": "Student Welfare Group - Quick Facts", "text": "File:KgpSWG logo.jpg\nFounded | 2011 ( 2011 )\nFounder(s) | Anmol Chopra, Rahul Agrawal\nNumber of members | 30\nWebsite | swgiitkgp .org\nContact | +91 8016761358 (Akash Verma) +91 9126147522 (Amit Anand) +91 8436241925 (Nikhil Kedia) +91 9564365113 (Sourav Basu)\nUnder TSG | YES", "page": "Student Welfare Group"}, {"chunk_id": "8f9827ba", "title": "Student Welfare Group", "text": "The Student Welfare Group (SWG) is a student body under the office of the Dean of Students’ Affairs, IIT Kharagpur .\nIt strives to be with those who need help and promises to sweat for the realization and solutions of issues faced by our fellow mates. It is an organization of the students, for the students, by the students. It functions as two teams:\n• The Central Team\n• The Hall Coordinators Team", "page": "Student Welfare Group"}, {"chunk_id": "0f13fb84", "title": "History", "text": "The Counselling Centre was set up in 2009 by the Dean Of Students′ Affairs, IIT Kharagpur as an outcome of his efforts to make the campus a better campus for the entire student community.\nIt provided the students a place where they could easily approach with a problem and leave with a solution. The reach of the Counselling Centre was further extended through the Hall Coordinators Team. However, the increasing strength of students in the campus called for active participation from the students themselves in this cause. This was the scenario which saw the establishment of the Student Welfare Group in August 2011.\nStudent Welfare Group was initially an idea that evolved out of a feeling to perpetuate and nurture a campus life which is hassle-free. Today, it is a dedicated group of students willing to sort out various issues of concern for the students. It plans to emerge as a more successful organization with more activities managed and implemented for the welfare of students.", "page": "Student Welfare Group"}, {"chunk_id": "3815d5d9", "title": "Vision", "text": "The aim of SWG is to ensure that every student's life in KGP is hassle free so that they can achieve their potential zenith while their stay in KGP as well as in their professional career. SWG aims to instil a belief in every student that they can achieve all their goals in life. SWG assists students in resolving their difficulties in every field, be it academic or extra-academic & curricular or co-curricular. It aims to create and sustain an environment that promotes personal growth and discovery, the pursuit of healthy minds and bodies, and participation in the creation of a caring community.", "page": "Student Welfare Group"}, {"chunk_id": "03cadfac", "title": "Student Mentorship Programme", "text": "This programme involves the guidance and mentorship of every single first year student by a 3rd or 4th year student of the same department. The objective of this programme is to help the first years understand the various aspects of college life, and adapt accordingly. This programme ensures that the hindsight of the Mentor becomes the foresight of the Mentee. The Mentees can benefit immensely from the insight of the Mentor and find the best possible way to utilize their time in the campus. The Student Mentor Programme provides scope for constructive and productive interaction between the freshmen and the experienced seniors, which forms an integral part of college life.", "page": "Student Welfare Group"}, {"chunk_id": "b04fda96", "title": "PDS Doubt Sessions", "text": "An interactive session organized by the SWG for those who feel like they are lagging behind in the course because of no prior knowledge. Programming and Data Structures is an important course of the first year curricula. The instructors are senior students of the institute who try to increase the problem tackling capability of the students, starting from the very basic level and build up their confidence to face the competition. In Friday’s sessions, tutorial sheets are provided to the students and the tutors help them to solve the questions by clearing the doubts of each and every student. In Sunday’s sessions, students are supposed to come with their laptops and they are given a set of programming questions like the ones given in PDS Laboratory classes. The tutors help the students in coding, compiling and running their programs. At the end of the sessions, the instructors also provide printed solution of the tutorial sheet to the students.", "page": "Student Welfare Group"}, {"chunk_id": "643be15f", "title": "GD/PI Sessions", "text": "Student Welfare Group in association with Smart Training Institute, a renowned organization for grooming and perfecting soft skills , presents an opportunity to boost students' performance at group discussions and personal interviews just as the season for internships and placements begins. The workshop has been a success in the past with most of the students giving positive feedback. Since the collaboration with the private institute is in its early phase, there is a lot of room and scope in future. Taking into consideration the feedback, the SWG aims to provide better workshops in the following sessions.", "page": "Student Welfare Group"}, {"chunk_id": "8437b93e", "title": "Panel Discussion (Wings Of Fire)", "text": "Student Welfare Group organised a Panel Discussion by the batch of 2010-11. It invited students to open up to the valuable experience shared by the panelists in a discussion encompassing every facet of KGP life, including academics, extracurriculars, sports, societies and PORs. This discussion was very helpful for freshers who had just joined the institute. Panelists shared their vast experience of 4-5 years in KGP. Apart from freshers, a large number of 2nd and 3rd year students also gathered for this panel discussion.", "page": "Student Welfare Group"}, {"chunk_id": "70718a35", "title": "ForeSight", "text": "SWG presents ForeSight , a program which provides the campus students a unique interface to connect with the people who have mastered their field and hence get a foresight of their future. It will cover various career related dimensions (placements, internships, FTs, competitions) from the students of the campus as well as alumni of the institute.", "page": "Student Welfare Group"}, {"chunk_id": "f1093ba4", "title": "The Campus Tour", "text": "A campus ride is being organized to acquaint freshers about the important places of the campus that a student needs to know. It begins from Technology Students' Gymkhana, IIT Kharagpur (TSG). In 2015, more than 1200 freshers in 28 separate buses were shown the magnificence of the KGP campus with engaging interactions of SWG team with freshers.", "page": "Student Welfare Group"}, {"chunk_id": "5566f765", "title": "Information Brochure- A Walk Through", "text": "For the first time in the history of our campus, printed version of Institute Information Brochure was circulated among all the freshers, thanks to the rigorous efforts of the SWG team and support of the administration. We hope it has helped the freshers batch a lot in their initial days here at KGP.\nISSUE [ 1 ]", "page": "Student Welfare Group"}, {"chunk_id": "93900463", "title": "Electrical/Mechanics Doubt Sessions", "text": "Student Welfare Group is proud to announce Electrical and Mechanics Doubt Sessions for the first year UG students with the help of the Vice President, TSG and the faculty of Electrical Technology and Mechanics. The schedule of the doubt sessions is as follows:\nEvery Saturday starting from 29th August, 2015.", "page": "Student Welfare Group"}, {"chunk_id": "eb2519d9", "title": "Hall Coordinators Programme", "text": "Student Welfare Group conducts the Hall Coordinators Programme with the help of Hall Coordinators' Team that would work directly with the Counselling Centre for the overall well-being of the fellow peers and thus ensure 'A Hassle-free Kgp Life' !", "page": "Student Welfare Group"}, {"chunk_id": "28f9a660", "title": "KGP Blood Connect", "text": "Kharagpur Blood Connect, an initiative of Student Welfare Group (SWG) IIT Kharagpur and Gopali Youth Welfare Society, established to serve the same purpose, is always there to help you in making your contribution, as \"To the young and healthy it’s no loss. To sick it’s hope of life. Donate Blood to give back life.\" It is an endeavour of ensuring that no one on campus struggles to find a blood donor in times of need!", "page": "Student Welfare Group"}, {"chunk_id": "4706ad2f", "title": "Public Speaking Forum", "text": "SWG has come with Public Speaking Forum , a platform which'll make you aptly equipped to fight the fear of Public Speaking. This is an 8 session long program. The initiative mainly concentrates on the individuals with a basic knowledge of English language however speaking on a public platform bothers them which can prove to be a hindrance in realizing their future endeavors.", "page": "Student Welfare Group"}, {"chunk_id": "d55073fe", "title": "2024 - 25", "text": "• Advisors Anish Behuray Jainish Solanki Khushi Agrawal Priyanshi Khetan Shubham Singh Yash Kumar JSR Sujit Nikhitha Sapharu\n• Executive Heads Shashank Tiwari Astha Kumari\n• Heads Akshat Kapoor Shravan Barad Bhawesh Kukreja Vumika Ghosh Shivam Bisen Astitva Srivastava", "page": "Student Welfare Group"}, {"chunk_id": "705e4351", "title": "2023 - 24", "text": "• Advisors Rithick Prabakar Dhruv Rathi Bishal Kumar Behera Aditi Ujjain Lalam Hari Prasad Md Zaid Alam Pratik Choudhury Sneha Majumder Keval Mehta Himadri Pandya Abhishek\n• Executive Heads JSR Sujit Nikhitha Sapharu\n• Heads Anish Behuray Jainish Solanki Khushi Agrawal Priyanshi Khetan Shubham Singh Yash Kumar", "page": "Student Welfare Group"}, {"chunk_id": "43845635", "title": "2022-23", "text": "• Advisors Devesh Gobind Tanaya Ramane Swagat Kumar Panda Sreeya Chillapuri Waqaar Hussain Awais Akhtar Sri Harika Reddy Yathartha Soneji Vedant Vani Jeripothula Sindhu Bhosale Shivam Pravin\n• Executive Heads Himadri Pandya Abhishek\n• Heads Rithick Prabakar Dhruv Rathi Bishal Kumar Behera Aditi Ujjain Lalam Hari Prasad Keval Mehta Md Zaid Alam Pratik Choudhury Sneha Majumder", "page": "Student Welfare Group"}, {"chunk_id": "88dcccca", "title": "2021-22", "text": "• Advisors Kunal Das Lavish Singhal Tapasya Pratap Singh Devang Upadhyaya Aditi Singhania Nikhil Kumar Animesh Jha Prachi Kharparde Akash Dusane\n• Executive Heads Jeripothula Sindhu Bhosale Shivam Pravin\n• Heads Devesh Gobind Tanaya Ramane Swagat Kumar Panda Sreeya Chillapuri Waqaar Hussain Awais Akhtar Sri Harika Reddy Yathartha Soneji Vedant Vani", "page": "Student Welfare Group"}, {"chunk_id": "f8be7f58", "title": "2019-20", "text": "• Governors Akshat Jain Anju Joon Lakshya Agrawal Nishchal Baghele\n• Advisors Rajat Goel\n• Heads Anshul Agarwal Kunal Das Lavish Singhal Mrityunjay Mehta Ritam Talukder Shivam Bhatia Tapasya Pratap Singh", "page": "Student Welfare Group"}, {"chunk_id": "d528a844", "title": "2018-19", "text": "• Governors Utkarsh Kumar Pushpendra Singh Rathore Priyang Mani Tripathi Aamol Lohani\n• Advisors Dileep Shukla TYSS Santosh Saurabh Chandra Pandey\n• Heads Rajat Goel Prateek Manikpuri Akshat Jain Anju Joon Lakshya Agrawal Nishchal Baghele Rajdeep Singh Yograj Sirohi", "page": "Student Welfare Group"}, {"chunk_id": "4a666ced", "title": "2017-18", "text": "• Governors Nihal Gupta Vaibhav Agrawal Raju Bhakar\n• Advisors Shashwat Mishra Prasanna Dange\n• Heads Utkarsh Kumar Pushpendra Singh Rathore Aamol Lohani Dileep Shukla Priyang Mani Tripathi TYSS Santosh Saurabh Chandra Pandey", "page": "Student Welfare Group"}, {"chunk_id": "3886b3c5", "title": "2016-17", "text": "• Governors Amey Muley Akash Khandelwal Karan Gupta\n• Advisors Tushar Gupta Ashutosh Yadav Manoj Meena Siddhant Jain Sanket Modi\n• Heads Raju Bhakar Prasanna Dange Ankur Ankit Surendra Puri Shashwat Mishra Nihal Gupta Vaibhav Agrawal Zain Ahmad Veda Vyshnavi Pranitha Sriramoju", "page": "Student Welfare Group"}, {"chunk_id": "07b803a0", "title": "2015-16", "text": "• Governors Akash Verma Amit Anand Nikhil Kedia Sourav Basu\n• Advisors Sheenal Chhabra Abhishek Chakraborty Nishant Agarwal Shankar Basava Uma Ravali Ankit Bansal Shyam Simaria\n• Heads Manoj Meena Prithvi Krishna Kunwarvir Singh Akash Khandelwal Chahak Tharani Ravina Moirangthem Ashutosh Yadav Tushar Gupta Karan Gupta Ishan Jain Siddhant Jain Sanket Modi Amey Muley", "page": "Student Welfare Group"}, {"chunk_id": "7513e9e2", "title": "2014-15", "text": "• Governors Abhishek Chaudhary Nishchay Dayal\n• Heads Akash Verma Amit Anand Nikhil Kedia Sourav Basu Sheenal Chhabra Abhishek Chakraborty Nishant Agarwal Shankar Basava Uma Ravali Ankit Bansal Shyam Simaria", "page": "Student Welfare Group"}, {"chunk_id": "58c98952", "title": "References", "text": "↑ http://issuu.com/studentwelfaregroup/docs/ug_information_brochure", "page": "Student Welfare Group"}, {"chunk_id": "239216cc", "title": "https://www.facebook.com/SWGIITKGP", "text": "https://play.google.com/store/apps/details?id=com.swg.swg_app&hl=en_IN&gl=US&pli=1\nhttps://medium.com/@swgiitkgp\nhttps://www.instagram.com/swg.iit_kgp/", "page": "Student Welfare Group"}]