[{"chunk_id": "eeeabed6", "title": "TeamTRAK", "text": "TeamTRAK is a pioneering group of enthusiastic students from IIT Kharagpur , united by a passion for railway engineering. Established under the aegis of the Centre for Railway Research(CRR), TeamTRAK aims to innovate and contribute to the modernization of Indian Railways. The group is dedicated to the development of highly efficient, low-cost, and sustainable railways using innovative solutions. It represents IIT Kharagpur in IMechE Railway Challenge .\nTeamTRAK Logo", "page": "TeamTRAK"}, {"chunk_id": "c3c665b4", "title": "History", "text": "The foundation of TeamTRAK was laid in December 2023 by six co-founders from various disciplines, with guidance from Prof. Vikranth Racherla. It is India's first student railway research group and represents a significant step towards enhancing railway research and innovation at the academic level. The team aligns its activities to participate in the IMechE Railway Challenge in the United Kingdom, a competition that tests the skills and innovations of students in railway engineering.", "page": "TeamTRAK"}, {"chunk_id": "18993837", "title": "IMechE Railway Challenge", "text": "The IMechE Railway Challenge is a prestigious international competition organized by the Institution of Mechanical Engineers. Held annually at the Stapleford Miniature Railway in the UK, the challenge invites teams from universities and industries worldwide to design and manufacture a miniature (10¼\" gauge) railway locomotive. The competition emphasizes practical skills in design, manufacturing, and project management, offering participants a comprehensive engineering experience.", "page": "TeamTRAK"}, {"chunk_id": "c6d0ad0b", "title": "Competition Details", "text": "• Location: Stapleford Miniature Railway, Leicestershire, UK\n• Dates: Each annual Challenge cycle kicks-off in October, ending with a final event in late June/early July of the following year.\n• Objective: Design and build a locomotive with self-contained motive power capable of continuous travel at 15 km/h satisfying given requirements.", "page": "TeamTRAK"}, {"chunk_id": "6854a8ce", "title": "Aryavart L1", "text": "Aryavart L1 is India's first student-designed miniature locomotive. This project adheres to the IMechE Railway Challenge specifications and showcases the following features:\n• Gauge: 10¼” inch\n• Power: All-electric battery-powered tractive system\n• Load Capacity: Up to 2 tonnes\n• Regenerative Braking: Efficiency upwards of 80%\n• Suspension: State-of-the-art primary and secondary systems\n• Body: Aerodynamically optimized with potential use of carbon fibre or fibre glass.", "page": "TeamTRAK"}, {"chunk_id": "06de6d30", "title": "Future Plans", "text": "TeamTRAK is committed to continuous innovation and has outlined several future projects, including:\n• Exploration of hydrogen-based powertrains\n• Overhead solar energy harvesting\n• Integration of magnetic levitation technology\n• Lightweight materials using alloys and composites\n• Advanced Suspension Systems\n• Development of High Efficiency converters", "page": "TeamTRAK"}, {"chunk_id": "25996bf3", "title": "Team Structure", "text": "The team consists of about 20 enthusiastic undergraduate students who dedicate over 35,000 man-hours to the project annually. They work under the supervision of faculty advisor Prof. Vikrant Rarchela, Professor, Department of Mechanical Engineering, and Prof-in-Charge, Centre for Railway Research(CRR), gaining hands-on experience in various aspects of railway engineering, including design, manufacturing, and project management.\nTeamTRAK Team", "page": "TeamTRAK"}, {"chunk_id": "88e1db9f", "title": "Subsystems", "text": "The team is organized into various subsystems to streamline their work:\n• Electrical\n• Mechanical\n• Media\n• Corporate & Public Relations (CPR)", "page": "TeamTRAK"}]