[{"chunk_id": "ee0875c9", "title": "Technology Dance Society", "text": "Breakfree : Technology Dance Society , abbreviated as TDS, is the official All-style Dance Crew of IIT Kharagpur. Since it's foundation in the year 2012, where it was recognized as an official part of Technology Students' Gymkhana, IIT Kharagpur , it has grown ahead in multiple dance forms like Locking, Popping, Breaking, House, Dancehall, Litefeet and Whacking. It participates in Street as well as Western Stage dance competitions across India. It also organizes workshops for western dance enthusiasts at IIT Kharagpur. The society exhibits creative contents through YouTube from time to time. However, the official announcements are passed on through the Instagram page.", "page": "Technology Dance Society"}, {"chunk_id": "851640c4", "title": "Joining the team", "text": "The auditions for TDS are conducted post a dance workshop session conducted inside the campus after the arrival of its new batch of freshers around the first week of august. The auditions are open for all students inside IIT Kharagpur. There is no restriction on dance style, age, course or study period of the student.", "page": "Technology Dance Society"}, {"chunk_id": "fe9f87b1", "title": "Selection Criteria", "text": "The participants of the auditions are asked to perform a one-minute piece of dance routine on their choice of song and dance style. They are also allowed to perform on the routine taught to them during the workshop. The dance performance can be original or inspired, but not exactly copied. There is no restriction to any dance forms. There may be a second round consisting of an impromptu performance of approximately 30 seconds. The participants are marked on the following :\n• Beat sense\n• Choreography\n• Energy\n• Interest\nThe auditions are known to be easy and every year, around 30 students are selected as new members of the society.", "page": "Technology Dance Society"}, {"chunk_id": "8a66f6a9", "title": "Timeline of Events", "text": "The society’s first showcase of the year takes place during the Freshers’ Induction Program in the last week of July, where members present an 8–10 minute group performance before the new students. Following the freshers’ selections, the next major event is the showcase performance on Institute Foundation Day on 18th August . This 10–15 minute performance marks the debut of the society’s new choreographers of the Governing Batch , comprising the third-year members and features all the dancers of the society, including the newly inducted ones.\nThe next major milestone is the Inter IIT Cultural Meet , held in December, followed by participation in Spring Fest (IIT Kharagpur) . Soon after comes the lively Holi Flashmob , where the entire Breakfree team reunites to perform in front of the crowd at Gymkhana.\nThe society also represents the institute at several prestigious outstation cultural festivals such as Antaragni (IIT Kanpur) and Carpe Diem (IIM Calcutta) . The year concludes with the Annual Junior Championship , where the junior members showcase everything they have learned throughout the year in an exciting dance competition.", "page": "Technology Dance Society"}, {"chunk_id": "46d1a38e", "title": "Practice Sessions", "text": "The members of the society meet almost everyday to jam and prepare for competitions. The main team is divided into 2 different sections - Stage and Street. The practices for both sections are designed on the basis of competition requirement. Every year, a team of 30-40 members participates in Stage events and a team of 8-10 members participates in Street battles.", "page": "Technology Dance Society"}, {"chunk_id": "6cd10b73", "title": "Workshops", "text": "Apart from routine practices, the members of the society participate in workshops conducted in Kolkata by renowned independent dancers and crews. The society also conducts open workshops inside the campus.", "page": "Technology Dance Society"}, {"chunk_id": "6254c12f", "title": "List of Governors & Choreography Heads", "text": "2024-25\nChoreography Head:\n• Siddhata Sudhakar Gadhe\nGovernors:\n• Dibya Ranjan Samal\n• Tushar Dabi\n• Banoth Yamini\n• Atullyatej Ranasingh\n2023-24\nChoreography Head:\n• Sanjana Singh\nGovernors:\n• Bharat Kabra\n• Nikhil Atram\n• Ananya Pandey\n2022-23\n2022-23\n• Tridibesh Naik\n• Ishank Gupta\n• Vibhusha Sontakke\n• Gaurav Semwal\n2021-22\n• Ajith Sree Madhav\n• Sameer Gautam\n• Shreya Kumari\n• Soorsri Thashkant\n2020-21\n2020-21\n• Monika Choudhary\n• Pranali Rahangdale\n• Shivam Sengar\n• Tausif Mohammad\n2019-20\n2019-20\n• Ashish Meena\n• Mayank Lalwani\n• Milan Chauhan\n• Shippee Sunda\n2018-19\n2018-19\n• Dhaval Chauhan\n• Monika Tamsoy\n• Pranay Kumar Mahapatra\n• Sandeep Sharma\n2017-18\n2017-18\n• Ankit Singh\n• Nupur Jain\n• Pukhraj Baraskar\n• Shubham Annapure\n2016-17\n2016-17\n• Rajat Gupta\n• Rakesh Ravikumar\n• Sakshi Garg\n• Shraddha Mehta\n2015-16\n2015-16\n• Nikhil Kothari\n• Prachi Gupta\n• Rimil Hembrom\n• Sagar Kalbande", "page": "Technology Dance Society"}]