[{"chunk_id": "info_76983f", "title": "The KGPian Game Theory Society - Quick Facts", "text": "framless\nActivities | Finance Talk , War of Wits , Nashify , Case Study\nFounded | 19th August 2010 ( 19th August 2010 )\nFounder(s) | Manoj Gadia\nPresidents | Saharsh Agrawal\nVice Presidents | Ayandeep Neogi\nNumber of members | 52 (2023-24)\nWebsite | https://thekgts.wordpress.com/\nInstagram | https://www.instagram.com/kgts.iitkgp/\nFacebook | https://www.facebook.com/The.KGTS\nContact | +91 74393 04962 (Saharsh Agrawal) +91 99032 50289 (Ayandeep Neogi)\nUnder TSG | No", "page": "The KGPian Game Theory Society"}, {"chunk_id": "7a37fcc3", "title": "The KGPian Game Theory Society", "text": "The KGPian Game Theory Society, abbreviated as KGTS, is IIT Kharagpur’s game theory organisation. It is a dynamic and intellectually stimulating community for students passionate about the study and application of game theory. It had organised various game theory-related events like Nashify , War of Wits , Brethren of the Coast and Finance Talk in previous years, designed to promote a culture of game theory on the campus. The Society’s flagship event is Stratathon, a mind-intriguing strategy case competition featured in Kshitij , the Techno-Management fest of IIT Kharagpur, every year.", "page": "The KGPian Game Theory Society"}, {"chunk_id": "67779a37", "title": "Founding", "text": "The KGPian Game Theory Society was founded on 19th August 2010 by Manoj Gadia (07-12) . It is a student body which organizes various Game Theory related programs. With a motive of spreading awareness, knowledge and application of Game Theory, first official session of society was 15th June 2011 to 14th June 2012. Since then the society has seen tremendous growth over the years and witnessed good response from students and game theory enthusiasts. By the able guidance and vision of it's founder Manoj Gadia, this society has grown to become a family with more than 50 members.", "page": "The KGPian Game Theory Society"}, {"chunk_id": "76b8e2aa", "title": "Motive", "text": "The Society was founded with a main motive to promote concepts of Game Theory and Strategic Thinking. Many situations in people's lives make them choose between different options and we always intend to optimize our chances and get the best outcome. This is where Game Theory comes into play. The outcomes decided by the situations provoke us to analyze them statistically and hence choose the optimal solution through various methods and statistics. This society promotes these concepts by various means.", "page": "The KGPian Game Theory Society"}, {"chunk_id": "1967a9fa", "title": "The Art of Strategy Project", "text": "This project is started under the advice of Prof. Avinash Dixit, emeritus professor of Princeton University. Society members undergo this self-learning program throughout the year to develop their strategic thinking skills. The Society also makes original questions based on strategic decision-making to compile it as a question bank.", "page": "The KGPian Game Theory Society"}, {"chunk_id": "d5dafd6e", "title": "Discussion Sessions", "text": "In discussion sessions, senior members conduct discussion sessions for all the members, explaining the various theoretical concepts, along with interesting games and real-life examples.", "page": "The KGPian Game Theory Society"}, {"chunk_id": "90d64762", "title": "Case Studies", "text": "Society members practice solving case studies using game theory in our academic meetings. Senior members solve real life case studies in the fields of business and economics.", "page": "The KGPian Game Theory Society"}, {"chunk_id": "277caa8f", "title": "Games", "text": "In society meetings, members play strategy-based games among themselves to learn how to use game theory concepts in a given situation. The games are usually in accordance with the concepts being covered during discussion sessions.", "page": "The KGPian Game Theory Society"}, {"chunk_id": "582c28ae", "title": "War of Wits (WOW)", "text": "Main article: War of Wits\nIt is an annual on-spot strategy based competition for students of IIT Kharagpur. The first edition WOW 1.0 was held on Saturday, 30th March 2013 in association with Consulting Club, Vinod Gupta School of Management. More than 300 students participated in the event. The 2nd edition WOW 2.0 was organized on 3rd April 2015 and witnessed a participation of more than 350 students. WOW has been increasingly attracting a good amount of participation from the in-campus students of IIT Kharagpur.", "page": "The KGPian Game Theory Society"}, {"chunk_id": "6c377338", "title": "Nashify", "text": "Main article: Nashify\nIt is the first of its kind game theory based on-spot inter-college event designed and conducted by the The KGPian Game Theory Society in Kshitij 2014, the annual techno-management fest of IIT Kharagpur. Drawing from the success of the in-house event War of Wits, Nashify challenged the participants to outwit and outplay their opponents. The event took place on 1st and 2nd February 2014 and saw a participation from 146 teams (438 participants).", "page": "The KGPian Game Theory Society"}, {"chunk_id": "f36ac169", "title": "Stratathon", "text": "It is the flagship event of KGTS, which is conducted every year, during Kshitij, IIT Kharagpur. It includes various in-house developed strategic decision-making games, played in various rounds and formats, among the students of colleges from all over India.", "page": "The KGPian Game Theory Society"}, {"chunk_id": "ea4cad81", "title": "Brethren of the Coast", "text": "This was one of its kind online event based on Strategic Thinking. It was based on the Classical Game of Pirates dealing with the distribution of 100 coins with interactive Graphical User Interface. It was a 1 week-long event which started on 25th October 2013 and witnessed a participation of more than 1500 students. The game was designed and developed by Sreejith PP and Rishi Mehta in collaboration with Team KGTS.", "page": "The KGPian Game Theory Society"}, {"chunk_id": "0a20bcf4", "title": "Strategia Hub", "text": "Sessions have been conducted for the students in the past where they were introduced to the basics of game theory and were involved in taking decisions in certain situations that were simulations of real-life scenarios.", "page": "The KGPian Game Theory Society"}, {"chunk_id": "850b4721", "title": "Finance Talk", "text": "On 31st March 2012, society conducted a finance talk where final year students who happened to have cleared one or more levels of the prestigious exams of CFA, FRM and CAT were called as guests to share their experiences. The seminar saw a huge participation of around 400 students", "page": "The KGPian Game Theory Society"}, {"chunk_id": "75d5d42a", "title": "The Strategist", "text": "It is a periodic newsletter which contains articles that are specially designed to target the in-campus students of IIT Kharagpur having articles and facts ranging to various fields such as leadership, finance, consultancy, and business management. Debut edition was published in April 2012 and had the highest online viewership for any newsletter in IIT Kharagpur till date. Since then society has released 7 editions of The Strategist, which have had the highest viewership in the respective semesters. Society coordinate with Economics Club IIT Delhi and share articles and ideas based on game theory. The Strategist could be read online at: http://issuu.com/the.kgts .", "page": "The KGPian Game Theory Society"}, {"chunk_id": "9f43b496", "title": "Comic Strips", "text": "Society design comic strips to provide an interesting overview of Game Theory with a fun touch. With a maximum online reach of over 16000, these comic strips attract wide sections of viewers. These comic strips can be found in the Facebook page .", "page": "The KGPian Game Theory Society"}, {"chunk_id": "e03963da", "title": "External links", "text": "• https://www.facebook.com/The.KGTS\n• https://www.instagram.com/kgts.iitkgp/\n• https://www.linkedin.com/company/the-kgts\n• https://thekgts.wordpress.com/\n• http://issuu.com/the.kgts", "page": "The KGPian Game Theory Society"}]