[
  {
    "chunk_id": "info_9c76e8",
    "title": "AGV - Quick Facts",
    "text": "Founded | 2011 ( 2011 )\nFounder(s) | Dibyendu Ghosh, Nalin Gupta, Srinivas Reddy\nWebsite | www .agv .iitkgp .ac .in",
    "page": "AGV",
    "source": "https://wiki.metakgp.org/w/AGV"
  },
  {
    "chunk_id": "a89f2632",
    "title": "AGV",
    "text": "AGV (Autonomous Ground Vehicle) is a multi-disciplinary research group under Prof. Debashish Chakravarty , Mining department, aiming to build a fully operational self-driving car. It deals with varied projects involving computer vision,deep and reinforcement learning.\nAGV participates in Intelligent Ground Vehicle Competition ( IGVC ) every year. This year they are also participating in Mahindra Rise Prize Driverless Car Challenge. The team in divided in embedded electronics, software and mechanical parts.",
    "page": "AGV",
    "source": "https://wiki.metakgp.org/w/AGV"
  },
  {
    "chunk_id": "7790728c",
    "title": "Vision",
    "text": "\"Our vision is to have the world without road accidents; a place where people can commute without fear, to build the world’s most advanced and cost effective self-driving car.\"\n• The present transportation system is getting increasingly expensive and inefficient.\n• Over $230 billion are spent on car crashes every year, a majority of which are due to human errors.\n• Congestion in total amounts to 10.5 billion litres of wasted petrol each year.\n• Over 4.2 billion hours are wasted in traffic every year.\n• There has been an increase in the number of accidents due to human errors such as drinking and driving.\nThe solution to all these problems is a self-­driving car. With this inspiration, we have started Autonomous Ground Vehicle (AGV) Research Group in IIT Kharagpur. We aspire to make India’s first fully operational self-driving car.\nIGVC (Intelligent Ground Vehicle Challenge) has a huge international media coverage. Being such a consistent performer and from the esteemed IITs we will attract the attention of both the International Media, as well as Newspapers and Magazines within the country. We will ensure that due credit is given to all our sponsors, and our vehicle will have your desired logo as well.\nThe vehicle will be showcased at Kshitij, the Tech-Fest of IITKharagpur, which has a participation of 25,000 from outside Kharagpur. Other than Kshitij, we will showcase the vehicle at a variety of robotics exhibitions and workshops held throughout India. Additionally, the photo of the vehicle with the sponsors will be circulated all over the internet as well. Our team website would contain your company’s logo for the whole one year.\nIIT Kharagpur has immense talent of students and it will be mutually beneficial for the company to collaborate with us in order to attract more talent for their company.",
    "page": "AGV",
    "source": "https://wiki.metakgp.org/w/AGV"
  },
  {
    "chunk_id": "5c333a23",
    "title": "Mahindra Rise Prize",
    "text": "India has been on the verge of greatness for too long. It's time to change that. It’s time to make the world sit up and take notice. To create disruptive solutions that transform lives. To lead in enterprise and innovation. To see \"Made in India\" mean best in the world. This is Mahindra Rise Prize challenge aims at. We at AGV have been selected in the first round of this challenge and we are looking forward to applying our technology to a Mahindra Vehicle making it fully Autonomous.",
    "page": "AGV",
    "source": "https://wiki.metakgp.org/w/AGV"
  },
  {
    "chunk_id": "629f1858",
    "title": "Intelligent Ground Vehicle Challenge",
    "text": "The IGVC offers a design experience that is at the very cutting edge of engineering education. It is multidisciplinary, theory-based, hands-on, team implemented, outcome assessed, and based on product realisation. It encompasses the very latest technologies impacting industrial development and taps subjects of high interest to students. Design and construction of an Intelligent Vehicle fit well in a two-semester senior year design capstone course, or an extracurricular activity earning design credit. The deadline for an end-of-term competition is a real-world constraint that includes the excitement of potential winning recognition and financial gain. Students solicit and interact with industrial sponsors who provide component hardware and advice, and in that way get an inside view of industrial design and opportunities for employment. Team AGV has been constantly participating in Intelligent Ground Vehicle Competition and making a mark.",
    "page": "AGV",
    "source": "https://wiki.metakgp.org/w/AGV"
  },
  {
    "chunk_id": "c1e3dfc5",
    "title": "Performance at IGVC 2018 :",
    "text": "• A total of 43 teams across India, Japan, USA, Canada and Istanbul had registered for this prestigious navigation challenge.\n• Our team gave the best of the colleges which included the likes of University of British Columbia, Georgia Institute of Technology, Michigan-Ann Arbor University, Ohio University etc., a run for their money.\n• 7 teams from India contested in it including those from IIT Madras and IIT Kanpur. Team AGV finished as Runner-Up, winners being team CART Inc. at Bluefield State College, USA.",
    "page": "AGV",
    "source": "https://wiki.metakgp.org/w/AGV"
  },
  {
    "chunk_id": "66765116",
    "title": "Our Products :",
    "text": "• We have developed our own series of Autonomous Cars called ‘Eklavya’. Over the years we have put out Eklavya, Eklavya 2.0, 3.0 and 4.0. Along with this we are developing Auro 666 and a 3D mapping API.\n• We cleared the first three stages of Mahindra Rise Prize Driverless Car Challenge and have been awarded a Mahindra E2O electric car, which is being worked upon to be made driverless. The project has received a lot of media coverage and is one of the first steps by any Indian Company to promote the research and development in autonomous technologies.",
    "page": "AGV",
    "source": "https://wiki.metakgp.org/w/AGV"
  },
  {
    "chunk_id": "19925ee3",
    "title": "Mine Mapping",
    "text": "The lack of accurate maps of underground mines frequently causes mine accidents. Hazardous operating conditions and difficulty in access makes Robotic Exploration and Mapping an immediate and safe choice.The mapping algorithms used in the self-driving car can also be applied for mines.",
    "page": "AGV",
    "source": "https://wiki.metakgp.org/w/AGV"
  },
  {
    "chunk_id": "94a90b1e",
    "title": "Construction Mapping",
    "text": "Large-scale construction projects might involve exploration of areas inaccessible or life­ threatening to workers. For such scenarios, a portable mapping solution could be hosted on a small flying quadrotor.",
    "page": "AGV",
    "source": "https://wiki.metakgp.org/w/AGV"
  },
  {
    "chunk_id": "9334100d",
    "title": "City Mapping",
    "text": "The traditional surveying techniques for generating maps for city­ planning requires thousands of man-hours and are very expensive. Large cities can be mapped accurately and efficiently using a self-driving car equipped with 3­D laser mapping technologies. This can cut down on a lot of manual work and save time. With this view, we undertook the DIGITAL KGP PROJECT in which we mapped some parts of the IIT Kharagpur campus using the 3­D ENVIRONMENT MAPPING Technology.",
    "page": "AGV",
    "source": "https://wiki.metakgp.org/w/AGV"
  },
  {
    "chunk_id": "c73874bc",
    "title": "Night Time Driver Assist",
    "text": "The use of special sensors in autonomous driving systems can detect approaching vehicles and road boundaries under poor lighting conditions. This feature could be widely used in vehicles as an essential safety measure.",
    "page": "AGV",
    "source": "https://wiki.metakgp.org/w/AGV"
  },
  {
    "chunk_id": "94013410",
    "title": "Lane Departure Warning System",
    "text": "This system warns the driver as soon as the vehicle starts moving out of the lane. If the driver, for some reason, avoids the warning, the system takes over and moves the vehicle back into the lane. This technology completely removes the human error involved in the process.",
    "page": "AGV",
    "source": "https://wiki.metakgp.org/w/AGV"
  },
  {
    "chunk_id": "bce57e59",
    "title": "Collision Detection System",
    "text": "A sensing system has a wider field of view compared to an average human being. It is also capable of running calculations at over 2.5 GHz. Owing to these qualities, a sensing system can warn the driver beforehand about a probable collision.",
    "page": "AGV",
    "source": "https://wiki.metakgp.org/w/AGV"
  },
  {
    "chunk_id": "a26446c0",
    "title": "Completed Projects",
    "text": "• Motion Planning\n• Robot Perception\n• Object Detection\n• Localisation\n• Lane Navigation",
    "page": "AGV",
    "source": "https://wiki.metakgp.org/w/AGV"
  },
  {
    "chunk_id": "89dd29f5",
    "title": "Branding Avenues",
    "text": "• Overnight hackathons and workshops in IIT Kharagpur\n• The product itself, merchandise worn by the team, banners, standees etc.\n• 15000+ reach through our Social Media, Youtube and GitHub Handles.\n• Research Papers and other technical publications.",
    "page": "AGV",
    "source": "https://wiki.metakgp.org/w/AGV"
  },
  {
    "chunk_id": "e7de897d",
    "title": "Sponsorship",
    "text": "We are currently receiving funds through the Sponsored and Industrial Consultancy Cell (SRIC), IIT Kharagpur to carry on our research. These funds have constraints. As the sensors and other high-end technologies are quite expensive and cannot be bought solely through the funds from SRIC the team has to find alternative and cheaper methods to achieve what they want to. These methods are usually more time-consuming and less efficient.\nAlso the funds from SRIC cannot be used to participate in IGVC, since the funding cannot be used in travel and logistics which in itself require huge budget. Even this time the team funded themselves and performed outstandingly. So we have rightly shown that on being supported we will definitely perform much better and efficiently.\nOne example of our use of latest technologies on our work is the use of Velodyne LiDAR sensors to autonomously drive the Mahindra E2O car, which was highly successful.",
    "page": "AGV",
    "source": "https://wiki.metakgp.org/w/AGV"
  },
  {
    "chunk_id": "2b134a1e",
    "title": "References",
    "text": "AGV IIT Kharagpur",
    "page": "AGV",
    "source": "https://wiki.metakgp.org/w/AGV"
  }
]