[
  {
    "chunk_id": "9fbed70f",
    "title": "AIESEC",
    "text": "AIESEC",
    "page": "AIESEC",
    "source": "https://wiki.metakgp.org/w/AIESEC"
  },
  {
    "chunk_id": "e6363c7d",
    "title": "History",
    "text": "The idea behind AIESEC started in 1938, when representatives from schools across Europe exchanged information about various programs and schools that specialized in business and economics. Students were carrying out internships in other countries. Mostly on their own initiative but it came to a standstill with the onslaught of World War II.\nIn 1944, the neutral Scandinavian countries were still exchanging students. In Stockholm, Bertil Hedberg, an official at the Stockholm School of Economics, and students Jaroslav Zich (of Czechoslovakia), Jean Choplin (of France) and Stanislas Callens (of Belgium) founded AIESEC . This was the predecessor of AIESEC, which was officially founded in 1948. At the time, the organization's stated mission was “to expand the understanding of a nation by expanding the understanding of the individuals, changing the world one person at a time.”\nAt the time of AIESEC's founding at the conclusion of the 1940s, Europe was in the midst of recovery from the war that dealt grave losses to its population. Factories and enterprises were in desperate need of executives, managers and leaders. The continent needed more than just business development, however; the war had severely damaged relations between European nations, and many members of the community felt steps needed to be taken to address this problem.\nAIESEC was formed to address both of these concerns. Students from seven nations: Belgium, Denmark, Finland, France, Netherlands, Norway and Sweden came together in March 1949 for the first International Congress of AIESEC in Stockholm. The founders composed a constitution for the new organization and defined a purpose: \"AIESEC is an independent, non-political, and international organization which has as its purpose to establish and promote the friendly relations between the members.\"\nIn the first year of AIESEC's existence, 89 students were exchanged among the member nations.",
    "page": "AIESEC",
    "source": "https://wiki.metakgp.org/w/AIESEC"
  },
  {
    "chunk_id": "aa60fe2d",
    "title": "Functioning",
    "text": "AIESEC is an international non-governmental not-for-profit organization that provides young people with leadership development and cross-cultural global internship and volunteer exchange experiences across the globe, with a focus to empower young people so they can make a positive impact on society. The AIESEC network includes over 100,000 members in 133 countries and territories. It is the largest youth-run organization in the world.",
    "page": "AIESEC",
    "source": "https://wiki.metakgp.org/w/AIESEC"
  },
  {
    "chunk_id": "1affa0f2",
    "title": "Selections",
    "text": "AIESEC IIT Kharagpur conducts 2 selections in the entire academic year, once during the autumn semester and once during the spring semester.",
    "page": "AIESEC",
    "source": "https://wiki.metakgp.org/w/AIESEC"
  },
  {
    "chunk_id": "e3a59f66",
    "title": "Activities in Campus",
    "text": "AIESEC provides a platform for students in IIT Kharagpur, by going on an international internship. These young individuals can develop their leadership potential by working and leading teams. Associate membership opportunities allow the students to work with various NGO partners of AIESEC, and represent their college as a part of campus ambassador program.The organisations products are Team Member Programme (TMP), Team Leader Programme(TLP), Incoming exchange (ICX) and Outgoing Exchange (OGX).",
    "page": "AIESEC",
    "source": "https://wiki.metakgp.org/w/AIESEC"
  },
  {
    "chunk_id": "13fa3c25",
    "title": "References",
    "text": "http://www.aiesec.in/\nhttps://en.wikipedia.org/wiki/AIESEC",
    "page": "AIESEC",
    "source": "https://wiki.metakgp.org/w/AIESEC"
  }
]