[
  {
    "chunk_id": "info_328ad0",
    "title": "Business Club - Quick Facts",
    "text": "File:BClubLogoJPG.jpg\nActivities | Finance , Strategy , Analytics\nFounded | 2009 ( 2009 )\nFounder(s) | Shailesh Gupta Harsh Gupta Sudipto Sannigrahi Srichandana Sanjeev Mayank Mundra\nWebsite | bclub .co .in\nContact | +91 89079 40000 (Bharat Uday) +91 91223 72154 (Madiha Hanifa)\nUnder TSG | Yes",
    "page": "Business Club",
    "source": "https://wiki.metakgp.org/w/Business_Club"
  },
  {
    "chunk_id": "821de59d",
    "title": "Business Club",
    "text": "Business Club, popularly known as BClub, is IIT Kharagpur’s in-campus society for all things business. It provides a platform for like-minded individuals who yearn to enrich their knowledge of business and apply their skills in various competitions like case studies and hackathons at the national and international levels. A family of around 70 student members, actively working under 3 wings: Strategy, Finance, and Analytics , BClub is constantly striving to bridge the gap between business and technology.",
    "page": "Business Club",
    "source": "https://wiki.metakgp.org/w/Business_Club"
  },
  {
    "chunk_id": "c4572bdc",
    "title": "Founding",
    "text": "Business Club was founded in 2009 as Genese-de-Strategie by Shailesh Gupta, Harsh Gupta, Srichandana Sanjeev, Sudipto Sannigrahi, and Mayank Mundra. Genesie-de-Strategie was started with a primary objective to educate the students about the world of business strategies. The founders felt a need for students to be informed about the working of the business world for their growth. Over the course of a year, they realised the need to have a more wholesome approach to the world of business. They formed the Business Club in 2010 with a broader perspective toward business.",
    "page": "Business Club",
    "source": "https://wiki.metakgp.org/w/Business_Club"
  },
  {
    "chunk_id": "d9e46362",
    "title": "Growth",
    "text": "• Indian Case Challenge, India’s largest case competition, is the flagship event of the Business Club. ICC now witnesses international participation as well.\n• Affiliation to Technology Students’ Gymkhana (during the academic session 2014-15) brought official recognition to the club.\n• The Business Club has started to reach out to the entire student population of the college by conducting Open House Sessions for their benefit.\n• Regular social media content and blogs in the domain of finance, strategy and analytics are uploaded on all major social media platforms to keep readers updated.",
    "page": "Business Club",
    "source": "https://wiki.metakgp.org/w/Business_Club"
  },
  {
    "chunk_id": "edfe32d0",
    "title": "Selections",
    "text": "Selections to the Business Club are held at the beginning of the first and the second academic year.",
    "page": "Business Club",
    "source": "https://wiki.metakgp.org/w/Business_Club"
  },
  {
    "chunk_id": "05b44b31",
    "title": "First-year selections",
    "text": "The selection procedure consists of a group-discussion round followed by a personal interview for the shortlisted candidates. Prospective members aren’t judged based on their business acumen, but on their ability to think clearly, present thoughts in a concise and structured manner, their dedication, and their zeal to learn.",
    "page": "Business Club",
    "source": "https://wiki.metakgp.org/w/Business_Club"
  },
  {
    "chunk_id": "bc94bdd4",
    "title": "Second-year selections",
    "text": "A training period called the summer program is conducted for the students selected in the second academic year to level their knowledge with the students selected in the first year. During this time, they are provided with the same resources to learn everything necessary.\nAfter the summer program, every associate is evaluated on the same knowledge level and a final personal interview is conducted to select the students with the highest knowledge in the three domains. Other soft skills like communication are also kept in mind. Selected students are then assigned the position of sub-heads.",
    "page": "Business Club",
    "source": "https://wiki.metakgp.org/w/Business_Club"
  },
  {
    "chunk_id": "49392a1c",
    "title": "Structure",
    "text": "Business Club has a four-level organisational structure.\n• Advisors consist of fourth and fifth-year members and are the senior-most members whose experience helps in guiding the overall direction of the club.\n• The executive body comprises of Governors and Heads who are in the third year of their study. They are responsible for heading various wings of the club and its management.\n• The team of Sub-heads is responsible for the day-to-day functioning of the club and the execution of its plans. It consists of students in the second year of their studies.\n• Associates are the first years who have a passion to win and are generally business-oriented. These members are oriented towards gaining as much knowledge as they can from the pool of knowledge available to the seniors.\nThe functional structure of the Business Club consists of three wings – finance, analytics, and strategy . These wings include all that happens within the world of business.",
    "page": "Business Club",
    "source": "https://wiki.metakgp.org/w/Business_Club"
  },
  {
    "chunk_id": "8231375d",
    "title": "Activities",
    "text": "Intra-Club activities\nTo prepare the associates for the sub-head tenure, they are encouraged to participate in various activities to lay a strong foundation in the three domains of Analytics, Finance, and Strategy. These activities include:\n• Intra-club case study Competition - The associate batch is divided into small groups and each team is allotted a sub-head as a mentor, who guides the associate batch in solving the problem statement. On the D-day, the executive batch judges the teams through their presentations, and valuable inputs are given.\n• Knowledge meets - Organising knowledge meetings is the way by which knowledge dissipation happens in the Club. These meetings are conducted by Club members, where they meet and brainstorm on various topics of interest. A strong network consisting of resourceful seniors and mentor professors clarifies any doubts the members may have and make the meetings fruitful.\n• Whitepaper - This event is organized so that the associates could choose and research the topic of their choice in the domain of the three wings of the B-club. During the event, Associates put around 20 days of research and at the end present their papers in front of the executive and sub-head Batch, where they give useful insights into the topic\n• Drafting modules and blogs - Club members design modules and blogs in the three wings. These modules are released through the public handle.\n• Summer program\nDuring the Summer holidays, many first-years apart from the Associate Batch are selected for the program as Summer Associates.\n• Case study competition - This is the second intra-club case study competition. This time associates are made to solve the problem statement on their own without the mentorship of seniors, considering they have already done the courses in the three domains.\n• Analytics competition - This competition concentrates on the core of machine learning. Associates are given a data set and this competition demands writing algorithms without using built-in libraries and maximizing the accuracy score on the given dataset.\n• Trading Competition - During this competition Associates and Summer Associates create a mock trading account. This competition lasts for 10 days and associates carry out intraday trading based on the technical and fundamental analysis they have learned in the program.\nAt the end of the summer program, based on the performance and participation in the summer program, associates are selected to be the part of sub-head batch.\nEvents organized by the Club\nThe club conducts a wide range of activities such as open house sessions and case studies enabling students to develop their business acumen by applying their skills and finding solutions to real-world problem statements.\n• Indian Case Challenge\nEver since its inception in 2012, the Indian Case Challenge provides the best platform for undergraduate and graduate students from all over India to compete against each other and prove their business and entrepreneurial mettle in a real-life business case scenario. Not only are the participants expected to have strong business skills and financial understanding, but also a feeling for entrepreneurship and a sense of realizing market opportunities.\nICC 2021, organized in association with Kshitij, was a huge success and received a whopping 3200+ unique registrations, including international participation.\n• Open House Sessions\nBusiness Club strives to impart basic knowledge regarding the various facets of business, in an attempt to make the students of IIT Kharagpur more equipped to thrive in the ever-evolving global industry. Open house sessions on basic finance, analytics, and strategy that are conducted in conjunction with organizations such as Alphabeta, ZS Associates, and IIMC Consulting Club have gone a long way towards this.\n• Webinars\nInformative webinars, presided by renowned speakers who excel in their respective business fields, are conducted by the club, to enrich the knowledge of the students even in online mode.",
    "page": "Business Club",
    "source": "https://wiki.metakgp.org/w/Business_Club"
  },
  {
    "chunk_id": "464a828e",
    "title": "2014-15",
    "text": "• Governors Sarthak Badjatiya Shramajit Gupta Virendra Singh\n• Heads Analytics: Pranay Yadav Consultancy: Pratyush Devliyal Finance: Umang Mavani Technical: Ravikiran Shinde",
    "page": "Business Club",
    "source": "https://wiki.metakgp.org/w/Business_Club"
  },
  {
    "chunk_id": "f94d3f46",
    "title": "2015-16",
    "text": "• Governors Ashutosh Dwivedi Nishant Jayaswal Shiladitya Saha\n• Heads Analytics: Raunak Chitlangia, Shubhrit Agrawal Consultancy: Manik Aggarwal Finance: Dhruva Ratanpura Technical: Murtaza Phalasiya, Rajat Bhavnani Logistics: Rihen Chheda, Ritwik Bajaj",
    "page": "Business Club",
    "source": "https://wiki.metakgp.org/w/Business_Club"
  },
  {
    "chunk_id": "063f7ab7",
    "title": "2016-17",
    "text": "• Governors Priya Mehta Kumar Sparsh Udit Sarin\n• Heads Analytics: Charu Agarwal, Shwetha Krishnamurthy Finance: Debjyoti Chakrabarti Consultancy: Medha Asija Technical: Shubham Singhal, Vaibhav Chauhan",
    "page": "Business Club",
    "source": "https://wiki.metakgp.org/w/Business_Club"
  },
  {
    "chunk_id": "a754abef",
    "title": "2017-18",
    "text": "• Governors Harsh Agarwal Hitendra Pratap Shubhra Agrawal\n• Heads Analytics: Ankit Agarwal, Subham Rajgaria Finance: Ankit Agarwal, Rajat Ragha, Shubham Sharma Strategy: Shubham Maheshwari Blogs and Articles: Rahul Raj Design: Anjali Bharti",
    "page": "Business Club",
    "source": "https://wiki.metakgp.org/w/Business_Club"
  },
  {
    "chunk_id": "2aa6893e",
    "title": "2018-19",
    "text": "• Governors Aman Sharma Nikita Kishore\n• Heads Analytics: Yash Jain Finance: Amandeep Singh, Puneet Pansari Strategy: Amit Gunjan, Yogshree Choukse",
    "page": "Business Club",
    "source": "https://wiki.metakgp.org/w/Business_Club"
  },
  {
    "chunk_id": "9fd7cd06",
    "title": "2019-20",
    "text": "• Governors Aditya Parashar Deepankar Sachdeva\n• Heads Analytics: Amrit Goswami, Chinmay Singh, Karan Mahajan Finance: Shreyansh Jain, Vikrant Gupta Strategy: Tushar Mohandas, Tushar Singla Technical: Aditya Singhania\n2020-21\n• Governors Aryan Saxena Lakshraj Doshi Shashank Singh\n• Heads Analytics: Arusarka Bose, Naman Paharia, Abhinav Bohra Finance: Sayantan Das, Lakshiyata Chhajer, Amur Khandelwal Strategy: Shivam, Gaurav Joshi, Inakshi Kar",
    "page": "Business Club",
    "source": "https://wiki.metakgp.org/w/Business_Club"
  },
  {
    "chunk_id": "34b8e58e",
    "title": "2021-22",
    "text": "• Governors Arya Uttamchandani Sankalp Bose\n• Heads Analytics: Karan Uppal, Dikshant Pratap Singh Finance: Arnav Bhutda, Suhas Jain, Aditya Saha Strategy: Tejaswi Pagadala, Kashish Lundia Web: Piyush Dhamane Branding and Public Relations: Deepansh Agrawal",
    "page": "Business Club",
    "source": "https://wiki.metakgp.org/w/Business_Club"
  },
  {
    "chunk_id": "a2012093",
    "title": "2022-2023",
    "text": "• Governors Madiha Hanifa Bharat Uday\n• Heads Analytics: Vaibhav Jalani Strategy: Siddharth Madupathi, Pragya Choudhary Finance: Ram Sundaram, Patel Yuti Web and Design: Sai Kalyan Meghavath",
    "page": "Business Club",
    "source": "https://wiki.metakgp.org/w/Business_Club"
  },
  {
    "chunk_id": "63885b2d",
    "title": "2023-2024",
    "text": "• Governors Siddharth Dikshit Shreeya Mishra\n• Heads Analytics: Adyan Rizvi, Ishan Ray, Lokesh Tirthani Finance: Suryaansh Jindal, Ojasvi R Singh Strategy: Atmajyoti Ghosh, Arya Vardhan Singh, Jash Mody",
    "page": "Business Club",
    "source": "https://wiki.metakgp.org/w/Business_Club"
  },
  {
    "chunk_id": "2a609772",
    "title": "2024-2025",
    "text": "• Governors Arnav Bansal Anshul Trehan\n• Heads Analytics: Arya Dighde Finance: Aman Samriya, Manya S. Chopra Strategy: Adrika Agarwal, Aarushi Mahajan Web: Abhiram Siddhanti",
    "page": "Business Club",
    "source": "https://wiki.metakgp.org/w/Business_Club"
  },
  {
    "chunk_id": "9e7c8464",
    "title": "Achievements",
    "text": "Year | Competition Name | Organisers | Location | Competition Type | Team | Achievement\n2021 | SmartIdeaThon | GITAM University | Online | Innovation | Tushar Singla | Winners\n2021 | India Innovation Championship | Chitkara University + SucSeed | Online / Patiala | Innovation | Tushar Singla | Winners\n2021 | KIRIT: Case Study | KIAMS | Online | Case Study | Arusarka Bose | Winners\n2021 | AbInbev Maverick Hackathon | AbInBev | Online | Case Hackathon | Arusarka Bose, Naman paharia | Finalists\n2021 | Sale-Able, 2021 | E-Summit, E-Cell IIT Roorkee | Roorkee | Sales & Marketing Case Study | Sankalp Bose | Runners Up\n2021 | Hate speech detection | European Chapter of the ACL | Kyiv, Ukraine | Data Science Competition | Naman Paharia | Winner\n2020 | Finopoly | IIM Indore | Indore | Stock Pitch | Pagadala Tejaswi, Aditya Saha, Arnav Bhutda | Finalists\n2020 | Smart India Hackathon 2020 | Government of India | Delhi | Case Hackathon | Aditya Parashar, Amrit Goswami, Karan Mahajan | Winners\n2020 | Empresario | E-Cell, IIT Kharagpur | Kharagpur | B Plan | Tushar Singla | Runners Up\n2020 | Young Innovators Challenge Awards | 3M-CII | Online | Innovation | Tushar Singla | Winners\n2020 | Local Startups Meet | E-Cell, IIT Kharagpur | Online/ Kharagpur | Pitching | Tushar Singla | Winners\n2020 | SGH Business Game | Students Consulting Club at SGH Warsaw School of Economics | Online | Business Game | Inakshi Kar | Overall 2nd\n2020 | Case Electo 2020 | Enactus, BITS Pilani | Pilani | Case Study | Sankalp Bose | Runners Up\n2020 | Case Club League 2020 | St. Stephens' College | Delhi | Financial Case Study | Deepansh Agrawal, Sankalp Bose, Suhas Jain | National Finalists\n2020 | Green Canvas 2020 | IIT Kharagpur | Kharagpur | Environmental Case Study | Sankalp Bose | First Runners Up\n2020 | Creative Shock | ISM University of Management and Economics | Lithuania | Social Business Case Study | Aryansh Singh, Karan Uppal | Top 1.2%\n2019 | CoreNet Global Academic Challenge | CoreNet Global | Atlanta | Real Estate Case Challenge | Amrit Goswami, Vikrant Gupta | Finalists\n2019 | Techniche | IIT Guwahati | Guwahati | Case Study | Aryan Saxena, Shashank Singh, Simran Rajagopalan, Laksh Doshi | Winners\n2019 | Techniche | IIT Guwahati | Guwahati | Case Study | Inakshi Kar, Abhinav Bohra, Gaurav Joshi | Second\n2016 | Campus Beats | ZS Associates | Kharagpur | Case Study | Nishant Jayaswal,Shiladitya Saha,Rajat Bhavnani, Kumar Sparsh | First Runners Up\n2016 | Smart City Challenge | IIM Bangalore | Bangalore | Strategy | Dhruva Ratanpura and Team | Runners Up\n2016 | Techniche | IIT Guwahati | Guwahati | Case Study | Kumar Sparsh, Charu Agrawal,Udit Sarin, Harsh Agarwal, Hitendra Pratap | Winners\n2016 | Solvay Business Game | Solvay Brussels School of Economics and Management | Brussels, Belgium | Business Game | Dhruva Ratanpura, Nishant Jayaswal, Manik Aggarwal, Rihen Chheda, Murtaza Phalasiya | Finalists\n2015 | CIMA Global Business Challenge | CIMA | Mumbai | Case Study | Shramajit Gupta and team | National finalists\n2015 | Global Investment Banking Valuation Olympiad | Global Banking Training in association with Greensea Capital | London | Financial Valuation | Umang Mavani, Sarthak Badjatiya, Dhruva Ratanpura, Ashutosh Dwivedi | World top 10 finalists\n2015 | Techniche | IIT Guwahati | Guwahati | Case Study | Murtaza Phalasiya, Nishant Jayaswal, Rajat Bhavnani | Winners\n2015 | 9th GMBCC | Universitas Gadjah Mada | Indonesia | Case Study | Rounak Gulati, Dhruva Ratanpura, Murtaza Phalasiya | Semi-finalists\n2015 | Inter IIT Tech Meet | IIT Kharagpur | Kharagpur | Case Study | Rounak Gulati, Shramajit Gupta, Umang Mavani | Winners\n2015 | Paycheck | Kshitij | Kharagpur | Personal Finance | Nishant Jayaswal, Vasudha Todi, Kumar Sparsh | 2nd runners up\n2015 | Le Play’s Marathon | Kshitij | Kharagpur | Case Study | Ashutosh Dwivedi, Souvik Bhattacharya, Priya Mehta | 1st runners up\n2015 | Le Play’s Marathon | Kshitij | Kharagpur | Case Study | Nishant Jayaswal, Shaswat Datta, Charu Agrawal | 3rd runners up\n2014 | National Students Space Challenge | SPATS | Kharagpur | Case Study | Nishant Jayaswal, Shaswat Datta, Shwetha Krishnamurthy, Kumar Sparsh | Winners\n2014 | Petrocase | SPE | Kharagpur | Case Study | Virendra Singh and team | Winners\n2014 | Techniche | IIT Guwahati | Guwahati | Case Study | Shramajit Gupta, Umang Mavani, Ashutosh Dwivedi | Winners\n2014 | VJTI Consultant | VJTI | Mumbai | Case Study | Nishant Jayaswal, Shwetha Krishnamurthy, Priya Mehta | 3rd runners up\n2013 | Petrocase | SPE | Kharagpur | Case Study | Shramajit Gupta, Umang Mavani and team | 1st runners up\n2013 | Techniche | IIT Guwahati | Guwahati | Case Study | Rounak Gulati, Pratyush Devliyal, Ravikiran Shinde | Winners\n2013 | B-Consigliere | Kshitij | Kharagpur | Case Study | Rounak Gulati | Winners\n2013 | Speak out for Engineering | Institute of Mechanical Engineers | Paper Presentation | Rishabh Kataruka | Asia-Pacific finalist\n2012 | Ojass | NIT Jamshedpur | Jamshedpur | Case Study | Rounak Gulati | 1st runners up\n2012 | E-bizz | St. Joseph College | Bangalore | Economics Summit | Rounak Gulati | 1st runners up\n2011 | Business Masters | KIT | Germany | Case Study | Shailesh Gupta, Sudipto Sannigrahi, Srichandana | Only Indian team selected\n2011 | Concipio | E-Cell | Kharagpur | Business Plan | Nalin Gupta | Winners\n2011 | B-Plan | Kshitij | Kharagpur | Business Plan | Sudipto Sannigrahi | 1st runners up\n2011 | Yukti | NSIC | - | Business Plan | Avigyan Karan | Winners\n2011 | E-waste reuse event | STC | Illinois | Case Study | Shailesh Gupta, Nalin Gupta | Winners\n2010 | Concipio | E-Cell | Kharagpur | Business Plan | Siddhartha Verma | Winners\n2010 | Ecomagination | GE | Case Study | Akhilesh Betanamudi | Special Students Award\n2009 | Concipio | E-Cell | Powai | Business Plan | Shailesh Gupta | Winners\n2009 | Srijan | IIMC | Calcultta | Business Plan | Shailesh Gupta | Winners",
    "page": "Business Club",
    "source": "https://wiki.metakgp.org/w/Business_Club"
  }
]