[
  {
    "chunk_id": "info_d43329",
    "title": "Child Rights and You (CRY) IIT Kharagpur Volunteer Chapter - Quick Facts",
    "text": "Number of members | -\nWebsite | www .facebook .com /CRY .IITKGP\nContact | <Phone_No and Name>\nUnder TSG | No",
    "page": "Child Rights and You (CRY) IIT Kharagpur Volunteer Chapter",
    "source": "https://wiki.metakgp.org/w/Child_Rights_and_You_(CRY)_IIT_Kharagpur_Volunteer_Chapter"
  },
  {
    "chunk_id": "84bab8a7",
    "title": "Child Rights and You (CRY) IIT Kharagpur Volunteer Chapter",
    "text": "Child Rights and You (CRY) was started in 1979 by Mr. Rippan Kapur and 6 friends to improve the condition of the underprivileged Indian child. CRY IIT Kharagpur Volunteer Chapter was started on 6th April, 2010 under the leadership of Ramanuj Lal and Monish Salhotra to bring about a change in the lives of the deprived children in and around their campus and formed CRY IIT Kharagpur Volunteer Chapter. CRY IIT Kharagpur Chapter is a group volunteers with a passion to improve the lives of children of our society, specially around Kharagpur. The Chapter functions under CRY Kolkata Regional Office.",
    "page": "Child Rights and You (CRY) IIT Kharagpur Volunteer Chapter",
    "source": "https://wiki.metakgp.org/w/Child_Rights_and_You_(CRY)_IIT_Kharagpur_Volunteer_Chapter"
  },
  {
    "chunk_id": "0c319be4",
    "title": "Child Rights and You",
    "text": "As per CRY's website \"Way back in the 1970s, Rippan Kapur, a young airline purser, was driven by the extraordinary dream to see a day when no Indian child would be deprived of rights as basic as survival, participation, protection and development. Like many of us, Rippan too was upset when he saw disparities between privileged and underprivileged children. He hated to see children begging and working as servants. Unlike most of us though, he did something about it. He joined his school’s social service club and read to the blind, visited children in hospitals, held reading and writing classes for street children, and started a free dispensary at a slum the club adopted. To raise funds for these activities, the club sold milk. It even won a shield for the best Interact club! These qualities of resourcefulness and determination came in handy.\nCRY IIT Kharagpur Volunteer Chapter Team\nIn 1979 Rippan and 6 friends started CRY with Rs 50 around his mother’s dining table. They felt that something needed to be done to improve the situation of the underprivileged Indian child. Uncharacteristically, given their backgrounds and motivations, they chose not to start a grassroots-level implementing organisation working directly with and for underprivileged children. They opted instead to make CRY a link between the millions of Indians who could provide resources and thousands of dedicated people and organisations at the grassroots-level who are struggling to function for lack of them. This “link” or enabling position has determined CRY’s strategic choices at every juncture – from the fundraising methods it employs, to the nature of its relationship with the NGOs it partners with.\"",
    "page": "Child Rights and You (CRY) IIT Kharagpur Volunteer Chapter",
    "source": "https://wiki.metakgp.org/w/Child_Rights_and_You_(CRY)_IIT_Kharagpur_Volunteer_Chapter"
  },
  {
    "chunk_id": "4357df99",
    "title": "IIT Kharagpur Chapter",
    "text": "To bring a change was the thought of a handful of students of IIT Kharagpur, in March 2010. They joined hands under the leadership of Ramanuj Lal and Monish Salhotra to bring about a change in the lives of the deprived children in and around their campus and formed CRY IIT Kharagpur Volunteer Chapter. With the help of Saptak Mohanta, a former intern at CRY Kolkata and few other motivated acquaintances, a strategic team was formed. It has gradually become a decent group of students from various fields of engineering, science, law and MBA. The initiative was flagged off with the launch of a photography contest in the campus which witnessed participants submitting their entries on issues of child rights in and around their campus which often remains unnoticed.",
    "page": "Child Rights and You (CRY) IIT Kharagpur Volunteer Chapter",
    "source": "https://wiki.metakgp.org/w/Child_Rights_and_You_(CRY)_IIT_Kharagpur_Volunteer_Chapter"
  },
  {
    "chunk_id": "8a938888",
    "title": "Beliefs",
    "text": "CRY does not believe in running schools or orphanages or initiating vocational training. CRY believes in permanent change, policy level and implementation level change, so that the change impacts millions of children, is permanent or long term in nature, the children do not have to depend on NGOs for their welfare and it does not substitute the role of the state in ensuring child rights.",
    "page": "Child Rights and You (CRY) IIT Kharagpur Volunteer Chapter",
    "source": "https://wiki.metakgp.org/w/Child_Rights_and_You_(CRY)_IIT_Kharagpur_Volunteer_Chapter"
  },
  {
    "chunk_id": "b5e71034",
    "title": "Achievements",
    "text": "We, under the IIT Kharagpur Volunteer Chapter, have taken some initiatives like Mid-day meal project, Barrier-Free IIT Kharagpur project etc. Our biggest achievements till date are:\n1. Successfully catalyzing implementation of Mid-Day Meal in Mirpur Adivasi Primary School along with recruitment of new teachers.\n2. Included as a part of the 'Committee for the welfare of Physically Challenged students of IIT Kharagpur'.\n3. Conducted an Access Audit of IIT Kharagpur, with instructions from the Dean (UGS) and submitted a report that resulted in infrastructural changes in the campus including building of ramps.\n4. Conducted numerous RTE campaigns to promote Right to Education Act and other education related policies.\n5. Organized two international photography competition entitled Focus Right to promote child rights.\n6. Team \"Project Baalrakshak\" conducts Awareness cum Workshop on Child Sexual Abuse for the children and their parents in assistance with Paschim Medinipur District Police. Under this project till date 84 sessions are being conducted in 20 schools were children from nursery to class XII participated, also 32 sessions were conducted with the parents of those children. Till date around 5352 children and parents have attended the sessions. Project Baalrakshak has been recognized by Kharagpur Municipality.",
    "page": "Child Rights and You (CRY) IIT Kharagpur Volunteer Chapter",
    "source": "https://wiki.metakgp.org/w/Child_Rights_and_You_(CRY)_IIT_Kharagpur_Volunteer_Chapter"
  },
  {
    "chunk_id": "710a96c0",
    "title": "Awards",
    "text": "Team \"Project Baalrakshak\" has secured \"3rd Prize\" for presenting \"Poster\" regarding the work on \"Child Sexual Abuse\" in \"2nd International Workshop (The Science of Happiness) - Happiness and Wellbeing: The Road Beyond\" which was conducted by Rekhi Centre of Excellence for the Science of Happiness at IIT Kharagpur from 4-6 April 2019.",
    "page": "Child Rights and You (CRY) IIT Kharagpur Volunteer Chapter",
    "source": "https://wiki.metakgp.org/w/Child_Rights_and_You_(CRY)_IIT_Kharagpur_Volunteer_Chapter"
  },
  {
    "chunk_id": "0183f865",
    "title": "Activities",
    "text": "CRY IIT Kharagpur Chapter has various activities occurring on a regular basis.",
    "page": "Child Rights and You (CRY) IIT Kharagpur Volunteer Chapter",
    "source": "https://wiki.metakgp.org/w/Child_Rights_and_You_(CRY)_IIT_Kharagpur_Volunteer_Chapter"
  },
  {
    "chunk_id": "77bcf4c0",
    "title": "Project Baalrakshak",
    "text": "Project Baalrakshak founder, Mr. Rajarshi Debnath, taking a session with adults about child sexual abuse.\nFrom Mars Orbital Missions to Curiosity Rover, from breathtaking researches in Artificial Intelligence to audacity in medical technology, from astonishing expeditions in the deepest of the oceans to lofty skyscraping infrastructures, the humanity has arrived at its dawn where the development had never earlier reached and sustained this great pace that it has now, the global economy has never been so stable, survival has never been such a duck soup. But even for all these things, where are we still? Sometimes, we fear and wonder if in times like these, will childhood be as gleeful and enjoyable. But, unfortunately, that is the least of the worries we can think of.\nAccording to the statistics, one of the surveys sampled over more than 45,000 children in the age group 12-18, across different states of the country, revealed that half of the children were victims of child sexual abuse in one way or another. Adding to it, the taboo and fear of society are still ingrown in the people as one in four cases of child sexual abuse goes unreported. Victims of child sexual abuse are about four times more likely to develop symptoms of drug abuse and experience PTSD as adults and are about three times more likely to experience a major depressive episode as adults. POSCO Act which defines a child as any person below the age of 18 years and provides protection to all children under the age of 18 years from the offenses of sexual assault, sexual harassment and pornography was passed in the parliament in 2012, but still as we can see from the stats, we are far from making our country, in all its truest forms, safe for children.\nMoved by these atrocities and himself being a survivor of child sexual abuse, Rajarshi Debnath, a research scholar and a thoroughly motivated volunteer in CRY IIT Kharagpur Volunteer Chapter, now also a recipient of iVolunteer awards came up with a little thought of doing something for the children, trying to prevent child sexual abuse by making people aware of it. This small idea was named \"Project Baalrakshak.\" It all started two years back, in 2016. This idea of Child Sexual Awareness Workshops, as prolific as it did sound was challenging in all its means. It was a hard task to get suitable enough volunteers who could be dedicated and deliver the sensitive content appropriately and convincingly to the audience which was to comprise of children from classes nursery to 12th, parents and teachers. Tackling with all these issues the first workshop was eventually conducted in Balrampur high school in Kharagpur in September 2016. Though, there still were many troubles, Rajarshi stood unfaltered, finally getting a very dedicated team of his own, with the help which Project Baalrakshak has now gained widespread fame, from making his founder Rajarshi Debnath, a finalist in iVolunteer Awards 2019 to gaining assistance from Mednipur District Police, getting featured in a total of 22 print and digital media, and reaching around 5200 children, parents/guardian in a total of 19 schools, in its two years of working period. Team Project Baalrakshak also received a letter of appreciation from the Ward Counselor of Kharagpur.\nA Project Baalrakshak session teaching children about good touch and bad touch.\nAs a result of Team Project Baalrakshak's attempts, many children and parents had finally broken down their silence and talked about sexual abuse that the children were a victim of. Furthermore, it was found that in 19% cases, culprits were unknown, 57 % were family friends/friends, 21 % close relatives, and 12 % school/tuition teachers, which to a large extent matches with the national reports. Earlier Team Project Baalrakshak had to approach schools and convince them for their sessions, but now for the success, they have attained in their field, they're now actively invited by schools for conducting sessions.\nTeam has conducted workshops in Kharagpur, Medinipur and Jhargram. This team is also featured in \"LINK (LBSNAA Innovation NetworK)' which is a platform working to connect the needs of the field administrators to a wide audience of technology providers, innovators, skilled man-power ecosystems and finance sources.\nThings don't change as swiftly as we sometimes want them to be, nevertheless they do remain in that state of stagnancy as it is for the sheer and consistent efforts of those around who seek to get the change, no matter what it takes and how it takes, their results will definitely mark the screen for both the upcoming and ongoing generations; seekers, believers and finally, achievers.\nCurrently, Team Project Baalrakshak is headed by Ms. Parama Mukhopadhyay and Mr. Turin Datta who took charge on February, 2019.",
    "page": "Child Rights and You (CRY) IIT Kharagpur Volunteer Chapter",
    "source": "https://wiki.metakgp.org/w/Child_Rights_and_You_(CRY)_IIT_Kharagpur_Volunteer_Chapter"
  },
  {
    "chunk_id": "f8eccc13",
    "title": "School Sessions",
    "text": "A volunteer teaching children\nC.R.Y is an non profit and non government organisation working for the betterment and upliftment of the underprivileged children in India. We are the volunteers at the Kharagpur Chapter under C.R.Y., Kolkata where our mission is to develop the condition of the children around and inside the campus. The most active section of our chapter is the team who oversee the school sessions. Every Saturday, we go to middle schools at Arasini and Amlatoria where we teach and interact with the children from Classes I to IV. Our main aim is to cover the things which they otherwise are not able to do in their regular course curriculum. We cover things like basic maths, story telling, puzzles, games, science experiments, good food habits and importance of health. For the children at Amlatoria, with the efforts of the volunteers, we have successfully built a playscape at the school playground. We also have bought a projector for the school at Amlatoria and in pursuit of buying one more for the other one. We, as volunteers want that the children should learn good amount for moral and social etiquettes for a good and decent survival in this cut throat world. Then only will our long term goal will be achieved.",
    "page": "Child Rights and You (CRY) IIT Kharagpur Volunteer Chapter",
    "source": "https://wiki.metakgp.org/w/Child_Rights_and_You_(CRY)_IIT_Kharagpur_Volunteer_Chapter"
  },
  {
    "chunk_id": "5278e59b",
    "title": "Medical Camps",
    "text": "C.R.Y IIT Kharagpur Volunteer Chapter organises medical camps every year at Amlatoria and Arashini villages. Medical camps are organised to make basic healthcare accessible for all. These villages have no healthcare facilities or even a qualified healthcare worker. Majority of the people living in remote villages are daily wage labourers, who earn very meagre income. They don’t go hospital or get a health checkup even when they are sick. Because, their little income won’t be sufficient to afford to the costs of getting a good health checkup or buying the medicines the doctor has prescribed for them. Medical Camp conducted last time was a huge success with more than 200 villagers attending the camp. A group 16 doctors were a part of this camp and they personal attention to everyone. Medicines were given free of cost.",
    "page": "Child Rights and You (CRY) IIT Kharagpur Volunteer Chapter",
    "source": "https://wiki.metakgp.org/w/Child_Rights_and_You_(CRY)_IIT_Kharagpur_Volunteer_Chapter"
  },
  {
    "chunk_id": "9fa24481",
    "title": "Science Exhibitions",
    "text": "An experience with virtual reality during a science exhibition.\nCRY IIT Kharagpur volunteer chapter conduct school sessions on a regular basis to motivate children for their better future. Education does not simplify mean the ability to read and write, So for the complete process of development, volunteers conduct science exhibition every academic year in which volunteers prepare various science models for children and present them to the children to explain and understand science practically. Science exhibition is mostly directed towards the basic science in daily life like respiration, fire burning, water absorption by plants. Volunteers made models to explain to the children the basic sciences to increase interest and relate to their daily life so that they can understand easily.",
    "page": "Child Rights and You (CRY) IIT Kharagpur Volunteer Chapter",
    "source": "https://wiki.metakgp.org/w/Child_Rights_and_You_(CRY)_IIT_Kharagpur_Volunteer_Chapter"
  },
  {
    "chunk_id": "a7e357c2",
    "title": "Community Meetings",
    "text": "Community meeting, a gathering in which we see a participation from the parents, guardians and other members of the society, we stand up to focus on the potholes, discuss about their causes and find solutions to them. Community levels on a village level mainly aims to bring in light the various issues that the children are facing and make the people aware of certain topics which might go neglected if unattended, but tend to have a big impact on the lives of children. Certain issues like sanitation, basic child rights, menstruation, importance of mental health, safe drinking water, first aid methods, importance of basic education especially for girl child etc. need to be projected before the community to them aware of it as it indirectly helps children as they are the members of the community as well and if the community nourishes, children are defaulty the benefiitters. The contents discussed there is pre-prepared which is delivered by our volunteers in an overall interactive session.\nIn the Accupressure awareness community meeting, held at Arasini School, awareness was spread about the various acupressure points realizing that the people at the villages lack basic medication. Another meeting focussed on the menstrual health of women. People were made aware about what is menstruation and what kinds of problem women have during menstruations and their solutions were discussed. They came to know how the age old taboos have no scientific base and that the periods are completely normal, and any problem can be solved by correct consultation from the doctor and by maintaining hygiene. The latest meeting was based on the purity of water in the water sources around the village. There is a high possibility of them being contaminated by high arsenic content which is harmful for both humans as well as for the crops. Their harmful health effects, sources of contamination, methods of identification and filtration of water techniques were discussed in detail.\nSuch meetings provide an easy yet effective way for people to come together and discuss their problems and viewpoints and find solutions together for the betterment of the community as a whole. We at CRY, IIT Kharagpur are constantly putting efforts for more and more such meetings to solve as many problems as we can to bring a positive effect on their lifestyle and add meaning to their life.",
    "page": "Child Rights and You (CRY) IIT Kharagpur Volunteer Chapter",
    "source": "https://wiki.metakgp.org/w/Child_Rights_and_You_(CRY)_IIT_Kharagpur_Volunteer_Chapter"
  },
  {
    "chunk_id": "b8d1ebfe",
    "title": "Child Labour Survey",
    "text": "Child rights and you is a non-profited organisation which works in different aspects of developing and protecting a child life by different means one of the aspect is to free the country from child labour. Child labour is the service paid by the children in their childhood in any field of work. This is done by the child own due to the lack of resources for the life survival, irresponsibility of the parents or forcefully by the owner for increasing their return on investment at low investment. It does not matter the cause of child labour as all the causes force children to live their life without childhood. Childhood is the great and happiest period of the lives of everyone during which one learns about the basic strategy of the life from parents, loved ones and nature. Child labour interferes with the proper growth and development of the children in all aspects like mentally, physically, socially and intellectually. The volunteers and members of cry IIT Kharagpur has dedicated there every dime of potential to make the IIT Kharagpur campus free of child labour and for that they have conducted many surveys inside the campus in different section and has made a stats to show that the campus of IIT Kharagpur is finally free of child labour.\nA Playscape made with funds raised.",
    "page": "Child Rights and You (CRY) IIT Kharagpur Volunteer Chapter",
    "source": "https://wiki.metakgp.org/w/Child_Rights_and_You_(CRY)_IIT_Kharagpur_Volunteer_Chapter"
  },
  {
    "chunk_id": "91950c65",
    "title": "Playscape",
    "text": "Childhood is the most beautiful part of our lives, full of fun, play and activities. But some children never get to see what a playground is. To give the chance of playing in a playground to the children of Amlatoria Primary School, CRY IIT Kharagpur Chapter organised a fundraiser to build a playground. The fundraiser started in the beginning of 2018, aimed to raise funds of Rs. 1,25,000 through the crowdsourcing platform, Ketto. The designs for the playscape were made by Anthill Creations and the playscape was made from tyres and other recyclable materials. The project had a support of 159 contributors who helped by donating to make this project a reality. The contributors included students and professors of IIT Kharagpur as well as many well wishers. Door-to-door as well as social media campaigns helped to draw contributors to this. Funds were also raised for this at the stall set up during Spring Fest, in order to reach people outside Kharagpur.\nSince the playground has been constructed, children have a chance to play among various swings and mazes constructed on the ground. This play inculcates a feeling of curiosity, inquiry and adventure. Even now, the children are building memories on that playscape that they will cherish for a lifetime.",
    "page": "Child Rights and You (CRY) IIT Kharagpur Volunteer Chapter",
    "source": "https://wiki.metakgp.org/w/Child_Rights_and_You_(CRY)_IIT_Kharagpur_Volunteer_Chapter"
  },
  {
    "chunk_id": "168c9f4c",
    "title": "Installation of Projector",
    "text": "Children watching content projected using the projector installed.\nWe know that almost every child is getting education, but are they getting proper education, with sufficient modern facilities? The answer is ‘no’. Still There are schools where students don’t get good quality education and not exposed to the outer world or current affairs in their own country Eg: who is the prime minister of India.The children need special guidance to know about all these things i.e. good communication skills and other parts of education like sciences etc.\nVolunteers of CRY IIT Kharagpur are trying to tackle this problem. One of the steps taken by these volunteers is using projector in the nearest government school named Amlathuri. Due to the poor facilities in the school children are not able to learn subjects well so volunteers of CRY IIT Kharagpur bought a projector and they are giving training to the teachers sing this projector the volunteers want show some videos of English stories(so that it would be helpful for their improvement in communication skills in English and some videos related to other subjects in their course). The teachers given training to use this projector so that in the absence of the volunteers they can use it and show the videos related to respective topic.",
    "page": "Child Rights and You (CRY) IIT Kharagpur Volunteer Chapter",
    "source": "https://wiki.metakgp.org/w/Child_Rights_and_You_(CRY)_IIT_Kharagpur_Volunteer_Chapter"
  },
  {
    "chunk_id": "0effa2c3",
    "title": "Team",
    "text": "CRY IIT Kharagpur Chapter has members from all sections of IIT Kharagpur's Student Body including UG, PG and RS. Currently the administrative heads are Ashish Rathor (NA '20) and Vikram Chugh (CE '20)",
    "page": "Child Rights and You (CRY) IIT Kharagpur Volunteer Chapter",
    "source": "https://wiki.metakgp.org/w/Child_Rights_and_You_(CRY)_IIT_Kharagpur_Volunteer_Chapter"
  },
  {
    "chunk_id": "a44f6a19",
    "title": "Social Media",
    "text": "CRY - Child Rights and You is an Indian Non Government Organisation that catalyses change in the lives of underprivileged children in India by restoring their rights.\nFor more information about Child Rights and You (CRY) IIT Kharagpur Volunteer Chapter Facebook: http://www.facebook.com/CRY.IITKGP Twitter: http://twitter.com/cryiitkgp Youtube: http://www.youtube.com/user/CRYIITKGP Blog : http://www.cryeastvols.wordpress.com/ LinkedIn: http://www.linkedin.com/groups/Child-Rights-You-CRY-IIT-3825287",
    "page": "Child Rights and You (CRY) IIT Kharagpur Volunteer Chapter",
    "source": "https://wiki.metakgp.org/w/Child_Rights_and_You_(CRY)_IIT_Kharagpur_Volunteer_Chapter"
  }
]