[
  {
    "chunk_id": "info_b5b3bc",
    "title": "Druheen - Quick Facts",
    "text": "File:Druheen.jpg\nActivities | Theatre\nUnder TSG | Yes",
    "page": "Druheen",
    "source": "https://wiki.metakgp.org/w/Druheen"
  },
  {
    "chunk_id": "6203d6d8",
    "title": "History",
    "text": "Druheen is the official name of Bengali Technology dramatic society(BTDS) of IIT Kharagpur. It is one of the dramatic society which is under Technology students' Gymkhana and is a part of the Dramatics Subcommittee under the Social and Cultural Committee. This is one of the oldest societies in IIT Kharagpur.",
    "page": "Druheen",
    "source": "https://wiki.metakgp.org/w/Druheen"
  },
  {
    "chunk_id": "02e500b6",
    "title": "Activities",
    "text": "1) Independence day production\nOn 15th August, every year, Druheen perform a play which can also be called fresher's introduction production. The cast includes mainly second year and fourth year. Seniors mostly the fifth year attends the practice session for supervising and teaching the drama. This production mainly happens to encourage freshers who come new to the campus.\n2) Fresher's workshop\nThe freshers are given a thorough training of theatre oriented workshops that teache them the basics of dramatics. Skills like voice modulation, voice intensity, dramatization, body posture, stage movements, third forms, etc are taught in groups. First years along with the four governors train for three weeks at the Main Building. Occasional skits, monologues, and challenging impromptu are attempted to improve the versatility of the actor.\n3) Fresher's production\nThe play takes place mainly after the midsem. This play officially performed by the fresher's. Mainly the third year students train the juniors. The plays mostly include entertaining characters to encourage the freshers.\n4) Annual production\nThis is officially the last production of the academic session. The cast includes members of the first year to final year. Generally, the students who pass out perform in this play. The play takes place at the end of March.",
    "page": "Druheen",
    "source": "https://wiki.metakgp.org/w/Druheen"
  },
  {
    "chunk_id": "3cea43e1",
    "title": "Functioning",
    "text": "Selection procedure\nDruheen selection auditions are held once per year, only for first years from both UG and PG. The society selects a batch of 25-30 first years (UG) and 2-5 PG at the beginning of the academic year soon after the Independence day production. The selection procedure consists of tasks that judge voice modulation, intensity, speech and diction, confidence and acting skills.\nOrganizational Structure\nDruheen has four governors selected by the society seniors every year who takes care of the society and represent it in the Gymkhana. Overall co-ordination during productions, outstations and competitions are handled by the governors.",
    "page": "Druheen",
    "source": "https://wiki.metakgp.org/w/Druheen"
  },
  {
    "chunk_id": "3c5a36f8",
    "title": "Governors",
    "text": "List of Governors\n2020-21 | Swastik Ballav(PH) | Koomar M. Dey(CH) | Sujabrata Mallick(IE) | Iman Burman(EC)\n2019-20 | Arka Mondal (BT) | Soumili Das (GG) | Avirup Biswas (MT) | Puspendu Chowdhury (EC)\n2018-19 | Samya Samanta (CY) | Anik Mitra (BT) | Sayan Naskar (AE) | Debalina Chowdhury (MF)\n2017-18 | Souvik Bhowmik (MT) | Debanjan Nayak (MT) | Mehul Dasgupta (QD) | Sumit Das(ME)\n2016-17 | Arna Ghosh | Saion Roy (EC) | Sourav Das | Soham Debnath\n2015-16 | Navojit Saha(CH) | Ria Biswas(CH) | Kastur Bhattacharya | Anuran Gayen(CY)\n2014-15 | Sikhar Patranabis | Rishita Das | Surya De | Bhaskar Sarkar\n2012-13 | Sambuddha Adhikari | Sambit Debnath | Atreyee Bhaumik | Saugata Neogy\n2011-12 | Anirban Gupta | Swarnendu Mandal | Subhajit Bera",
    "page": "Druheen",
    "source": "https://wiki.metakgp.org/w/Druheen"
  },
  {
    "chunk_id": "d6219550",
    "title": "See also",
    "text": "• Pravah\n• Encore\n• Prasthanam",
    "page": "Druheen",
    "source": "https://wiki.metakgp.org/w/Druheen"
  }
]