[
  {
    "chunk_id": "acad616c",
    "title": "Eastern Technology Music Society",
    "text": "Eastern Technology Music Society , popularly known as ETMS , is one of the two official music societies in IIT Kharagpur, which takes care of the eastern music culture in the campus. The society aims at spreading diverse musical sections of eastern music in both hindustani and carnatic styles, nurturing and motivating musicians, inculcating values and expression through music, and develop good music taste among our audience.",
    "page": "Eastern Technology Music Society",
    "source": "https://wiki.metakgp.org/w/Eastern_Technology_Music_Society"
  },
  {
    "chunk_id": "66b9e6aa",
    "title": "Selection Procedure",
    "text": "ETMS selection auditions are held twice in a year, in the autumn semester for all students (UG/PG), around the month of July/August and January. Selection procedure generally consist of two rounds, where the first round is a preliminary screening round to assess basic musical ability, comfort with the instrument (or singing), basic knowledge, and screened candidates are invited to give a second round of auditions where they are given few (2-3) songs to prepare. For instrumentalists, the songs that are decided are generally same for everyone, and they are chosen such that they cover a diverse spectrum of techniques/skills in the particular instrument, and for vocalists, the songs are given on the basis of the pitch range and the singer's tonality. There is generally a gap of 3-4 days between both rounds of the auditions.",
    "page": "Eastern Technology Music Society",
    "source": "https://wiki.metakgp.org/w/Eastern_Technology_Music_Society"
  },
  {
    "chunk_id": "404950ba",
    "title": "Organizational Structure",
    "text": "ETMS has three governors selected by the society seniors every year who govern the society and represent it in Gymkhana. Overall co-ordination during practices, productions and competitions are handled by the governors.",
    "page": "Eastern Technology Music Society",
    "source": "https://wiki.metakgp.org/w/Eastern_Technology_Music_Society"
  },
  {
    "chunk_id": "6f3a5e94",
    "title": "Activities",
    "text": "The primary activities of the society include organizing and performing two productions every academic year, one in the Autumn Semester and the other in Spring Semester. The playlist is decided few weeks prior to the production through a consensus of all the members in the society. Songs are chosen so that the playlist is as diverse as possible, consisting of genres such as Classical, Classical Fusion, Fusion with western genres and songs from Bollywood.",
    "page": "Eastern Technology Music Society",
    "source": "https://wiki.metakgp.org/w/Eastern_Technology_Music_Society"
  },
  {
    "chunk_id": "64b44db2",
    "title": "Autumn Production",
    "text": "ETMS performs the Annual Foundation Day of the Institute in the autumn semester on 18th August. This is also the first time the new inductees get the chance to perform for the society.",
    "page": "Eastern Technology Music Society",
    "source": "https://wiki.metakgp.org/w/Eastern_Technology_Music_Society"
  },
  {
    "chunk_id": "a6f6ac4d",
    "title": "Spring Production",
    "text": "ETMS performs the spring production in the spring semester generally in the month of January, the starting day of Spring Fest. This production also gives the platform to showcase our talent to viewers from outside as well. This happens to be the final production of the graduating batch and they get a chance to play some of their favourite songs for one last time in KGP.",
    "page": "Eastern Technology Music Society",
    "source": "https://wiki.metakgp.org/w/Eastern_Technology_Music_Society"
  },
  {
    "chunk_id": "2bf7181d",
    "title": "Governors",
    "text": "List of Governors\n2019-20 | Paritosh Jawalikar | Raj Narayanan | -\n2018-19 | Manan Makhija | Mohit Verma | Nishok Sundarresan\n2017-18 | Ashandeep Singh Sekhon | Mohnish Singh Jaswal | Sreekar Saripalli\n2016-17 | Abhishek Bhowmick | Vinay Bhaskar | Yash Deo\n2015-16 | Gaurav Kumar Jha | Nayan Mallick | Sanat Panda\n2014-15 | Chandrani Haldar | Rohit Narurkar | Satyajit Sai\n2013-14 | Apoorv Raj | Siddharth Vashishtha | Sricharan Sunder\n2012-13 | Anurag Bishnoi | Gaurav Gupta | Kaushik Sivaramakrishnan\n2011-12 | Ankit D.P. | Hari Cherupalli | Juhi Agrawal",
    "page": "Eastern Technology Music Society",
    "source": "https://wiki.metakgp.org/w/Eastern_Technology_Music_Society"
  }
]