[
  {
    "chunk_id": "info_371dbe",
    "title": "Pravah - Quick Facts",
    "text": "Activities | Theatre\nWebsite | Facebook: https://www.facebook.com/Pravaah Instagram : https://www.instagram.com/pravah_iitkgp/ YouTube: https://www.youtube.com/channel/UCFOMxsIY4gmOQiy7F5sFWxQ\nUnder TSG | Yes",
    "page": "Pravah",
    "source": "https://wiki.metakgp.org/w/Pravah"
  },
  {
    "chunk_id": "48b7dda6",
    "title": "Pravah",
    "text": "Pravah , previously known as Hindi Technology Dramatics Society (H.T.D.S.) ,as the name suggests, is the official Hindi Dramatics Society of I.I.T. Kharagpur. It was founded in 1967 by Mr. R.K Bagrodia.\nPravah comes under the Technology Students' Gymkhana and is a part of the Dramatics Subcommittee under the Social and Cultural Committee. Since its inception, Pravah has been highly successful in bringing the true spirit of theatre to life and in demonstrating the power of emotions and thoughts through its stage plays and nukkad nataks (Street Plays).\nThe society although, does not hold any bias to a particular language and does not consider proficiency in Hindi as a metric during selections , which is evident from the fact that many of its members are not well versed in Hindi, but continue to contribute with great enthusiasm.\nThe Pravah family, with 112 active members currently, boasts of individuals with a keen sense of theatrical and street art! Our members have also brought accolades to their halls with their performances in Hall dramatics and have featured in various Short Films for various productions by the Filmmaking club for Inter IIT Cultural Meets.",
    "page": "Pravah",
    "source": "https://wiki.metakgp.org/w/Pravah"
  },
  {
    "chunk_id": "568cbd9a",
    "title": "Selection Procedure",
    "text": "Pravah auditions are held once per year, for the first years, in the first or second week of August for active membership for all four/five years. The society selects a batch of around 35 first years (UG/PG) at the beginning of the academic year soon after the welcome production. The selection procedure consists of tasks that judge voice modulation, intensity, speech and diction, confidence, and acting skills.\nIt is not at all necessary that you must have a proper hold of Hindi, to be a part of Pravah. Also in rare cases, auditions have been held for a second time if it is found that a lot of people have missed the selections.",
    "page": "Pravah",
    "source": "https://wiki.metakgp.org/w/Pravah"
  },
  {
    "chunk_id": "207b892a",
    "title": "Organizational Structure",
    "text": "Pravah has four governors appointed every year who govern the society and represent it in the Technology Student's Gymkhana. Training of freshers and overall co-ordination during productions, out-stations, and competitions are handled by the governors.",
    "page": "Pravah",
    "source": "https://wiki.metakgp.org/w/Pravah"
  },
  {
    "chunk_id": "5c383871",
    "title": "Introductory Seminar(Welcome Production)",
    "text": "The first act of the year (referred to as the Welcome Production ) is performed during late-July to Early-August.This introduces the first year to Pravah and it’s various activities.",
    "page": "Pravah",
    "source": "https://wiki.metakgp.org/w/Pravah"
  },
  {
    "chunk_id": "f5bd8bab",
    "title": "Fresher’s Workshop",
    "text": "The freshers are given a thorough training of theatre oriented workshops that teaches them the basics of dramatics. Skills like voice modulation, voice intensity, dramatization, body posture, stage movements, third forms, etc are taught in groups. First years along with the four governors train for three weeks at the T.O.A.T. (Tagore Open Air Theater). Occasional skits, monologues, and challenging impromptu are attempted to improve the versatility of the actor. Both PG and UG's first years are welcome to take part in the workshop. Other than teaching the very basics of dramatics these workshops are also a great place to meet new people and interact with the seniors of Pravah.",
    "page": "Pravah",
    "source": "https://wiki.metakgp.org/w/Pravah"
  },
  {
    "chunk_id": "ff1d8e18",
    "title": "Fresher’s Production",
    "text": "It is the first act performed by the freshers. It is performed during late-October to early-November. For its first production of the year Pravah generally picks up comical plays to entertain the freshers. The main objective of this play is for the first years to get an experience of what a play is and to provide them with a chance to display their newfound skills.",
    "page": "Pravah",
    "source": "https://wiki.metakgp.org/w/Pravah"
  },
  {
    "chunk_id": "b97948ad",
    "title": "Nukkad",
    "text": "Nukkad Natak is a form of art play whereas the actors perform on a street with a live audience. The purpose of Nukkad Natak is to spread awareness about important social/political issues that plague our society. Pravah participates in the nukkad natak event of Spring fest in the month of January. Only the first years participate in it and are guided by the seniors of society.",
    "page": "Pravah",
    "source": "https://wiki.metakgp.org/w/Pravah"
  },
  {
    "chunk_id": "3364a003",
    "title": "Rangmanch",
    "text": "Every year the members of Pravah participate in Rangmanch which is the stage play competition held during Spring fest in January.",
    "page": "Pravah",
    "source": "https://wiki.metakgp.org/w/Pravah"
  },
  {
    "chunk_id": "b51433ac",
    "title": "IIM Calcutta/IIT Kanpur/IIM Bangalore",
    "text": "Every year the freshers of Pravah along with the governors visit one or more colleges including IIM Kolkata, IIT Kanpur, and IIM Bangalore to compete in stage and street play competitions.",
    "page": "Pravah",
    "source": "https://wiki.metakgp.org/w/Pravah"
  },
  {
    "chunk_id": "de9bc97a",
    "title": "Annual Production",
    "text": "The last act of the year (referred to as the Annual Production) is performed during End-March to Early-April. The Annual Production sees the most diverse crowd play together.",
    "page": "Pravah",
    "source": "https://wiki.metakgp.org/w/Pravah"
  },
  {
    "chunk_id": "1be0ef11",
    "title": "List of Plays",
    "text": "• Laila Majnu\n• Resonating Silence (Mime)\n• Ashanti Niwas\n• Maharathi\n• Bechara Mara Gaya\n• Ravanayan\n• Bali aur Shambhu\n• Matadeen Chand Par\n• Gullak\n• Kafan\n• Lost in Time (Audio Play)\n• Audition\n• Talash\n• Gumnaam Parindey\n• A.I.D.S-Acquired Individual Discrimination Syndrome\n• Tajmahal ka Udghaatan\n• Platform Number 6\n• Kaafiro ke Namaaz\n• Kahani Main Twist\n• Khwahishein\n• Charandas chor\n• Silence! The court is in session.\n• Inspector Calls\n• Sakharam Binder\n• Perfect Strangers\n• Lights Out\n• Naya Nazariya\n• Janch Padtal\n• Kasam paida karne wale ki\n• Shaant Adalat\n• Ayan\n• Naina Thug lenge\n• Jaanch Padtaal\n• Do ghooth Zindagi ke\n• Shalu ka Kamra\n• Humse na ho payega\n• Muaavze - ek vayang\n• Dil Ki Dukaan (Hasya Natak)\n• Saza-e-Sharan\n• Entertainment engineer in association with PRAVAH presented \"SHE- when GOD fell in love with an atheist\"",
    "page": "Pravah",
    "source": "https://wiki.metakgp.org/w/Pravah"
  },
  {
    "chunk_id": "5eeb1758",
    "title": "Nukkad",
    "text": "• Andher Nagri\n• Marzii\n• Kathputhli\n• Jhootha Sach\n• Junta hi Kanoon\n• Being Animal\n• Ehsaas\n• Khamoshiyan\n• Naya nazariya\n• Daaru pe Nukkad",
    "page": "Pravah",
    "source": "https://wiki.metakgp.org/w/Pravah"
  },
  {
    "chunk_id": "2cd375ff",
    "title": "List of Governors",
    "text": "2023-2024 | Sagar Sahu | Kuhu Sharan | Ranjeeta Mashal | Vedant Katole\n2023-2024 | Rhythm Jindal | Anamika Tiwary | Rahul Sharma | Shashank Shekhar\n2022-2023 | Bhagyashree Sharma | Kshitija Bobade | Gautam Jaju | Manas Mohan Sharma\n2021-2022 | Bhanvi Suryavanshi | Arnav Bhutda | Aman Kant | Rohan Mehta\n2020-2021 | Suman Kumari | Abhyudaya Nilosey | Sudhanshu Baldawa | Debjyoti Chakraborty\n2019-2020 | Akshata Sharma | Mukund Khanna | Karan Mahajan | Jitender Swami\n2018-2019 | Swati Rawat | Vaibhav Gambhir | Shivam Rohila | Soumya Yadav\n2017-2018 | Karnika Vashisth | Zaki Ahmed | Puru Bansal | Shakti Singh Meena\n2016-2017 | Astha Pandey | Preet Singh Jheeta | Rishi Saxena | Archit Singh\n2015-2016 | Drishti Hora | Bhavya Kapse | Ojas Tayal | Prasad Fadke\n2014-2015 | Vaidehi Bharadwaj | Shyla Gangwar | Chinmay Gandhi | Vivek Chaudhary",
    "page": "Pravah",
    "source": "https://wiki.metakgp.org/w/Pravah"
  }
]