[
  {
    "chunk_id": "cec05f3e",
    "title": "Prodex",
    "text": "ProDex is a technical society focused on promoting Product Design , Hardware modelling and Innovation among the students of IIT Kharagpur and focused on developing innovative products to real life problems. A 3 tier team of 20+ product designing enthusiasts with a compelling history of success in regional and national level hackathons.",
    "page": "Prodex",
    "source": "https://wiki.metakgp.org/w/Prodex"
  },
  {
    "chunk_id": "e37c9c09",
    "title": "Objectives",
    "text": "• Nurture the habit of Hardware Modelling among the student fraternity.\n• Provide financial, mechanical help and the required resources to transform an innovative idea into a mechanical product.\n• Fuel the technological advancement of India through its activities.\n• Inspire students under plus2 level to participate in IGNITE, a competition conducted by CBSE in association with National Innovation Foundation.\n• Highlight the latest technological advancements in India and throughout the world.",
    "page": "Prodex",
    "source": "https://wiki.metakgp.org/w/Prodex"
  },
  {
    "chunk_id": "58d3f7c2",
    "title": "History",
    "text": "Established in '2012' by a bunch of passionate people who dreamt big, and shared a common interest in designing and building things out of their own ideas.",
    "page": "Prodex",
    "source": "https://wiki.metakgp.org/w/Prodex"
  },
  {
    "chunk_id": "c58522a2",
    "title": "Activities",
    "text": "• ANDROIDEX, an android application making workshop (292 attendees) and Freshers’ Introductory Workshop 2013\n• FIGULUS, first ever Web coding workshop (403 attendees) in IIT Kharagpur and conducted Webpage Design competition (158 participants)\n• Aerotrix Super Challenge, RC Aircraft design and fabrication workshop and competition (9 teams) in IIT Kharagpur\n• TaSafe, women safety device against assailant attacks.",
    "page": "Prodex",
    "source": "https://wiki.metakgp.org/w/Prodex"
  },
  {
    "chunk_id": "ae358e4f",
    "title": "Governors",
    "text": "List of Governors\n2019-20 | Shubham Kakde | Vivek Wankhade | Mann Goel\n2015-17 | Manish Kumar | Amol Sakhale | -\n2014-15 | - | - | -\n2013-14 | - | - | -\n2012-13 | - | - | -",
    "page": "Prodex",
    "source": "https://wiki.metakgp.org/w/Prodex"
  }
]