[
  {
    "chunk_id": "info_4dab55",
    "title": "Public Policy and Governance Society, IIT Kharagpur - Quick Facts",
    "text": "Founded | 17th Mar 2023 ( 2013 )\nFounders | Chirag , Hariom\nNumber of members | 150 -160\nWebsite | ppgsiitkgp.in\nContact | [email protected]\nMotto | EMPOWER. INSPIRE. TRANSFORM.\nRule Book: | https://online.fliphtml5.com/zvxxi/joiw/",
    "page": "Public Policy and Governance Society, IIT Kharagpur",
    "source": "https://wiki.metakgp.org/w/Public_Policy_and_Governance_Society,_IIT_Kharagpur"
  },
  {
    "chunk_id": "e51ce341",
    "title": "Public Policy and Governance Society, IIT Kharagpur",
    "text": "Public Policy and Governance Society, IIT Kharagpur is India's largest student-run public policy organization, dedicated to fostering a radical attitude toward policy development and encouraging active participation in the Indian government system among the student community. Through various events and initiatives, PPGS aims to cultivate a sense of responsibility and engagement toward building Bharat.\nFrom Metakgp Wiki\nVision Nurture the student community to develop a radical attitude towards public policy leading to an affirmative impact in the society. Foster the culture of public service to shape a more informed, effective, and equitable governance landscape in India and beyond. Revitalize IIT Kharagpur’s legacy of producing next generation Civil Servants . Mission To create a dynamic learning environment that prepares students for leadership in public policy by providing them with the knowledge, skills, and experience to analyse public policy issues, develop alternative policy solutions, and communicate effectively about public policy. Activities UPSC Talks Year 2023 ( 10 Alumni cracked UPSC CSE ) : Mr. Pourush Sood (AIR: 29 UPSC CSE 2022 ) Ms. Anju Joon (AIR : 701 UPSC CSE 2022) Mr. Abhinav J Jain (AIR : 14 UPSC CSE 2021 ) Mr. Kumar Abhinav (Deputy Secretary) Mr. Abhinandan Kumar (IRS & Ex ISRO Scientist) Mr. Manoj K. Jha (Founder: GS SCORE), Mr. Gorantla Sai Charan (AIR: 01 UPSC ESE 2023). Year 2024 ( 11 Alumni cracked UPSC CSE ): Mr.Shivam Kumar (AIR:19, 2023), Mr.Abhay Rajendra Daga (AIR: 185, 2023), Mr.Sanjay Yadav (AIR:811, 2023) , Mr. Karn Satyarthi (AIR: 09, 2015), Mr. Krishna Bajpai (IAS, 2007), Mr. Rituraj Misra (IRPS, 2010), Mr.Himanshu Thapliyal (AIR-1 UPSC ESE 2024) and Mr.Rohit Kumar (AIR-8 UPSC ESE 2024) Mentorship Program Mentors who are our Alumni in Civil Services will directly provide one-on-one mentorship to the KGP students and Alumni, guide them to solve their queries, and also engage in periodic interactions with the civil aspirants. Currently, more than 75 students have been provided mentorship. Sansad - Youth Indian Parliament \" Sansad \"- the replica of Indian Parliament event cum competition of Public Policy and Governance Society, endeavors to introduce the peculiar Parliamentary protocols, procedure, questionnaire, articulation and argument. This event is a recreation of the Indian Parliamentary system and aims to produce the best possible political ethos and articulation from its participants. Year 2025 PPGS Expansion Expanded PPGS to four colleges with the goal of promoting nation-building across India. This expansion sparks students’ interest and motivates them to contribute to the nation by gaining insights into policy and governance systems. Active participation and exposure through PPGS offer a practical perspective, helping students identify key areas where they can make a significant impact. Expansion College: PPGS Vidyavardhaka College of Engg , PPGS University Institute of Technology Burdwan Learning Beyond the Classroom Learning Beyond the Classroom where we aim for an early engagement with school students with nation building by targeting 30 schools nationwide . By reaching 12,000+ students directly and a passive audience of 1 Lakh per year, we aim for national development and empower the next generation to contribute to the nation’s future. Policy Podcast Policy Podcast is an online event dedicated to exploring key issues in policy and governance . Featuring expert interviews and insightful discussions, our podcast delves into topics like public health, economic strategies, environmental regulations, and social justice. Each episode simplifies complex subjects and offers fresh perspectives on how policy decisions impact our world. Year 2024: IAS Vivek Atray, IFoS Sanjay Kr. Srivastava, Former Additional DGP Maharashtra Kulwant Sagarnal, Former Director General Home Guards Mrithyunjay Kr. Singh, Secretary Ministry of Tourism Mr. Vinod Zutshi, Mr. Ajoy Ashirwad Mahaprashasta (Editor, The Wire), Mr. Sudhanshu Kaushik (Founder of YIF and NAAIS), Mr. Chirag Shakuntala Bariya (Lead Consultant at International Innovation Corps), Mr. Rakesh Dubbudu (Founder of Factly), Sahithi Sadasivuni Diplomatic Discourse Series (DDS) Diplomatic Discourse Series is an innovative initiative aimed at promoting mutual understanding and knowledge exchange between young individuals and the diplomatic community . Going beyond traditional lectures, the series involves dynamic interactions with ambassadors , consulate generals , diplomats , and foreign policy experts. This engagement provides student envoys with invaluable insights into the complex workings of the international arena, leading to a transformative experience that broadens their perspectives. Year 2023: Thailand Consulate Mr. Pichaya Lapasthamrong , Bhutan Consulate Ms.Kezang Dema , Former Ambassador Special Advisor of PM Mr. Deepak Vohra Insight Ignite Insight Ignite dedicated to nurturing the holistic growth of our Society members , through engaging intra-society events. Furthermore, we actively support our members in their journey towards excellence in the field of public policy, facilitating research on pivotal governance topics. We aim to ignite the flames of ambition, knowledge, and personal growth, ensuring that our members are well-prepared and well-rounded individuals poised for success in their endeavors. Policy Research Policy Research initiative is a testament to our commitment to intellectual exploration. Through rigorous research, we craft insightful blogs on governance issues, connecting the dots across various domains. Additionally, we engage in lively discussions with students on government bills, providing a platform for critical insights and informed opinions. Additionally, we keep students informed with articles on current affairs and highlight significant days. We aim to bridge the gap between academia and real-world governance among students. Public Policy Internship Programme Internship Programme is designed to empower students by bridging the gap between academia and real-world public policy internships & projects. We offer comprehensive guidance on various public policy internships, including eligibility criteria and CV enhancement strategies. Our guidance extends to helping students understand the significance of contributing to the field, ensuring that their journey into public policy is both fulfilling and impactful. Campus Hangout An informal event where a group of 7-8 students had the chance to interact with the Young Achiever Alumni Awardee during a casual 2.2 walk. This event provides a unique opportunity for students to engage in meaningful conversations, ask questions, and gain insights from an accomplished alumnus in a relaxed and open setting. Year 2024: Click here to know the names Nationwide Competition Year 2024: AI Blueprint For BHARAT - Case Study Challenge , Masked Minds - Anonymous Policy Debate , BRAHMASTRA 2024 - Case Competition with Five IITs Structure The team of PPGS , IIT Kharagpur consists of the following hierarchy: Advisors (Fourth & Fifth Years) Governors & Executive Heads (Third Years UG & Second Year: PG) Executive Members (Second Years: UG & First Year: PG) Associate Members (First Years: Spring Sem) Junior Associates (First Years: Autumn Sem) Governing Body Founders: Chirag , Hariom Governors Executive Head: Events & Outreach Executive Head: Sponsorship Executive Head: Policy Research Executive Head: Design & Videography Executive Head: Students' Welfare Executive Head: Tech & Media Executive Head: PG team 2025-26 Sarthak R Patel, Akshat Srivastav, Sumanta Sarathi Roy Sameera Jenna, Koena Biswal, Rakshita Panwar Aryan Rathaur, Akshara Jain Tanmai Raghava, Natasa Pradhan Vikas Arjun, Raushan Patel Anu Kashyap Komanabelli Balaji --- 2024-25 Neeharika Gunupuru, Omkar Desai, Shivam Kumar Tejashwi Jha, Anup Chimkar, Hariprasad Chaitanya Sharif Hossain Sarkar, Pratik Shere --- Nabil Rizwan --- Yash Priyadarshy Udit Bhaskar, Harnoor Kaur 2023-24 Prajay Mudavath, Tejas Kamble, Saswat Dash, Rashmita Sahoo --- --- Agrim Chaudhury, Thiruvignesh, Giri Prasad Abhishek Tiwari Mayank Wasnik Sabiya mulla, Ojaswi Thapliyal Important Links • Website: ppgsiitkgp.in • Email: [email protected] • LinkedIn: www.linkedin.com/company/civil-services-club-iitkgp/ • Instagram: www.instagram.com/ppgs.iitkgp/ • Rule Book: https://online.fliphtml5.com/zvxxi/joiw/ • Facebook: www.facebook.com/ppgs.iitkgp",
    "page": "Public Policy and Governance Society, IIT Kharagpur",
    "source": "https://wiki.metakgp.org/w/Public_Policy_and_Governance_Society,_IIT_Kharagpur"
  }
]