[
  {
    "chunk_id": "cd9a3478",
    "title": "Rajasthan Cultural Association",
    "text": "Rajasthan has a rich ancient culture and glorious history. Drenched in royal grandeur and soaked into glorious history, Rajasthan is most charming in its flora and fauna. So, we here come forward to enrich the lives of students and provide them with a broad platform where they can learn a lot of skills, showcase their talents and develop self-confidence and potential to achieve heights of glory. So, Rajasthan Cultural Association conduct various events at regular intervals for proper intermixing of students with one another for their all-round development.",
    "page": "Rajasthan Cultural Association",
    "source": "https://wiki.metakgp.org/w/Rajasthan_Cultural_Association"
  },
  {
    "chunk_id": "cfb94908",
    "title": "Origin",
    "text": "The foundation stone of this journey was laid with the idea of brotherhood and unity among diversity. It was an attempt to encourage students to come together to learn extracurricular activities beyond their academics. RCA has grown up as a prestigious organization over the years, with more than 50 alumni placed at various corporate and government organizations. A dedicated team is working towards achieving new milestones every year.",
    "page": "Rajasthan Cultural Association",
    "source": "https://wiki.metakgp.org/w/Rajasthan_Cultural_Association"
  },
  {
    "chunk_id": "230c6a2b",
    "title": "Vision",
    "text": "Our vision is to spread the rich culture of Rajasthan in the KGP community along with the celebration of festivals which are a major missing for a student far from his home. We are always progressing on the path of reaching more KGPians and involving them in various cultural activities",
    "page": "Rajasthan Cultural Association",
    "source": "https://wiki.metakgp.org/w/Rajasthan_Cultural_Association"
  },
  {
    "chunk_id": "62042e83",
    "title": "Events",
    "text": "• Freshers' Welcome\n• Malhar-The Cultural Night\n• Patang-The Kite Festival\n• Khamma Ghani-Food Festival\n• Rammat-Sports Event\n• Farewell & Trip\n• Capture the Thrill\n• Online Quiz\n• Education Drive",
    "page": "Rajasthan Cultural Association",
    "source": "https://wiki.metakgp.org/w/Rajasthan_Cultural_Association"
  }
]