[
  {
    "chunk_id": "info_c1bbd4",
    "title": "Spectra - Quick Facts",
    "text": "Activities | Art\nUnder TSG | Yes",
    "page": "Spectra",
    "source": "https://wiki.metakgp.org/w/Spectra"
  },
  {
    "chunk_id": "4cb6589a",
    "title": "Spectra",
    "text": "Big Picture 2023\nSpectra - the 'Fine Arts and Design Society of IIT Kharagpur' aims to strengthen and promote the roots of fine arts among the students of IIT Kharagpur . With many talented artists and exhibitionists as its members, it promises to be a valued treasure for the connoisseurs of fine arts.",
    "page": "Spectra",
    "source": "https://wiki.metakgp.org/w/Spectra"
  },
  {
    "chunk_id": "d94d4cbf",
    "title": "List of activities",
    "text": "Several events are conducted every year by Spectra.",
    "page": "Spectra",
    "source": "https://wiki.metakgp.org/w/Spectra"
  },
  {
    "chunk_id": "1b091b0d",
    "title": "ArtBeat : Celebrating Creativity at IIT Kharagpur",
    "text": "Artbeat, IIT Kharagpur's annual art exhibition organized by Spectra, is a three-day extravaganza held in March. It showcases the creative talents of the campus community across various mediums, from traditional art to digital creations and photography.\nIn April 2023, Artbeat embraced the theme \"Resurrection,\" featuring a handcrafted Phoenix as its centerpiece. This choice of theme held profound significance, as the event marked a triumphant return after a three-year hiatus, symbolizing the revival of creativity and culture at IIT Kharagpur.\nDay 0 served as the opening act, setting the stage with a remarkable painting that beautifully symbolized the delicate cycle of nature and the far-reaching impacts of excess. This artwork provided a poignant reflection on the disruptive effects of the pandemic on culture and the resilient spirit that emerged in its wake. It inspired a renewed appreciation for heritage and culture, emphasizing their importance in our lives.\nDay 1 was a vibrant continuation, featuring art and origami workshops that echoed Picasso's timeless belief that \"Every child is an artist.\" Attendees had the opportunity to explore their creative potential and rediscover their inner artists. Live Caricature Sketching added a touch of artistic flair, capturing the essence of individuals and turning ordinary moments into cherished memories. Notably, hosting students from Jagriti Vidya Mandir created a sense of community engagement and inclusivity, where the joy of art was shared with young minds eager to explore their artistic passions.\nDay 2 was an exploration of terracotta painting, a medium that celebrated the rich interplay of color, pattern, and texture. It was a mesmerizing experience as clay kulhads were transformed into stunning works of art, evoking therapeutic and calming vibes. This day showcased Artbeat's unwavering commitment to nurturing creativity and fostering inclusivity, providing a welcoming space for all to express themselves through art.\nInteractive elements like the \"Color Me\" wall and a Photobooth engaged attendees, drawing a crowd of over 1200 participants. Artbeat remains a vibrant celebration of art and creativity at IIT Kharagpur, where talent and imagination take center stage, inspiring both the campus community and visitors.\nArtbeat 2023, with its \"Resurrection\" theme, not only marked a triumphant return but also rekindled the flames of creativity and culture. It celebrated the enduring power of art to inspire, heal, and connect communities. As the event unfolded over three remarkable days, it served as a testament to the resilience of the human spirit and the profound impact of artistic expression. Artbeat continues to be a beacon of creativity at IIT Kharagpur, where talent and imagination flourish, enriching the lives of all who participate.\nThe most recent edition of ArtBeat occurred in April 2023, featuring the theme of \"Resurrection.\" The focal point of the exhibition was a meticulously handcrafted Phoenix symbolizing the theme. The event included numerous paintings, some as large as 6x8 feet, with over 150 artworks submitted in total. Additionally, various interactive elements such as a \"Color Me\" wall and a Photobooth were incorporated. The event featured workshops on character design, origami, and terracotta painting, enhancing the educational aspects of the three-day event. With over 1200 attendees, the event garnered an impressive turnout throughout its duration.\n• Layered cut-out wire portrait masterpiece of Alan Rickman Layered cut-out wire portrait masterpiece of Alan Rickman\n• Work in progress for the big picture of a reindeer at Artbeat '17\n• Live portrait making in progress\n• The Spectra team after Artbeat '17\nDiwali Installation by Spectra 2022. Theme : \"Underwater Fantasy\"",
    "page": "Spectra",
    "source": "https://wiki.metakgp.org/w/Spectra"
  },
  {
    "chunk_id": "32f15749",
    "title": "Diwali Installation",
    "text": "Spectra, the Fine Arts Society of IIT Kharagpur, is renowned for its annual Diwali installation event, featuring themed art and craft decorations. In a striking example, they highlighted coral degradation through a blend of origami artworks and creative lighting.\nOn October 24th, 2022, Spectra transformed Diwali into an underwater fantasy, seamlessly blending tradition with creativity. The \"Underwater Fantasy\" theme transported attendees into a captivating world beneath the waves, using intricate decorations and stunning artwork. This fusion of tradition and innovation left a lasting impression, showcasing the power of art and creativity to inspire during the Festival of Lights.",
    "page": "Spectra",
    "source": "https://wiki.metakgp.org/w/Spectra"
  },
  {
    "chunk_id": "ed5d261a",
    "title": "Workshops",
    "text": "Spectra conducts an array of annual workshops, both internally and externally, aimed at fostering the creative potential of students on campus. These workshops cover various activities, including Cartooning, Clay Modelling, Thumb Painting, Glass Painting, Tattoo Making, Watercolor Painting, Origami, Traditional painting, and more.\nIn 2023, the Watercolour and Photoshop workshops were held internally for the Spectra members. Others like traditional painting and cartooning workshops were open to all.\nParticipants showing off their work at the coffee painting workshop",
    "page": "Spectra",
    "source": "https://wiki.metakgp.org/w/Spectra"
  },
  {
    "chunk_id": "b6483739",
    "title": "Other activities",
    "text": "In association with the Gopali Youth Welfare Society , on a fine Sunday, Spectra painted a wall of Jagriti Vidya Mandir. An online event, Wall-de-Art is conducted every year during the season of Hall Days , and the most creative pieces of art are awarded. During Diwali, Spectra made an artwork that was installed in the Institute Main Building .",
    "page": "Spectra",
    "source": "https://wiki.metakgp.org/w/Spectra"
  },
  {
    "chunk_id": "e037d186",
    "title": "Organization structure",
    "text": "At Spectra, the organization hierarchy is as follows:\n• 1st years: Associate Members\n• 2nd years: Members\n• 3rd years: Heads, Junior Coordinators and Senior Members\n• 4th years: 4 Governors and 1-2 Seniors Coordinators\n• 5th years: Convenors\nGovernors Batch ( 2023-24)\nGovernors | Swastika Mandal | Vidhi Baid | Jai Kumar Soni | Sabyasachi Sabar\nSenior Coordinators | Pratyasha Nath\nHeads Batch ( 2023-24)\nDigital and Public Relations Heads | Purba Saren | Rindhya Reddy Morredigari\nEvents Heads | Anusha Borole | Srinath Sahu\nGymkhana and Finance Heads | Adwit Barun | Rachit Gupta\nLogistics Head | Suvojit Das",
    "page": "Spectra",
    "source": "https://wiki.metakgp.org/w/Spectra"
  },
  {
    "chunk_id": "e37373bd",
    "title": "Get involved",
    "text": "Our Instagram has 2000+ followers with regular updates for all our upcoming events and artworks with important links to all our social media handles in the bio. Join our WhatsApp Art community to to nurture and appreciate artists of IIT Kharagpur.\nSpectra has a Facebook page with 8000+ likes where the timely activities of the society are shared and also is a platform for non-members to get their artworks recognized and appreciated. Spectra Circle , is an open Facebook Group, a creative hub where art enthusiasts share their knowledge and ideas of various art forms.",
    "page": "Spectra",
    "source": "https://wiki.metakgp.org/w/Spectra"
  }
]