[
  {
    "chunk_id": "3fa60876",
    "title": "Team KART",
    "text": "TeamKART is a group of students from IIT Kharagpur who like to explore the practical side of automobile engineering.TeamKART is officially a sponsored research project under the Sponsored Research and Industrial Consultancy Cell (SRIC) and the Department of Mechanical Engineering, IIT Kharagpur. The team designs, manufactures and tests Formula style prototype, single-seat race cars. It represents IIT Kharagpur at national and international Formula Student competitions, Formula Student, UK and Formula Bharat .",
    "page": "Team KART",
    "source": "https://wiki.metakgp.org/w/Team_KART"
  },
  {
    "chunk_id": "9c4b3135",
    "title": "About us",
    "text": "The purpose of the group is to develop formula student race cars. Formula Student is widely regarded as one of the biggest and most challenging student-level engineering competitions in the world. It intends to give students a great learning experience across all domains of engineering industry: design, manufacturing, project management, financial management and business planning.\nThe journey of each new car begins with its design. This involves application of all the classroom knowledge in actual engineering problems to achieve the set goals for the car and its different systems, through modelling, simulation and experimentation. The next challenge is to bring this design to reality, by checking the feasibility of various designs, fabricating different parts of the car through various manufacturing processes, and assembling them to the final stage. The last phase involves testing and tuning the systems of the car to rectify problems and achieve set targets.\nSupporting the car though this journey are the aspects of project management, cost planning,sponsorship and public relations. Effective project management is important to ensure that the entire production of the car, from designing, to manufacturng, to testing gets completed on time, and with positive outputs. Careful financial planning and management is required to ensure the best utilization of team's resources. Sponsorships are acquired from various industry partners to develop the team's resouce pool. Good public relations have to be maintained with various industry partners of the team, as well as with the team's supporters though meetings, social media and public events.\nAs a part of one of the events in the competition, the team also develops a complete business plan to launch the car as a product in the market. This involves performing an in-depth case study and presenting a plan on the business strategy, finance, production and marketing of a race car start-up company.\nThe activities of the group provide an all-round experience for its members to build a great skill set for themselves, and be a part of a team representing the institute at an international level.",
    "page": "Team KART",
    "source": "https://wiki.metakgp.org/w/Team_KART"
  },
  {
    "chunk_id": "46819ad0",
    "title": "History",
    "text": "Its foundation was laid in 2008. It was an outcome of efforts of a few enthusiastic founding members and faculty advisers. The team took a solid form with the support of Prof. PP Chakraborty (Former Director, IIT Kharagpur) and Prof. Sunando Dasgupta (present Dean SRIC, IIT Kharagpur). Sidhartha Khastgir became the first Team Leader and stirred the team through the difficult initial stages where the team faced shortage of funds and technical knowledge. Since then it has grown to become IIT Kharagpur’s largest student project encompassing around 70 students from 10 different departments. Ganesh Kumar M. became the second team leader and held responsibility for three years and oversaw the development of K-1 and K-2. Till date the team has successfully made five cars- the KX-1, the K-1, K-2, K-3 & K-4. K-2 competed at Formula Student UK 2013. Several design oversights in K2 were fixed in K-2.2 by a new chassis and intake-exhaust system; which competed at Formula Design Challenge 2015 (FSI 15).",
    "page": "Team KART",
    "source": "https://wiki.metakgp.org/w/Team_KART"
  },
  {
    "chunk_id": "cf39ebdf",
    "title": "Formula Student",
    "text": "Formula Student is Europe's most established educational motorsport competition, run by the Institution of Mechanical Engineers (IMechE). Universities from across the globe are challenged to design and build a single-seat racing car in order to compete in static and dynamic events, which demonstrate their understanding and test the performance of the vehicle. The format of the event is such that it provides an ideal opportunity for the students to demonstrate and improve their capabilities to deliver a complex and integrated product in the demanding environment of a motorsport competition.",
    "page": "Team KART",
    "source": "https://wiki.metakgp.org/w/Team_KART"
  },
  {
    "chunk_id": "9463f482",
    "title": "Formula Bharat",
    "text": "Formula Bharat is an engineering design competition in which students from colleges and universities all over India, compete with a life-size Formula-style vehicle in areas of engineering design, overall cost, marketability and dynamic performance. Being identical to the global student hosted in around eleven countries per year, the event encourages students to gain hands-on practical experience, while applying engineering theories studied in the classroom. It is hosted and managed by Mobility Engineering Consortium Pvt. Ltd., an organization dedicated towards hosting mobility-related competitions for students.",
    "page": "Team KART",
    "source": "https://wiki.metakgp.org/w/Team_KART"
  },
  {
    "chunk_id": "909003c3",
    "title": "KX-1",
    "text": "The KX-1 was the team's first effort to build a car. The X' in the name stands for experiment as the car was the very first attempt of the completely novice team. The car was powered by a Honda CBR600RR engine which has hence forth powered all the cars till K-2.2.\nThe team participated at Formula Student, UK 2010. The participation was however limited to static events. The team stood 9th in the cost report analysis, as the car was very cost effective in its design. The team was one of the six teams to be nominated for Airbus Teamwork Award.",
    "page": "Team KART",
    "source": "https://wiki.metakgp.org/w/Team_KART"
  },
  {
    "chunk_id": "1c17d1cb",
    "title": "K-1",
    "text": "The K-1 was a major leap forward for the team. It was improved manifold from the first car. The car was powered by a Honda CBR600RR engine just like its predecessor. The team participated at Formula Student, UK 2011 with the car. However the team was restricted to participate only in the static events as the car had failed to clear the stringent scrutiny tests before the dynamic events. The team's impressive performance in the static events saw the team becoming one of the top three rookie teams at the event. The team again became one of the six teams to be nominated for the Airbus Teamwork Award.\nK-1 at FS UK\nGeneral | Overall Length: 2400mm Kerb Weight : 333kgf Tyre Specifications: 167/77 R 13 36 Q Wheel Rim Diameter: 13\"\nChassis | Material: Tubular Seamless Carbon Steel Frame Weight: 45kgf Front Track: 125 cm Rear Track: 118 cm\nEngine | Engine Displacement: 599cc Engine Choice: Honda CBR600RR Maximum Torque : 66Nm @ 9000rpm Fuel: RON 95\nSteering & Suspension | Suspension Type: SLA Double Wishbone Wheelbase : 1832mm Steering: Rack & Pinion type\nBrakes | Brake Type: Disc Brake Brake Details: Multi-Piston with brake biasing Caliper : Fixed Caliper Type",
    "page": "Team KART",
    "source": "https://wiki.metakgp.org/w/Team_KART"
  },
  {
    "chunk_id": "c9035d8a",
    "title": "K-2",
    "text": "With a new car, theK-2, the team participated at Formula Student, UK 2013. The car was powered by a Honda CBR600RR engine just like its predecessors. There was significant improvement in the car, a new plenum had been designed and manufactured in-house in rapid prototyping for better intake. New and more efficient SLA suspensions were implemented. It was the team's most successful visit yet with the team clearing all the six scrutinizing inspections namely Tech, Safety, Chassis, Noise, Brake and Tilt, as per the rules & norms governed by the MSA (Motor Sport Association) and SAE (Society of Automotive Engineers). Out of the six Indian teams, TeamKART was one of the two teams to qualify for the dynamic events. The team competed in the endurance test. The team managed to secure 43rd position in Business Presentation and 45th in Cost and Sustainability Design Report and stood 67th overall among 120 participating teams.\nK-2 at Silverstone Circuit during FS UK\nGeneral | Overall Length: 2730mm Kerb Weight : 280kgf Tyre Specifications: 167/77 R 13 36 Q Wheel Rim Diameter: 13\"\nChassis | Material: Tubular Seamless Carbon Steel Frame Weight: 45kgf Front Track: 107.3 cm Rear Track: 100.7 cm\nEngine | Engine Displacement: 599cc Engine Choice: Honda CBR600RR Engine Intake: Plenum made by rapid prototyping of volume: 1.2 litres Maximum Torque : 66Nm @ 9000rpm Maximum Bhp : 78.7W @ 13250rpm Fuel: RON 95\nSteering & Suspension | Suspension Type: SLA Double Wishbone Wheelbase : 1832m Steering: Rack & Pinion type\nBrakes | Brake Type: Disc Brake Brake Details: Multi-Piston with brake biasing Caliper : Fixed Caliper Type\nTransmission | Honda Civic Quaife type Differential Torque biasing Limited slip differential with custom built housing Chain and sprocket based final drive system designed",
    "page": "Team KART",
    "source": "https://wiki.metakgp.org/w/Team_KART"
  },
  {
    "chunk_id": "a51838f7",
    "title": "K-2.2",
    "text": "The K-2.2 was the upgraded and improved version of K2. The car was powered by a Honda CBR 600RR engine. A consequential improvement could be seen in the car. A new impact attenuator was added and the intake diffuser, throttle body and air filter had been changed. A new Scorpion Carbon fibre muffler, which was the first carbon fibre part of the car was also introduced. The size of the radiator fan had also been increased for better performance. The team participated in Formula Design Challenge 2015 and passed technical scrutiny. Although a seized engine prevented the team from taking part in the dynamic events nonetheless it was a great learning experience for the whole team. The team bagged the first runners up position in both, the Business Presentation and the Cost Report.\nK-2 at Silverstone Circuit during FS UK\nGeneral | Overall Length: 2730mm Kerb Weight : 270kgf Tyre Specifications: 167/77 R 13 36 Q Wheel Rim Diameter: 13\"\nChassis | Material: Tubular Seamless Carbon Steel Frame Weight: 45kgf Front Track: 107.3 cm Rear Track: 100.7 cm\nEngine | Engine Displacement: 599cc Engine Choice: Honda CBR600RR Engine Intake: Plenum made by rapid prototyping of volume: 1.2 litres Maximum Torque : 66Nm @ 9000rpm Maximum Bhp : 78.7W @ 13250rpm Fuel: RON 95\nSteering & Suspension | Suspension Type: SLA Double Wishbone Wheelbase : 1832m Steering: Rack & Pinion type\nBrakes | Brake Type: Disc Brake Brake Details: Multi-Piston with brake biasing Caliper : Fixed Caliper Type\nTransmission | Honda Civic Quaife type Differential Torque biasing Limited slip differential with custom built housing Chain and sprocket based final drive system designed Team Structure",
    "page": "Team KART",
    "source": "https://wiki.metakgp.org/w/Team_KART"
  },
  {
    "chunk_id": "3c694afc",
    "title": "K-3",
    "text": "K-3 improved upon its preceding models by leaps and bounds. It was the first car to be powered by a KTM Duke 390 single cylinder engine. Several innovative designs were successfully implemented like data acquisition, digital display and wireless telemetry. K-3 has carbon fiber reinforced parts which include body panels and mufflers. K-3 has its Topology optimized suspension aluminum uprights weighing 950g each. The car boasts of its new 3-D printed ABS plastic intake. The team successfully performed its engine tuning through PowerTronic ECU.\nThe Team participated in Formula Bharat 2017 and were one of the few teams to clear the technical inspection round. The Team stood second in the Business Presentation event during the competition and stood 6th in the Rulebook quiz.\nGeneral | Overall Length: 2980mm Curb weight: 226kgf Tyre Specifications: Avon A92 20X7.2-13 Wheel Rim Diameter: 13\"\nChassis | Material: Tubular Seamless Carbon Steel Frame Weight: 35kgf Front Track: 137.0 cm Rear Track: 131.0 cm\nEngine | Engine Displacement: 373.2cc Engine Choice: KTM 390 DUKE,Single cylinder Engine Intake: Plenum made by rapid prot Maximum Torque: 33Nm @ 5500rpm Maximum Bhp : 33BHP @ 7000rpm Fuel: RON 95\nSteering & Suspension | Suspension Type: SLA Double Wishbone Wheelbase: 1720m Steering: Rack & Pinion type\nBrakes | Brake Type: Disc Brake Brake Details: Multi-Piston with brake biasing Caliper: Fixed Caliper Type\nTransmission | Clutch type Limited Slip Differential (Drexler). Chain and sprocket based final drive system designed",
    "page": "Team KART",
    "source": "https://wiki.metakgp.org/w/Team_KART"
  },
  {
    "chunk_id": "be950e48",
    "title": "K-4",
    "text": "In order to keep up with the fast-paced action and innovations of the FSAE circuit, it is important that we work to better ourselves with every car that is manufactured.\nAn innovative FS car should be sleek, light-weight, fast and efficient. Our latest car K4 checks off all those boxes, considering that it is one of the lightest and fastest cars we have manufactured since inception. It also boasts of several new upgrades that have added a sense of accomplishment to our car.\nPowertrain\nK4 has a 3D printed (chemically welded) side intake which helped us to reduce the overall weight of the car. For the first time, K4 underwent dyno-tuning at a facility in Bengaluru which resulted in better power output and greater fuel efficiency. Eccentric differential mounts were installed which helped in chain tensioning and further reduced the weight.\nChassis\nThe acceleration and performance of the car improved as we successfully reduced the chassis weight by 10 kg as compared to our previous car K3. This was achieved with the proper usage of AISI 4130 mild steel over the AISI 1080 version. Moreover, extensive work into triangulation enabled us to design a smart and efficient structure.\nAerodynamics\nK4 has been made by implementing our Team’s first aerodynamic package element, the under-body diffuser.\nGeneral | Overall Length: 2830mm Curb weight: 251.5kgf Tyre Specifications: 20.5 x 7.0 - 13 R25B Hoosier Wheel Rim Diameter: 13\"\nChassis | Material: Tubular Seamless Carbon Steel Frame Weight: 35kgf Front Track: 130.0 cm Rear Track: 130.0 cm\nEngine | Engine Displacement: 373.2cc Engine Choice: KTM 390 DUKE,Single cylinder Engine Intake: Plenum made by rapid prot Maximum Torque: 33Nm @ 5500rpm Maximum Bhp : 33BHP @ 7000rpm Fuel: RON 95\nSteering & Suspension | Suspension Type: SLA Double Wishbone Wheelbase: 1580mm Steering: Rack & Pinion type\nBrakes | Brake Type: Disc Brake Brake Details: Multi-Piston with brake biasing Caliper: Fixed Caliper Type\nTransmission | Clutch type Limited Slip Differential (Drexler). Chain and sprocket based final drive system designed",
    "page": "Team KART",
    "source": "https://wiki.metakgp.org/w/Team_KART"
  },
  {
    "chunk_id": "a773fa22",
    "title": "Team Structure",
    "text": "Team KART comprises undergraduate students from 1st to the 5th years.\nTeam at the Silverstone circuit during Formula Student UK 2013\n• Team Mentors : 4th & 5th years\n• Team Leader : 3rd year\n• Team Managers : 3rd year\n• Sub System Heads : 3rd year\n• Team Members : 2nd year\n• Trainees : 1st year",
    "page": "Team KART",
    "source": "https://wiki.metakgp.org/w/Team_KART"
  },
  {
    "chunk_id": "dae1e2d5",
    "title": "Subsystems",
    "text": "• Suspension, Steering and Brakes\n• Chassis\n• Aerodynamics\n• Powertrain\n• High Voltage Electronics\n• Low Voltage Electronics\n• Data Acquisition\n• Battery Management System\n• Corporate & Public Relations\n• Media & Web",
    "page": "Team KART",
    "source": "https://wiki.metakgp.org/w/Team_KART"
  },
  {
    "chunk_id": "b0d57acf",
    "title": "Citations",
    "text": "• https://www.iitkgp.org/index.php/news/kgp-in-spotlight/1005-team-kart-success-saga-continues-in-the-3rd-consecutive-year\n• https://www.iitkgp.org/index.php/news/kgp-in-spotlight/552-team-kart-at-formula-student-2010\n• http://education.oneindia.in/news/2013/06/14/iit-kharagpur-student-team-at-fsae-2013-005403.html\n• http://www.gymkhana.iitkgp.ernet.in/student-activities/initiatives/\n• http://www.100marks.in/News/formula-1-racing-car-%E2%80%98kart%E2%80%99-designed-by-iit-kgp-students-ready-to-compete-with-professional-f-1-cars/\n• http://www.racecar-engineering.com/cars/kharagpur/\n• http://ashwathicr.blogspot.in/2013/06/iit-kharagpur-student-team-at-fsae-2013.html\n• http://www.coolage.in/2013/08/08/students-excel-at-international-formula-student/",
    "page": "Team KART",
    "source": "https://wiki.metakgp.org/w/Team_KART"
  },
  {
    "chunk_id": "22aa9f35",
    "title": "External links",
    "text": "• www.teamkart.org",
    "page": "Team KART",
    "source": "https://wiki.metakgp.org/w/Team_KART"
  }
]