[
  {
    "chunk_id": "info_d6c213",
    "title": "Technology Robotix Society - Quick Facts",
    "text": "Activities | Robotics , Robotix(competition) , KRAIG, KRISS, Annual Winter School of AI and Robotics, Robotics Workshops, Makerspace, Line Follower Hackathon\nFounded | 2001 ( 2001 )\nFounder(s) | Anish Reddy\nNumber of members | 35\nWebsite | www .robotix .in\nContact | +91 7620821543 (Parth Gupta) +91 9142735129 (Amrit Lal Singh)\nUnder TSG | Yes\nReferences: [ 1 ]",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "9b163f70",
    "title": "Technology Robotix Society",
    "text": "Technology Robotix Society (abbrv. TRS) is an official society under the Technology Students' Gymkhana , IIT Kharagpur and is a focal point for activities and projects related to robotics in the campus. With its reach expanding steadily each year, it has also cemented its position as one of the nerve centres of amateur robotics in India.",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "d5499365",
    "title": "Activities",
    "text": "Technology Robotix Society (TRS) conducts many events throughout the year, specifically aimed at undergraduate students, with a general aim of spreading robotics culture in the campus and around.",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "1ac2e8d3",
    "title": "KRAIG Classes",
    "text": "The Kharagpur Robotics and Artificial Intelligence Group (KRAIG) classes are organized by TRS throughout the autumn semester each year and are open to be attended for all students. The main attendees being first year undergraduate students of the campus. The classes cover the basics of robotics, starting off with drives, mechanisms and then moving on to electronics, integrated circuits and finally to the basics of autonomous robotics.",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "bae85f83",
    "title": "Annual Winter Workshop",
    "text": "The annual winter workshop is conducted each year after the conclusion of the autumn semester. The workshops are mentored by second year robotics enthusiasts including TRS members and interested students are taught the concepts of either autonomous robotics or computer vision, and through that knowledge, attempt to tackle a relevant problem statement. Students are selected through a common test organized by TRS, based on the results of which problem statements and mentors are assigned to the students, which they try to tackle together in one week of time.",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "aeeafbdf",
    "title": "KRISS",
    "text": "Kharagpur Robotics and Intelligent Systems Seminars (abbrv. KRISS) is an initiative to bring together people across departments and different years to discuss and exchange ideas related to more mature and nuanced areas of robotics [ which? ] . The primary motivation is to encourage feedback and potential collaboration between interested individuals and also to foster a general culture of research-oriented discussions.",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "3c90f097",
    "title": "Freshers' challenges",
    "text": "In addition to the classes, TRS also organizes exclusively-for-freshers competitions like Robosoccer in which students are taught to build a basic differential drive and Pathfinder workshop in which they are taught to build a line follower without writing a single line of code.\nIn addition to all this, TRS also conducts workshops for robotics in other colleges in India.",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "aafa8720",
    "title": "Robotics Projects",
    "text": "In the past numerous robotics projects have been initiated by Technology Robotix Society alumni, several of which have received independent funding and now have been converted to independent research groups in the campus. Presently, two research projects are being managed by TRS. They are the Quadrotor project and the Swarm project.",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "55a83366",
    "title": "Aerial Robotics Kharagpur",
    "text": "Main article: Aerial Robotics Kharagpur\nQuadrotor is the unmanned aerial vehicle project taken up by Team Robotix, with the initiation taking place from the academic year 2014-15. The ultimate goal of the project is to participate and win in the I.A.R.C.(International Aerial Robotics Competition), which is a highly prestigious and contested global event with realistic and daunting problem statements.",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "be86f87b",
    "title": "Swarm IIT Kharagpur",
    "text": "Main article: Swarm IIT Kharagpur\nSwarm Robotics is a very rare project taken up by Team Robotix and there are very few labs which are dealing with swarm robotics in the country. The ultimate aim of this project is to enable a swarm of robots explore an unknown terrain.",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "19aa5822",
    "title": "Makerspace",
    "text": "Makerspace is an initiative of Team Robotix for encouraging the students to come up with bright ideas for developing robots that could make a change. It is a community-based open source hardware hacking lab to make prototypes of selected hardware implementations as well as a meeting ground for open software projects. TRS aims to undertake small scale projects under this wing to make an everlasting impact on the IIT Kharagpur robotics scenario. Makerspace Projects that have been completed till date include the 2D PLOTTER(A mini version which can print any graphic having size less than 120 * 240 mm), Automated Inventory Management, Self Learning Crawling Robot and the Inter-IIT TCTD challenge.\nProjects that have been undertaken and are in progress :\n• QUADRUPED: The basic aim is to build a quadruped equipped with 4 wheels that moves using wheels on plane surfaces and uses its legs to climb stairs/ uneven surfaces.\n• ROBOTIC ARM: To build a 5 degree-of-freedom robotic arm by 3 D printing the basic chassis and using servos, is the primary objective. The arm can then be used for a variety of research purposes.",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "9421eb74",
    "title": "Robotix (fest)",
    "text": "The annual fest Robotix, conducted each year during Kshitij is the focal activity of the society in a year. With a footfall of over 2000 each year, it has turned into the largest single robotics based annual agglomeration in South Asia. [ unverified ]\nEvents during Robotix are conducted under three categories: manual, autonomous and programming/online. In the manual events, the participant handles the robot by using a remote control. The remote system may be wired or unwired. The robot then has to perform the specified task, which is usually something mechanical. In the autonomous events, the robots act independently; participants are not allowed to control them during their run. These robots typically use programmed micro-controllers to make decisions. Some events involve more than one robot, and can be a mix of autonomous and manually controlled robots. In the programming events, the participants are given a problem statement and submit code to solve the problem; the competitors are also allowed to submit their solutions online.",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "8032029d",
    "title": "Robotix 2019",
    "text": "Robotix 2019 was held from 18-20 January, 2019. In this edition of the fest, the events held were:\n• Zenith : Build a manually controlled robot which is capable of crossing the gaps in the arena, while avoiding obstacles by increasing or decreasing its ground clearance.\n• Cubiscan : Build a robot capable of detecting the dimensions of the block to estimate the volume of the block and then indicate the increasing order of volume of blocks.\n• Crusade : Build an image processing robot that is capable of traversing in a lane while detecting glowing LEDs on its way and deciding its path according to the frequencies of the blinking LEDs.",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "b4eb47e8",
    "title": "Robotix 2018",
    "text": "Robotix 2018 was held from 19 - 21 January, 2018. The events of 2018 edition are:\n• Poles Apart : Build a manually controlled robot, which is capable of picking and placing blocks with accuracy and changing its interaxial distance to make its way through a series of hurdles.\n• STAX : Build a robot which can rearrange blocks of different colors from a stack in a pattern by identifying the colors simultaneously moving across the stacks using line following.\n• Fortress : Build an image processing robot that can recognize useful patterns by pattern recognition while avoiding other obstacles.",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "177944ec",
    "title": "Robotix 2017",
    "text": "Robotix 2017 was held from 27 - 29 January, 2017. The events of 2017 edition are:\n• Bomb Disposal : Build a manually controlled robot which is capable of cutting the required wires and lifting objects.\n• B.R.I.C.K.S. : Build a robot that is capable of segregating building materials by differentiating between hollow and solid bricks by successful autonomous weight detection.\n• Conquest : Build an image processing robot that can collect resources like food and wood from the arena while avoiding different obstacles.",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "9f981ade",
    "title": "Robotix 2016",
    "text": "Robotix 2016 was held from 21 - 24 January, 2016. The events of 2016 edition are:\n• Summit : Build a manually controlled robot capable of climbing staircases, whilst picking storing and placing objects on its way.\n• Sherlock : Build an autonomous robot that can decode encoded wireless signals to navigate in a featureless arena using only a digital compass.\n• Warehouse : Build a gesture controlled semi-autonomous robot that is capable of sorting blocks on multi-layered platforms according to their RFID tags.\n• S.H.E.L.D.O.N. : Build an image processing robot capable of detecting characters, using an overhead camera and traversing them such that the equation generated by the traversal fulfills a certain condition.",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "f95a39c3",
    "title": "Robotix 2015",
    "text": "The events of 2015 edition were:\n• AugHit : Build an Image Processing robot which can play the Brick Break game.\n• Minefield : Build a semi-autonomous robot which is capable of moving around and clasping objects using gesture recognition and implement metal-detection autonomously.\n• Cascade : Build a manually controlled robot capable of traversing vertical rods while shooting terrorists and extinguishing fire.\n• Skyfall : Build a manually controlled robot that carries out shipment of parcels from dock to vessel.\n• Step Up : Build an autonomous robot that is capable of traversing a grid and arranging the blocks placed on nodes in the increasing order of height.\n• Sudocode : Write a code to optimise your strategy to find and destroy enemy bunkers in a jungle. Write a code to find and attack enemy troops in the jungle.",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "26fdb141",
    "title": "Robotix 2014",
    "text": "Robotix 2014 was held from 31 Jan - 3 Feb 2014. The events of the 2014 edition were:\n• Geo-Aware : Create a vision-guided robot which can use onboard video feed to navigate an environment based on an overhead image as a map.\n• Tremors : Build an Autonomous robot that can seek out victims present in the arena while detecting and avoiding earthquake affected vibration zones present in the arena.\n• Canyon Rush : Build a manually controlled robot capable of traversing an arena similar to a canyon and saving victims stranded at certain depths.\n• Inspiralon :Build a manually controlled robot capable of traversing a broken pipe and repairing it on the way, in this case, popping corks plugged in the pipe.\n• Transporter :Build an autonomous robot which can traverse a grid and place blocks in voids on the grid such that it optimises its path while completing this task.\n• Sudocode :SudoCode was an online coding event including different Problem Statements to be judged by an online evaluator.",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "e3b6c69f",
    "title": "Robotix 2013",
    "text": "Robotix 2013 was held from 1–4 February 2013. [ 2 ] It featured the following events:\n• Abyss : The manually controlled robot uses ropes to descend a rocky surface. The goal is to retrieve people, represented by rings, and bring them to a station, represented by a pole. [ 3 ]\n• Overhaul : The manually controlled robot traverses various terrains and crevasses in a broken landscape by constructing a path. The goal is to reach victims trapped at an accident site. [ 4 ]\n• A.C.R.O.S.S. (Automated Constructions Robot Operations Systems): The event involves a pair of autonomous robots which must work together to navigate a series of chasms and buildings. One robot is placed on top and the other below. [ 5 ]\n• Lumos : The autonomous robot navigates a dark arena that has light sources of varying lumniosities. The goal is to turn off the sources by bumping into them, but not hit the unlit sources. [ 6 ]\n• Seeker : The autonomous robot navigates an indoor environment. It must recognize signs and directions so as to reach the targets and to eventually find its way out. [ 7 ]\n• Marauder's Map : Design an algorithm that will plan an itinerary for a Marauder to loot various cities around the world. It considers factors such as account terrain, travel time, and cost of transportation (e.g. hiring vehicles, purchasing fuel). [ 8 ]",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "6dfb772c",
    "title": "Robotix 2012",
    "text": "Robotix 2012 was held from 27–30 January 2012. It consisted of the following events:\n• Inferno : The manual robots play the role of firemen by dousing fires and saving people (cylinders) from a burning building.\n• Vertigo : The robot rides a zip-line and shoots at targets below it.\n• Stasis : The autonomous robot must balance a water reservoir compartment, and guide it through a variety of terrains.\n• Stalker : A pair of autonomous robots that communicate so that one guides the other. The first robot follows a line, and communicates with the second robot so that the latter can trace a similar path on another arena that does not have any markings.\n• Nuke Clear : The autonomous robot uses image processing to navigate an arena to detect and to defuse bombs.\n• Echelon : In the online event, the idea is to make a machine capable of ‘understanding’ our world, and the following problem statement aims at putting together basic NLP ( natural language programming ) tasks towards a useful end. [ clarification needed ]",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "d05f277a",
    "title": "Robotix 2011",
    "text": "Robotix 2011 was held from 28–31 January 2011. It featured the following events:\n• R.A.F.T. [ expand acronym ] : The manually controlled robot or group of robots use a water raft to retrieve people (balls) from flood affected areas (platforms), and bring them to safety (designated zone).\n• Pirate Bay : The manually controlled robot searches and digs for buried treasure, and then rescues fellow pirates.\n• The Fugitives : An team of up to four autonomous robots communicate and collaborate to detect and corner fugitive robots.\n• Ballista : The autonomous robot shoots ping-pong balls into a basket from different locations. Judging is based on accuracy and range.\n• Robocop : The autonomous robot uses on-board image processing to identify and knock out statuettes of a certain color.\n• The Negotiators : In the online event, the participants submit a computer program that can negotiate with other opponents in order to complete a configuration of blocks on a virtual arena.",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "5bbb9cff",
    "title": "Robotix 2010",
    "text": "The tenth edition of Robotix was held from 28–31 January 2010. All events had an X in their name to indicate ten years. The competition featured the following events:\n• Xplode : The theme of the event was inspired by the land mine problem in some of the African countries . Each team presents a pair of autonomous robots. The first mine-detecting robot maps the arena, and transmits its information regarding the location of the mines to the second robot. The mine-avoiding robot attempts to reach the goal in the shortest time while it avoids the mines.\n• Xtension : The robots coordinate amongst themselves to traverse a series of chasms. There was no restriction on the number of robots one could build, but at least one robot must be autonomous.\n• 8MileX : The autonomous robots travel outdoors on an actual road and follow traffic rules. It is similar to the Robotix 2009 8 Mile event, and is a scaled down version of the DARPA Grand Challenge .\n• TribotX Championship : A three-tier tournament that required participants to use their manually-controlled robots to perform three tasks over three days of the festival. The teams with the highest cumulative scores after the first two tasks advanced to final knockout stage. The tasks were selected from a pool of modules. Contestants were then informed of the day's task 12 hours before the start.\n• eXplore : In the underwater event, the manually-controlled robots dive and release several light weight balls held at different coordinates in a large water tank. The robots then collect the balls that are floating on the surface and bring them to the designed area of the arena called the victory zone.\n• Xants : The programming/online event that is inspired by ant colonies and the principles of swarm intelligence and collective intelligence . In a simulation of an ant colony and several energy packets distributed across the arena, where individual ants cannot sense beyond a certain range, and can only leave a scent trail for other ants to follow, participants had to design an algorithm to optimize this coordination and to procure the energy packets efficiently.",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "0db1f0f4",
    "title": "Robotix 2009",
    "text": "Robotix 2009 was held from 29 January – 1 February 2009, featuring the following events:\n• 8 Mile : The autonomous battery-powered vehicles traverse the road, and must follow traffic rules from traffic lights to zebra crossings.\n• 12 Doors Down : The autonomous robot is placed in a labyrinth of cells. The participants use a manually controlled robot to guide it out of the grid by opening and closing doors.\n• Micro Mouse 4D : In the programming/online event, participants code a function in a pre-programmed template to run a simulation to address the micro-mouse robotics problem. It was simulated with Microsoft Robotics Studio .\n• FramED9211 : In the programming/online event that involves image processing , participants submit a code in a language of their choice to recognize the number plates of fast moving cars among all cars in a real life video.\n• wEDGED : The event was inspired by Nintendo platform games. The manually controlled robots climb a wooden wedge while they avoid the swinging pendulums. They grab a plank by its handle and swing on to a lower platform. It was a one-on-one competition.\n• #mEsh : The manually controlled robot climbs up and down an inclined metallic mesh. The size of a unit square of mesh is 7 cm x 7 cm.\n• Robo-Relay : ??",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "7b3b683c",
    "title": "Robotix 2008",
    "text": "Robotix 2008 was held from 31 January – 3 February 2008. It featured the following events, two of which were not disclosed beforehand:\n• I.M.A.G.E. [ expand acronym ] : A autonomous robot, with the help of maximum two cameras, navigates the arena while avoiding obstacles, in order to pass various checkpoints and reach the end point.\n• Robo-Relay: Two autonomous robots traverse an irregular track while carrying a baton. The robots are synchronized so that they pass the baton and run one after the other.\n• On Spot Robotics (Autonomous): This was an undisclosed event where the participants build an autonomous robot that only uses logic gate circuits (i.e. no microcontrollers).\n• Stackistics: The manually controlled robot assembles blocks of various pre-specified shapes and sizes to form a given spatial structure.\n• Terra Ranger: The manually controlled robot travels on varied land terrains and also water surfaces.\n• On Spot robotics (Manual): This was an undisclosed event where the task was to build a manually controlled robot and controller to fulfill the requirement of the problem statement.\n• Mission Mars: In the programming event, the participants code robot ants which coordinate among themselves during their mission to explore an area.",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "21a7587a",
    "title": "Robotix 2007",
    "text": "Robotix 2007 was held from 1–4 February 2007. It featured the following events:\n• Rail Track Inspector : The automated robot follows two parallel white lines, 5 cm apart, on a black blackground, and reports any errors it encounters. The errors were of two types. First, it reports when the distance between the lines is different from their specified gap. Second, it reports if either of the white lines are discontinuous. The errors must be classified separately.\n• Grid Navigator : The autonomous robots move in an 8-foot square maze and detect the positions of obstacles placed in the maze without dislocating them. The maze is in the form of a two dimensional numbered grid. Squares are marked with white lines on a black background. The robot starts in one corner of the maze and exits on the diagonally-opposite corner after identifying all the obstacles. The robot is free to roam in the grid in any given way.\n• Mission Mars : A repeat of the previous year's event. In this programming/online event, the participants write code to control robot ants on a simulated Martian surface, so that it can cover the maximum area in a given time. Multiple instances of the same program were run at the same time, with each instance able to communicate with the others to prevent collisions which would render both robots extinct. The participants were allowed to code in C , C++ or Java .\n• Jigsaw : In this programming/online event, the participants write code to solve a jumbled up picture. The picture is broken into fragments and is scrambled by using a program. Only the top left corner of the jumbled picture is the same as the original picture. The participants code in either C or C++.\n• Load runner : The manually controlled robot uses a hooking mechanism to attach freights and link them together to form a train. It then has to act as the engine of the same train and pull it to its destination. Use of magnetic material to attach to the freights is prohibited.\n• Step climber : The manually controlled robot climbs up and down a flight of stairs. The height of the steps varies.",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "db994912",
    "title": "Robotix 2006",
    "text": "Robotix 2006 was held from 2–5 February 2006. It featured the following events:\n• Distance Tracker : The autonomous robot travels a certain path and reports the distance traversed in a digital format. The paths varied from a simple circle to an arbitrary route.\n• Match Maker : The autonomous robot moves white blocks placed in the arena to regions of their corresponding shape.\n• Mission Mars : In the programming/online event, participants code robot ants to cover as much area of the Martian surface within a given time.\n• Top-sy Turvy : The manually controlled robot takes balls at different heights and surfaces, and throw thems in a goal post within a limited time.\n• Water Polo : The manually controlled robot races on a water surface to place five balls inside a certain goal post in the fastest time.",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "1ece0ca7",
    "title": "See Also",
    "text": "• List of Societies and Clubs\n• List of student run research groups\n• Centre for Excellence in Robotics\n• Kshitij",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  },
  {
    "chunk_id": "6bbdf2e0",
    "title": "References",
    "text": "↑ Verified by Abhinavjain on 2015-05-15. ↑ \"Events\" . Robotix Technology Robot Society . Indian Institute of Technology Kharagpur . Retrieved 2012-11-04 . ↑ \"Events – Abyss\" . Robotix Technology Robot Society . Indian Institute of Technology Kharagpur . Retrieved 2012-11-04 . ↑ \"Events – Overhaul\" . Robotix Technology Robot Society . Indian Institute of Technology Kharagpur . Retrieved 2012-11-04 . ↑ \"Events – Across\" . Robotix Technology Robot Society . Indian Institute of Technology Kharagpur . Retrieved 2012-11-04 . ↑ \"Events – Lumos\" . Robotix Technology Robot Society . Indian Institute of Technology Kharagpur . Retrieved 2012-11-04 . ↑ \"Events – Seeker\" . Robotix Technology Robot Society . Indian Institute of Technology Kharagpur . Retrieved 2012-11-04 . ↑ \"Events – Marauder's Map\" . Robotix Technology Robot Society . Indian Institute of Technology Kharagpur . Retrieved 2012-11-04 .",
    "page": "Technology Robotix Society",
    "source": "https://wiki.metakgp.org/w/Technology_Robotix_Society"
  }
]