[
  {
    "chunk_id": "info_f0145c",
    "title": "Technology Literary Society - Quick Facts",
    "text": "Activities | Creative Writing , Poetry , Kavi Sammelan , Designing\nWebsite | Facebook: www .facebook .com /tls .iitkgp Instagram: www .instagram .com /tls .iitkgp / Youtube: www .youtube .com /channel /UCKQg7OhH07y2I77Hy _52s _Q\nUnder TSG | Yes",
    "page": "Technology Literary Society",
    "source": "https://wiki.metakgp.org/w/Technology_Literary_Society"
  },
  {
    "chunk_id": "ca2d4ecd",
    "title": "Technology Literary Society",
    "text": "The Technology Literary Society, IIT Kharagpur abbreviated as TLS , is IIT Kharagpur's literary organization involving a group of enthusiastic English & Hindi writers, and designers. The society used to publish the monthly wall magazine Hang On , and the literary newsletter KGP Pulse but they have been discontinued in favour of using social media to reach a larger population. TLS continues to publish the annual campus magazine Alankar .",
    "page": "Technology Literary Society",
    "source": "https://wiki.metakgp.org/w/Technology_Literary_Society"
  },
  {
    "chunk_id": "090d3a1f",
    "title": "Kavya Sandhya",
    "text": "In the year 2014-15 a new event was introduced by TLS on the lines of a Kavi Sammelan, christened Kavya Sandhya . The first edition was primarily experimental in nature, with the Hindi poets from Team TLS exhibiting their poetry and oratory skills on stage. the event received great admiration from the kavi s in the campus and that motivated us to bring it in a larger scale as the Kavyanjali. Kavya Sandhya is held till date in the autumn semester and gives a chance for the Hindi poets of the campus to dazzle the audience with their words.",
    "page": "Technology Literary Society",
    "source": "https://wiki.metakgp.org/w/Technology_Literary_Society"
  },
  {
    "chunk_id": "14951764",
    "title": "Kavyanjali",
    "text": "Continuing the legacy of Kavya Sandha, during the spring semester of year 2014-15 TLS collaborated with Awaaz and Rajbhasha Vibhag to organize Kavyanjali in the Kalidas auditorium where acclaimed Hindi poets like Prof. Prem Shankar Tripathi, Shri Ravi Pratap Singh, Shri Jagesh Tiwari presided the event. Since then, Kavyanjali is held annually in the spring semester where poets from outside and as well as inside the KGP campus enrapture the audience with their lines.",
    "page": "Technology Literary Society",
    "source": "https://wiki.metakgp.org/w/Technology_Literary_Society"
  },
  {
    "chunk_id": "53bc6018",
    "title": "Poetry Slam",
    "text": "In the year 2014-15, for the first time, TLS hosted a Poetry slam event during Spring fest. The event saw participation from 6 colleges and it was open for both Hindi and English poets.",
    "page": "Technology Literary Society",
    "source": "https://wiki.metakgp.org/w/Technology_Literary_Society"
  },
  {
    "chunk_id": "77a6a29b",
    "title": "Farrago",
    "text": "In the year 2018-19, for the first time, an English spoken word event called Farrago was conducted. The event was held to promote the culture of English spoken word. The event saw participation from TLS members as well as some exceptional poets outside TLS from the campus.",
    "page": "Technology Literary Society",
    "source": "https://wiki.metakgp.org/w/Technology_Literary_Society"
  },
  {
    "chunk_id": "b03b2921",
    "title": "Online Presence",
    "text": "TLS regularly publishes content from its Facebook page . Seeing the growing popularity of the social media platform Instagram, TLS also made its debut on Instagram and started regularly publishing from its Instagram page since 2019.",
    "page": "Technology Literary Society",
    "source": "https://wiki.metakgp.org/w/Technology_Literary_Society"
  },
  {
    "chunk_id": "34c03175",
    "title": "History",
    "text": "While the exact year is unknown, Technology Literary Society is believed to be founded sometime in the 50s [ citation needed ] , along with Hindi Technology Dramatics Society in the same year which makes it one of the first societies in KGP. TLS was previously responsible for conducting KGP's literary fest, called Manzar and publishing the annual campus magazine, Alankar . Manzar was conducted in the week following Spring Fest , another one of KGP's long standing traditions. But when Kshitij was started in 2002, the time slots for Spring Fest and Manzar were merged, both being in the socio-cultural arena. In those days, SF did not conduct literary events. When the time slots for Manzar and SF were merged, logistical problems arose between SF and TLS teams, both competing for time slots and venues. Then TLS was broken in 2 parts, one responsible for Manzar to be merged with SF, another to be responsible for Alankar\nHowever, TLS kept the its tradition the same, keeping 9 Governors (which made sense while they had to conduct a fest). This was a period of decline for TLS as it had no responsibility other than to publish Alankar at the end of the year. However, it maintained its 9 Governors.\nIn the year 2008, TLS came up with a new publication - Hang On , a monthly wall magazine which would be a satirical depiction of events around KGP and the world. Hang On was meant to be mostly humorous in nature while the more serious pieces were kept for ALANKAR. In 2009, TLS founded another bi-monthly publication - KGP Pulse which would frequent the more \"literary\" pursuits of its members and students from KGP but these were discontinued in 2016. In 2010, TLS for the first time started conducting events along with Spring Fest, which can be seen till date. In the same year, 2010, Alankar was not published due to Gymkhana budget constraints. It was, however, revived after a gap of 3 years in 2012 and since then has been published every year.\nFrom the year 2010-11, there have been only 4 Governors in TLS every year.\nThere has also been a longstanding debate over what TLS stands for. While some within the team claim that it is to promote literary activities in the campus, some feel that it stands to promote the literary activities among the members. This has been reflected over the years in the change in leadership as each leadership team has their own version of the motive of TLS and acts accordingly. However, TLS has always stood by it's core principle and it's motto - helping KGP to express themselves!",
    "page": "Technology Literary Society",
    "source": "https://wiki.metakgp.org/w/Technology_Literary_Society"
  },
  {
    "chunk_id": "e378eb92",
    "title": "Governors",
    "text": "List of Governors\n2024-25 | Amitesh Kumar (HS '26) | Shivam (GG '26) | Vidya Niwas Mishra (EE '27)\n2023-24 | Amrita Ghosh (ME '26) | Deovardhan (GG '25) | Indra Kumar Gupta (AE '25) | Maithili Bhuyar (EE '26) | Vaishnavi Nikam (ME '25)\n2022-23 | Pranay Pandey (PH '25) | Nishita Singh (BT '25) | Shreya Gupta (HS '25) | Tanmay Malatkar (IM '24) | Mehak Sharma (ME '24)\n2021-22 | Aditi Sisodia (NA '24) | Apurav Tambe (NA '24) | Shalmali Sriram (AR '24) | Umang Pandey (ME '23)\n2020-21 | Sarvesh Deshpande (ME '23) | Archi Banerjee (PH '23) | Kshitij Anand (AE '23) | Utkarsh Agrawal (MF '22)\n2019-20 | Kushal Patankar (MT '21) | Pankhuri Saxena (HS '22) | Pranav Shukla (CE '22) | Prem Shankar (HS '22)\n2018-19 | Yash Shukla (MI '21) | Aditya Prakash (IM '21) | Akshit Lonare (EE '20) | Sourav Garg (EC '21)\n2017-18 | Shreshth Khare(CH'19) | Aayush Keshva(PH'20) | Swapnil Batle(MA'20) | Ashutosh Bhaskar(GG'20)\n2016-17 | Lalit Khemlani (EC '18) | Himanshu Mishra (MA '19) | Nitish Kumar (CE '18) | Pankaj Sutar (HS '19)\n2015-16 | Yash Shrivastava (CS '17) | Rishabh Upadhyay (CY '18) | Sumit Kumar Pandey (MI '17) | Atchuta Srinivas Duddu (IE '17)\n2014-15 | Ujjwal Dubey (CH '16) | Hardik Rajpal (PH '17) | Triyansha Vijayvargiya (GG '17) | Shailesh Kumar(GG '17)\n2013-14 | Pragya Sharma (EE '15) | Nidhi Dwivedi (HS '16) | Sushruta Mishra (ME '15) | Ketan Mundhada (AR '16)\n2012-13 | Rahul Jai Singh (ME '15) | Priya Singh (CH '14) | Vikas Dubey (IM '15) | Saif Khan (CY '15)\n[ 1 ] [ 2 ] [ 3 ]",
    "page": "Technology Literary Society",
    "source": "https://wiki.metakgp.org/w/Technology_Literary_Society"
  },
  {
    "chunk_id": "9b3a18ee",
    "title": "Archives",
    "text": "↑ https://web.archive.org/web/20150515065840/http://www.gymkhana.iitkgp.ernet.in/societies ↑ https://web.archive.org/web/20131121043239/http://www.gymkhana.iitkgp.ernet.in/societies/tls ↑ https://web.archive.org/web/20120912043025/http://www.gymkhana.iitkgp.ernet.in/societies/tls",
    "page": "Technology Literary Society",
    "source": "https://wiki.metakgp.org/w/Technology_Literary_Society"
  }
]