[
  {
    "chunk_id": "e6054510",
    "title": "Technology Environment Society",
    "text": "1 About us\nTechnology Environment Society (TES) is a student-led organization at the Indian Institute of Technology (IIT) Kharagpur. TES is dedicated to the conservation and preservation of the environment, and to promoting sustainability in society. Its members are committed to raising awareness about ecology, nature, and the environment, and to sensitizing others to the importance of protecting our planet. Through a range of initiatives and activities, TES strives towards more sustainable future by finding solutions to environmental challenges and promoting conservation efforts within the campus and the wider community.\n2 Vision\nTES aims to enhance and preserve the socio-ecological space within the IIT Kharagpur campus, with a focus on sustainability and community welfare.\n3 History\n3.1 Vision Prabaho\nAlthough TES was officially institutionalized as a part of Gymkhana in 2021, its roots date back to 2018 when it was founded as Vision Prabaho by Biswarup Mondal, Sirsendu Sekhar Barman and Pragnaditya Malakar, who formed a team with other enthusiastic members. Vision Prabaho, the mother organization, is now registered as an NGO run by IIT Kharagpur alumni and other like-minded individuals. Our journey began when we met Mr. Tarak Chandra Paul, an environmentalist with an exceptional passion for green initiatives. We invited him to our IIT Kharagpur campus and organized awareness programs that received an overwhelming response from students, faculty, and campus residents. This enthusiasm motivated us to consider how we could contribute to building a better future. The team then embarked on various projects, campaigns, and initiatives to address environmental issues. We recognized the need to bring all stakeholders together under one umbrella for this common goal. The team was bolstered by the support of Prof. P. P. Chakraborty (Former Director, IIT Kharagpur), Prof. W. Mohanty (Gymkhana president), Prof. P. Patnaik, Late B.B. Rai (Senior Engg Horticulture section), and many other faculty members during our initial phases. Furthermore, the unwavering support from Ms. B. Chakraborty, Ms. A. Patnaik, and other campus residents tremendously helped us shape our idea.\n3.2 Incorporation as a Gymkhana society\nFinally, TES was formalized as a full-fledged Gymkhana society in November 2021. Since then, it has grown steadily and is perhaps the first student organization in IIT dedicated to environmental issues. TES now has over 30 student members, including undergraduate, postgraduate, and research scholars.\n4 Leadership\n4.1 Founders\nBiswarup Mondal, Dr. Sirsendu Sekhar Barman and Dr. Pragnaditya Malakar\n4.2 First governing members\nDr. Bijan Kumar Das, Dr. Saptarshi Lahiri, Dr. Atanuka Paul, Dr. Koushik Haldar, Anjan Sarkar, Dr. Prerona Das, Varisha Farheen, Dr. Tuhin Chakraborty, Victor Avisek Chatterjee, Sovan Lal Banerjee, Dr. Jeet Majumdar, Shibayan Kayal, Dr. Raj Poddar, Tanumoy Mondal, Dr. Urmi Ghosh, Soumya Sandhukhan\n4.3 Current leadership\nAcademic session 2022-2023\nGovernors:\n Rupashree Saha (Research scholar, Geology)  Subhadip Sarkar (Research scholar, CORAL)  Snehangsu Mishra (Research scholar, Energy)  Samik Mukhapadhay (UG, Civil Engg)\nHeads & Members:\nSreya Sengupta, Ankit Dipta Dutta, Priyantan Gupta, Puja Dey, Ankit Senapati, Alice Tongbram, Nitesh Jha, Ayushi Dhar, Atreyee Dey, Rishav Sahoo, Amit Mondal, Srinivasarao M, Hema Jha, Somya Ranjan Dass , Singhmar Harbaksh Singh, Utsav Kyada, Sumit kumar, Bhupesh Verma, Abhishek Singh Maurya, Ravi Katariya, Rajvardhan Singh Jadon, Komal Arya, Tanmay Ekade, Koushal Mujalde, Vinit Mujalda, Ajinkya, A Hasitha, Rishitha Merugu, Golla Meghanandh Manvith Prabhash, K Venkata Gnaneswar, Akash Kumar, Nithya Reddy Vedium\nProfessor in-charge:\n Prof. Manjira Sinha  Prof. Subha Verma\n4.4 Past leadership\nAcademic session 2021-2022\nGovernors:\n Biswarup Mondal (Research scholar, Chemical Engg),  Atanuka Paul (Research scholar, Chemistry)\nProject heads & Members:\nSoumya Sandhukhan, Rupashree Saha, Sreya Sengupta, Urmi Ghosh, Subhadip Sarkar, Nilanjan Mondal, Snehangshu Mishra, Priyantan Gupta, Puja Dey, Nikitasha Chatterjee, Soumya Sarathi Ganguly, Oindrila Nath, Ankit Senapati, Atreyee Dey\nProfessor in-charge:\n Prof. Manjira Sinha\n Prof. Subha Verma\n5 Functioning\n5.1 Selection procedure\nThe membership in the TES will be issued in the autumn semester (July-December). While conducting the membership drive, separate introductory outreaches will be organized for UG, PG & RS students.\n5.2 Organizational structure\n Board of Mentors: Faculty members\n Voluntary Advisory Member: 4th year of membership\n Senior Executive Member/Governors: 3rd year of membership\n Executive Member: 2nd year of membership\n General member: 1st year of membership\nSocial media links\nFacebook page: https://www.facebook.com/TESIITKGP/\nInstagram page: https://www.instagram.com/tesiitkgp/\nEmail ID: [email protected]",
    "page": "Technology Environment Society",
    "source": "https://wiki.metakgp.org/w/Technology_Environment_Society"
  }
]