[
  {
    "chunk_id": "info_03f9f5",
    "title": "Technology Comedy Club - Quick Facts",
    "text": "Activities | Standup\nUnder TSG | Yes",
    "page": "Technology Comedy Club",
    "source": "https://wiki.metakgp.org/w/Technology_Comedy_Club"
  },
  {
    "chunk_id": "21036068",
    "title": "Technology Comedy Club",
    "text": "\"Technology Comedy Club\" is the IIT Kharagpur's Official Comedy Club for all the outbursts of humor and blasts of laughter.",
    "page": "Technology Comedy Club",
    "source": "https://wiki.metakgp.org/w/Technology_Comedy_Club"
  },
  {
    "chunk_id": "b08d6949",
    "title": "Selection Procedure",
    "text": "TCC selection auditions are held once per year, open for all, in August for active membership for all years in IIT KGP. The society selects a batch of 40-50 first years (UG) and 5-10 (PG/PhD) at the beginning of the academic year soon after the Introductory Seminar. The selection procedure includes the selection of members in various verticals such as Standup, Improv Comedy, Writing, Video Editing, and Design Team Members. The Selection day spans 3 days and all the tasks for selection are delegated through Google Forms.\nIn rare cases, exceptional and highly enthusiastic people are also inducted into TCC who share a similar passion for making people laugh and contributing to the club, but as it's already mentioned, it's very rare so don't miss out on the selections!",
    "page": "Technology Comedy Club",
    "source": "https://wiki.metakgp.org/w/Technology_Comedy_Club"
  },
  {
    "chunk_id": "0cec0fb4",
    "title": "Organizational Structure",
    "text": "TCC has five governors selected by the club advisors every year who govern the society and represent it in the Gymkhana. The Club also makes a Governing team which is responsible for the smooth functioning of the Club",
    "page": "Technology Comedy Club",
    "source": "https://wiki.metakgp.org/w/Technology_Comedy_Club"
  },
  {
    "chunk_id": "9ed8108e",
    "title": "Introductory Seminar",
    "text": "In the initial weeks of the freshmen year, the TCC hosts the \"Introductory Seminar\" for the new batch of freshman students. The event features various exciting performances by sophomores, including stand-up comedy, sketches, presentations (PPTs), and many other forms of comedy such as roasts, funny videos, improv comedy, and more.",
    "page": "Technology Comedy Club",
    "source": "https://wiki.metakgp.org/w/Technology_Comedy_Club"
  },
  {
    "chunk_id": "add9b339",
    "title": "Cycle Trip",
    "text": "After selecting the new batch of students, we kick off with an epic bonding session. The adventure includes a cycle tour around the campus, hitting all the iconic spots at IIT KGP, and loads of fun improv games at different locations. Plus, there's a special treat from the sophomores to top it all off!",
    "page": "Technology Comedy Club",
    "source": "https://wiki.metakgp.org/w/Technology_Comedy_Club"
  },
  {
    "chunk_id": "38968a2f",
    "title": "Workshops",
    "text": "Workshops are conducted for the newest batch of members in which members from all the years participate and pass on all their knowledge about the subject of humor and help the freshers to learn and grow. Many fun exercises are also conducted for their nurturing and better understanding of the matter.",
    "page": "Technology Comedy Club",
    "source": "https://wiki.metakgp.org/w/Technology_Comedy_Club"
  },
  {
    "chunk_id": "08042be5",
    "title": "Freshers Production",
    "text": "With the help of all the knowledge gained during the rigorous 3-day workshops, the club freshers are ready to do something on their own, and here comes the Fresher's Production or FP which we commonly call it. The FP is performed solely by the freshers with the help of seniors of the society.",
    "page": "Technology Comedy Club",
    "source": "https://wiki.metakgp.org/w/Technology_Comedy_Club"
  },
  {
    "chunk_id": "d83cbb9d",
    "title": "Annual Production",
    "text": "The Final Flagship Event of the Technology Comedy Club consists of various performances by many members of society.",
    "page": "Technology Comedy Club",
    "source": "https://wiki.metakgp.org/w/Technology_Comedy_Club"
  },
  {
    "chunk_id": "ddfaba97",
    "title": "List of Governors",
    "text": "2024-25 | Sneh Vijayvergiya (NA '26) | Sparch Chauhan (EE '26) | Madhav Seth (CE '26) | Priyansh Goyal (EC '26) | Ansh Kakkar (IM '26)\n2023-24 | Sayan Ghosh (CH '26) | Anurag Gupta (HS '26) | Utkarsh Singh (MA '26) | Vedant Kulkarni (BT '26) | Divyansh Singh Rana (AG '26)\n2022-23 | Manav Sharma (EC '25) | Sameer Saurabh (MI '25) | Karan Singh Tahiliani (HS '25) | Riyan Biswas (MT '25) | Kajol Sahu (CY '25)",
    "page": "Technology Comedy Club",
    "source": "https://wiki.metakgp.org/w/Technology_Comedy_Club"
  }
]