[
  {
    "chunk_id": "info_7faa85",
    "title": "Telugu Cultural Association - Quick Facts",
    "text": "STUDENTS' TELUGU CULTURAL ASSOCIATION\nActivities | Socio-Cultural\nFounded | 1960\nNumber of members | 80-100\nWebsite | www .instagram .com /tca .iitkgp /\nContact | [email protected]",
    "page": "Telugu Cultural Association",
    "source": "https://wiki.metakgp.org/w/Telugu_Cultural_Association"
  },
  {
    "chunk_id": "52e0876a",
    "title": "Telugu Cultural Association",
    "text": "Telugu Cultural Association promotes Telugu culture at the KGP campus. It is the most prominent cultural association in the IIT KGP and performs its activities so that the people can savor the brilliance of Telugu culture, arts, and cuisines. TCA gathers all the Telugu people in one place, strengthening solid social bonds and creating an environment for the preservation and growth of Telugu culture",
    "page": "Telugu Cultural Association",
    "source": "https://wiki.metakgp.org/w/Telugu_Cultural_Association"
  },
  {
    "chunk_id": "5459ddc9",
    "title": "History",
    "text": "Kharagpur has been historically known by the alias “Second Andhra” because of the Telugu diaspora from then Andhra Pradesh settling at Kharagpur for Railway jobs and IITKGP being the first premiere institute of the Nation.\nTCA was founded in the 1960s by Telugu professors to celebrate Telugu festivals and uphold a culture far from home. The body used to function as an association wherein funds were raised amongst the professors to organize traditional events and festival celebrations. As time progressed, in the '90s, students residing on campus began attending the events and participated in a few. By the early 2000s, there was harmony between the students, faculty, and staff bodies.\nDue to the rising internet culture, the advent of social media, and the ever-growing number of students from the Telugu States, students have become an integral part of the association since 2012. To cater to this, a separate section of the association was formed in October 2023, now known as the Students’ Telugu Cultural Association.",
    "page": "Telugu Cultural Association",
    "source": "https://wiki.metakgp.org/w/Telugu_Cultural_Association"
  },
  {
    "chunk_id": "5975ed77",
    "title": "Vision",
    "text": "Students’ TCA aims to build a community that promotes Telugu culture and unites people to celebrate our rich heritage and share our love for our language, music, dance, and art. This is done by organizing the plethora of events celebrated in the Telugu states. Though times change and new trends kick into the Gen-Z population, we believe in a Culture-holistic approach to organize events and maintain a home-like environment for the Telugu junta.",
    "page": "Telugu Cultural Association",
    "source": "https://wiki.metakgp.org/w/Telugu_Cultural_Association"
  },
  {
    "chunk_id": "0e2f61b8",
    "title": "Structure",
    "text": "The heads are called “Joint Secretaries” and are 4 in number. They are usually 4th year undergraduate students. One of them must be a female undergraduate student pursuing a dual-degree course at IITKGP. A new post was introduced in 2023 Spring when TCA was restarted by a group of 5th-year Telugu undergraduate students, headed by Kumidhini Kesana , who then became the “Governor” of TCA. According to the constitution drafted by the succeeding team, the position of Governor will be discontinued from the 2025 Autumn semester.\nThe rest of the crew includes third--, second-, and first-year students, termed “Members” of the association. Finally, an advisory board is nominated by the faculty edition of TCA consisting of two professors or staff to guide and advise the student body, formalize the proceedings of every event thus acting as a bridge between STCA and TCA.",
    "page": "Telugu Cultural Association",
    "source": "https://wiki.metakgp.org/w/Telugu_Cultural_Association"
  },
  {
    "chunk_id": "beb76d9a",
    "title": "Events",
    "text": "Telugu Cultural Association has organized festival celebrations such as Bhogi, Sankranthi, FETE, Ugadi, Sri Rama Navami, Vinayaka Chavithi, and Cultural Night. STCA decided to take it a step further and develop the association into a community addressing all the sociocultural aspects of the Telugu junta. These include but are not limited to:",
    "page": "Telugu Cultural Association",
    "source": "https://wiki.metakgp.org/w/Telugu_Cultural_Association"
  },
  {
    "chunk_id": "f912753f",
    "title": "SPRING",
    "text": "• Bhogi and Sankranthi\n• Shivaratri cinema screening\n• Holi Flashmob\n• Fundae Session\n• Ugadi\n• Sri Rama Navami",
    "page": "Telugu Cultural Association",
    "source": "https://wiki.metakgp.org/w/Telugu_Cultural_Association"
  },
  {
    "chunk_id": "4426d6a2",
    "title": "AUTUMN",
    "text": "• Freshers Introduction\n• Treasure Hunt\n• Telugu Bhasha Dinotsavam\n• Vinayaka Chavithi\n• Janmashtami cinema screening\n• Cultural Night\nTCA has conducted guest talks with eminent spiritual personalities in Telugu, such as Chinna Jeeyar Swamy Chaganti Koteswara Rao. STCA has taken it a step further to host a guest talk by Padmasri Awardee Dr. Garikipati Narasimharao on topics ranging from dealing with academic stress to adopting an ideal student lifestyle.",
    "page": "Telugu Cultural Association",
    "source": "https://wiki.metakgp.org/w/Telugu_Cultural_Association"
  },
  {
    "chunk_id": "98f20c9e",
    "title": "Media and Internet coverage",
    "text": "TCA has been operating its YouTube channel since 2011, and music and dance performances during the events are uploaded. The responses have been tremendous, with over 50,000 subscribers, 340 videos, and 20M+ views.\nSeveral Sankranthi and Ugadi celebration clippings have been in local Bengali and regional Telugu newspapers such as Eenadu .\nA Popular Telugu production house and social media content team, “Chai Bisket,” has featured TCA on “15 Rocking “College Dance Performances” on YouTube, which is worth a watch.”\nThe new Instagram page , launched in April 2023, has quickly gained the attraction of many, with 90,000+ impressions and a solid interaction rate. The posters, event teasers, and after-movie videos have gained great appreciation from the Telugu junta for their quirky editing and excellent quality.",
    "page": "Telugu Cultural Association",
    "source": "https://wiki.metakgp.org/w/Telugu_Cultural_Association"
  },
  {
    "chunk_id": "a0bb4be6",
    "title": "Heads, Governors & Joint Secretaries",
    "text": "Academic Year | Position | Names\n2023-24 | Governors | Tridev Rapeti | Vikas Nalli\nJoint Secretaries | Abhirama Gorti | Suvvari Venkata Sai | Akhila Chukka | Mohan Chandu\n2022-23 | Governors | Kumidhi Kesana | Vijayavardhan Pasagadugula\nJoint Secretaries | Tridev Rapeti | Vaibhav Machavarapu | Vikas Nalli\n2020-21 | Heads | Thriloknath Palla | Abhi Reddy | Manoj Nagireddy | Sreeja Karem\n2019-20 | Heads | Surya Vishal | Sneha Vinjam | Prudhvi Kintada | Akhil Netrambaka\n2018-19 | Heads | Manish Asa | Narmeta Shashank | Prasanna Kumar Mulagalapalli | Vangala Raviteja\n2017-18 | Heads | Aakash Sangani | Muni Lohith Konidala | Pranitha Sriramoju | Vedasheersh Boorla\n2016-17 | Heads | Mythri Tg | Prathyusha Dabbara | Ravi Yenugula | Renukrishna Gutta\n2015-16 | Heads | Akshay Kumar | Kumarbabu Ghanta | Gontla Prathyusha\n2014-15 | Heads | Aravind Chebolu | Geeta Sravanthi | Kishore Reddy | Spandana Korabandi\n2013-14 | Heads | Ashok Reddy | Usha Rani | Kiran Kumar | Jai Sankar\n2012-13 | Heads | Sampath MVSS | Sreekanth Reddy | Krishna Vamsi | Sri Pooja",
    "page": "Telugu Cultural Association",
    "source": "https://wiki.metakgp.org/w/Telugu_Cultural_Association"
  }
]