[
  {
    "chunk_id": "info_09c41d",
    "title": "The Scholars%27 Avenue - Quick Facts",
    "text": "Forthrightly yours, fortnightly yours\nActivities | Campus Media Body\nFounded | 2005\nFounder(s) | Amit Gupta Puneet Agarwal Sandeep Rath\nNumber of members | 52\nWebsite | www .scholarsavenue .org\nUnder TSG | No\nReferences: [ 1 ]",
    "page": "The Scholars%27 Avenue",
    "source": "https://wiki.metakgp.org/w/The_Scholars%27_Avenue"
  },
  {
    "chunk_id": "9c000298",
    "title": "The Scholars%27 Avenue",
    "text": "The Scholars’ Avenue is the independent student-run campus newspaper of the Indian Institute of Technology, Kharagpur.\nThis article is about the society named \"The Scholars' Avenue\". For information about the road named Scholars' Avenue, see Scholars' Avenue .",
    "page": "The Scholars%27 Avenue",
    "source": "https://wiki.metakgp.org/w/The_Scholars%27_Avenue"
  },
  {
    "chunk_id": "678f9182",
    "title": "About",
    "text": "The Scholars’ Avenue (TSA or ScholsAve) is the independent student-run campus newspaper of the Indian Institute of Technology, Kharagpur. Founded in 2005, copies of The Scholars’ Avenue were initially delivered to all the students on campus, with soft copies being mailed to the faculty and several thousand alumni all over the world.\nEach of the issues is a juxtaposition of the informational, the technical and the creative. ScholsAve reports campus events and happenings, functions as a public interface between students and the administration, summarizes technical advancements taking shape on campus and not the least, prints the funnies. Its pieces include:\n• Editorials : The editors’ take on the successive issues that have affected IIT Kharagpur’s campus.\n• Interviews : Interviews with luminaries such as Nawazuddin Siddiqui, Kris Gopalakrishnan, Prahlad Kakkar, KK, Pandit Hariprasad Chaurasia et al.\n• Guest Articles : Featured articles from guests.\n• Careers Avenue : A stab at increasing the horizons of the readers.\n• Tech Avenue : On-campus technical advancements in the spotlight.\n• Bhaat Avenue : Browse through our biweekly dose of humour.\nThe team is drawn entirely from the students of the institute and acts as the voice of the student community by reporting on events relevant to campus. TSA is also a non-profit organization independent of the administration of IIT Kharagpur and is supported by sponsorships and donations.",
    "page": "The Scholars%27 Avenue",
    "source": "https://wiki.metakgp.org/w/The_Scholars%27_Avenue"
  },
  {
    "chunk_id": "3ab4e396",
    "title": "Early Days",
    "text": "\"There have always been dreamers; because in our dreams we see not what is, but what can be. There have always been doers; because through our efforts, we make what-can-be what-is. This is how things become possible. This is how the quality of our life improves. Because we dream. Because we do. - Daewoo Motors\"\nThe Scholars' Avenue (TSA or ScholsAve) was borne out of one such dream. A dream to give IIT Kharagpur its own newspaper that would act as litmus for the mood on campus and provide a medium that students could capitalise to voice their views. It started off in 2005 with an aim to reach every single room on campus via print issues and soon forayed into online media with the establishment of it's website.\nQuite a number of issues in, The Scholars' Avenue raised the issue of the condition of the B. C. Roy hospital and reported about a strike within campus. Amidst misunderstandings, major decisions were made which included a ban on the Scholars' Avenue and curtailment of its website. The ban lasted less than a month and TSA decided to no longer stay under the Gymkhana – a move that made it free to decide its content but also left it financially crippled.",
    "page": "The Scholars%27 Avenue",
    "source": "https://wiki.metakgp.org/w/The_Scholars%27_Avenue"
  },
  {
    "chunk_id": "a86bb312",
    "title": "The Website",
    "text": "The Scholars' Avenue also has a large readership on their website where news is not the only thing that gets published. They also do a number of articles on different genres as listed below.",
    "page": "The Scholars%27 Avenue",
    "source": "https://wiki.metakgp.org/w/The_Scholars%27_Avenue"
  },
  {
    "chunk_id": "1efa6952",
    "title": "Interviews",
    "text": "A number of interviews are conducted whenever any major personality is in Campus, during elections, and various other situations that would be of potential interest to the KGP populace.\n|| Link to the Interview Section ||",
    "page": "The Scholars%27 Avenue",
    "source": "https://wiki.metakgp.org/w/The_Scholars%27_Avenue"
  },
  {
    "chunk_id": "3d18130a",
    "title": "GuestAve",
    "text": "GuestAve is an open section where anyone, from a fresher to The Student Senate can publish their articles from, after approaching the team. This section is mostly used by the Alums, The Gymkana, The Student Senate, among others, to convey information to the KGP readers. || Link to the Guestave section ||",
    "page": "The Scholars%27 Avenue",
    "source": "https://wiki.metakgp.org/w/The_Scholars%27_Avenue"
  },
  {
    "chunk_id": "be993187",
    "title": "InternPedia",
    "text": "It is a compilation of answers to the most frequently asked-for metrics and a detailed walkthrough of the nitty-gritty of the process. It contains an abounding number of companies, with a wide spectrum of profiles, making it the one-stop solution to all of your dilemmas and queries regarding the process of CDC Internships every year.",
    "page": "The Scholars%27 Avenue",
    "source": "https://wiki.metakgp.org/w/The_Scholars%27_Avenue"
  },
  {
    "chunk_id": "036324e4",
    "title": "AMA on Reddit",
    "text": "Atal Ashutosh Agarwal, the then VP of TSG , participated in an AMA (\"Ask Me Anything\") organised by ScholsAve on the \"thescholarsavenue\" subreddit in 2015. [ 2 ]",
    "page": "The Scholars%27 Avenue",
    "source": "https://wiki.metakgp.org/w/The_Scholars%27_Avenue"
  },
  {
    "chunk_id": "98056afc",
    "title": "References",
    "text": "↑ \"TSA Website - About Us\" . The Scholars' Avenue . Retrieved August 16, 2014 . ↑ \"I am Atal Ashutosh Agarwal, Vice President of the Technology Students' Gymkhana. Ask Me Anything!\" . September 8, 2015 . Retrieved September 8, 2015 .",
    "page": "The Scholars%27 Avenue",
    "source": "https://wiki.metakgp.org/w/The_Scholars%27_Avenue"
  },
  {
    "chunk_id": "abb00b35",
    "title": "Contact Managing Editors",
    "text": "Pratim Majumdar: +91 7622074074\nGouri Rajaram: +91 9900638792\nVaishnav Lembhe: +91 7775810993\nVatsal Krishna: +91 9765837717",
    "page": "The Scholars%27 Avenue",
    "source": "https://wiki.metakgp.org/w/The_Scholars%27_Avenue"
  }
]